{
  "topic": [
    {
      "sub-topic": "Overview",
      "Content": "CONSERVATION OF PLANTS AND ANIMALS"
    },
    {
      "sub-topic": "Experiences of Children in Forests",
      "Content": "We saw in Class VII that Paheli and Boojho had visited the forest along with Professor Ahmad and T ibu. They were eager to share their experiences with their classmates. Other children in the class were also eager to share their experiences as some of them had visited Bharatpur Sanctuary. Some others had heard about Kaziranga National Park, Lockchao Wildlife Sanctuary, Great Nicobar Biosphere Reserve and Tiger Reserve, etc."
    },
    {
      "sub-topic": "Deforestation Explanation",
      "Content": "A great variety of plants and animals exist on earth. They are essential for the well-being and survival of mankind. Today, a major threat to survival of these organisms is deforestation. We know that deforestation means clearing of forests and using that land for other purposes. Trees in the forest are cut for some of the purposes mentioned below: lProcuring land for cultivation. lBuilding houses and factories. lMaking furniture or using wood as fuel."
    },
    {
      "sub-topic": "Causes of Deforestation",
      "Content": "Some natural causes of deforestation are forest fires and severe droughts. Activity 5.1 Add more causes of deforestation to your list and classify them into natural and man-made."
    },
    {
      "sub-topic": "Consequences of Deforestation",
      "Content": "Paheli and Boojho recalled the consequences of deforestation. They remembered that deforestation increases the temperature and pollution level on the earth. It increases the level of carbon dioxide in the atmosphere. Ground water level also gets lowered. They know that deforestation disturbs the balance in nature. They were told by Professor Ahmad that if cutting of trees continues, rainfall and the fertility of the soil will decrease. Moreover, there will be increased chances of natural calamities such as floods and droughts."
    },
    {
      "sub-topic": "Effects on Soils and Water Cycle",
      "Content": "Recall that plants need carbon dioxide for photosynthesis. Fewer trees would mean that less carbon dioxide will be used up resulting in its increased amount in the atmosphere. This will lead to global warming as carbon dioxide traps the heat rays reflected by the earth. The increase in temperature on the earth disturbs the water cycle and may reduce rainfall. This could cause droughts. Deforestation is a major cause which leads to the change in soil properties. Physical properties of the soil get affected by plantation and vegetation. Fewer trees result in more soil erosion. Removal of the top layer of the soil exposes the lower, hard and rocky layers. This soil has less humus and is less fertile. Gradually the fertile land gets converted into deserts. It is called desertification. Deforestation also leads to a decrease in the water holding capacity of the soil. The movement of water from the soil surface into the ground (infiltration rate) is reduced. So, there are floods."
    },
    {
      "sub-topic": "Impact on Animal Life",
      "Content": "We have studied in Class VII that we get many products from forests. List these products. Will we face shortage of these products if we continue cutting trees? Activity 5.2 Animal life is also affected by deforestation. How? List the points and discuss them in your class."
    },
    {
      "sub-topic": "Conservation Awareness",
      "Content": "Having become aware of the effects of deforestation, Paheli and Boojho are worried. They go to Professor Ahmad and ask him how forests and wildlife can be saved. Biosphere is that part of the earth in which living organisms exist or which supports life. Biological diversity or biodiversity, refers to the variety of organisms existing on the earth, their interrelationships and their relationship with the environment."
    },
    {
      "sub-topic": "Biosphere Reserve Introduction",
      "Content": "Professor Ahmad organizes a visit to a biosphere reserve for Paheli, Boojho and their classmates. He selects a place named Pachmarhi Biosphere Reserve. He knows that the plants and animals found here are similar to those of the upper Himalayan peaks and to those belonging to the lower western ghats. Professor Ahmad believes that the biodiversity found here is unique. He requests Madhavji, a forest employee, to guide the children inside the biosphere reserve. He explains that preserving areas of such biological importance make them a part of our national heritage."
    },
    {
      "sub-topic": "Protected Areas for Conservation",
      "Content": "To protect our flora and fauna and their habitats, protected areas called wildlife sanctuaries, national parks and biosphere reserves have been earmarked. Plantation, cultivation, grazing, felling trees, hunting and poaching are prohibited there. Wildlife Sanctuary: Areas where animals are protected from any disturbance to them and their habitat. National Park: Areas reserved for wild life where they can freely use the habitats and natural resources. Biosphere Reserve: Large areas of protected land for conservation of wild life, plant and animal resources and traditional life of the tribals living in the area."
    },
    {
      "sub-topic": "Biodiversity in Biosphere Reserves",
      "Content": "Children along with Professor Ahmad and Madhavji enter the biosphere reserve area. Madhavji explains that biosphere reserves are the areas meant for conservation of biodiversity. The biosphere reserves help to maintain the biodiversity and culture of that area. A biosphere reserve may also contain other protected areas in it. The Pachmarhi Biosphere Reserve consists of one national park named Satpura and two wildlife sanctuaries named Bori and Pachmarhi (Fig. 5.1)."
    },
    {
      "sub-topic": "Flora and Fauna Overview",
      "Content": "As the children walk around the biosphere reserve they appreciate the green wealth of the forest. They are very happy to see tall teak trees and animals inside the forest. Suddenly, Paheli finds a rabbit and wants to catch it. She starts running after it. Professor Ahmad stops her. He explains that animals are comfortable and happy in their own habitat. We should not disturb them. Madhavji explains that some animals and plants typically belong to a particular area. The plants and animals found in a particular area are termed flora and fauna respectively of that area. Sal, teak, mango, jamun, silver ferns, arjun, etc., are the flora and chinkara, blue-bull, barking deer, cheetal, leopard, wild dog, wolf, etc., are examples of the fauna of the Pachmarhi Biosphere Reserve (Fig. 5.2)."
    },
    {
      "sub-topic": "Endemic Species",
      "Content": "Soon the group quietly enters the deep forest. Children are surprised to see a very big squirrel. This squirrel has a big fluffy tail. They are very curious to know about it. Madhavji tells them that this is known as the giant squirrel and is endemic to this area. Endemic species are those species of plants and animals which are found exclusively in a particular area. They are not naturally found anywhere else. A particular type of animal or plant may be endemic to a zone, a state or a country."
    },
    {
      "sub-topic": "Importance of Endemic Species",
      "Content": "Madhavji shows sal and wild mango (Fig. 5.3 (a)) as two examples of the endemic flora of the Pachmarhi Biosphere Reserve. Bison, Indian giant squirrel (Fig. 5.3 (b)) and flying squirrel are endemic fauna of this area. Professor Ahmad explains that the destruction of their habitat, increasing population and introduction of new species may affect the natural habitat of endemic species and endanger their existence. Species is a group of population which are capable of interbreeding. This means that the members of a species can reproduce fertile offspring only with the members of their own species and not with members of other species. Members of a species have common characteristics."
    },
    {
      "sub-topic": "Wildlife Sanctuary Overview",
      "Content": "Soon Paheli sees a board with ‘Pachmarhi Wildlife Sanctuary’ written on it. Professor Ahmad explains that killing (poaching) or capturing animals in general is strictly prohibited and punishable by law in all such places. Wildlife Sanctuaries like reserve forests provide protection and suitable living conditions to wild animals."
    },
    {
      "sub-topic": "Activities Allowed in Wildlife Sanctuaries",
      "Content": "He also tells them that people living in wildlife sanctuaries are allowed to do certain activities such as grazing by their livestock, collecting medicinal plants, firewood, etc. instead of their natural habitat? In your opinion, will the animals be comfortable in a zoo or in their natural habitat?"
    },
    {
      "sub-topic": "National Park Overview",
      "Content": "On the roadside there was another board on which was written ‘Satpura National Park’. Children are now eager to go there. Madhavji tells them that these reserves are large and diverse enough to protect whole sets of ecosystems. They preserve flora, fauna, landscape and historic objects of an area. Satpura National Park is the first Reserve Forest of India. It is a pity that even protected forests are not safe because people living in the neighbourhood encroach upon them and destroy them."
    },
    {
      "sub-topic": "Wildlife Sanctuaries and Zoo Comparison",
      "Content": "Some of the threatened wild animals like black buck, white-eyed buck, elephant, golden cat, pink-headed duck, gharial, marsh crocodile, python, rhinoceros, etc., are protected and preserved in our wildlife sanctuaries. Indian sanctuaries have unique landscapes—broad level forests, mountain forests and bush lands in deltas of big rivers. Activity 5.7 Visit a nearby zoo. Observe the conditions provided to the animals. Were they suitable for the animals? Can animals live in artificial settings?"
    },
    {
      "sub-topic": "Cultural and Historical Significance in Parks and Reserves",
      "Content": "Rock shelters are also found inside the Satpura National Park. These are evidences of prehistoric human life in these jungles. These give us an idea of the life of primitive people. Rock paintings are found in these shelters. A total of 55 rock shelters have been identified in Pachmarhi Biosphere Reserve. Figures of animals and men fighting, hunting, dancing and playing musical instruments are depicted in these paintings. Many tribals still live in the area. As children move ahead, they see a board with ‘Satpura Tiger Reserve’ written on it. Madhavji explains that Project Tiger was launched by the government to protect the tigers in the country. The objective of this project was to ensure the survival and maintenance of the tiger population in the country."
    }
  ]
}