{
  "topic": [
    {
      "sub-topic": "Maturation and Development of the Egg",
      "Content": "the maturation of the egg, its release, thickening of uterine wall and its breakdown if pregnancy does not occur. In case the egg is fertilised it begins to divide and then gets embedded in the uterus for further development as you have learnt in Chapter 6 (Fig. 6.8)."
    },
    {
      "sub-topic": "Determination of Sex of the Baby",
      "Content": "Boy or Girl? Inside the fertilised egg or zygote is the instruction for determining the sex of the baby. This instruction is present in the thread-like structures, called chromosomes in the fertilised egg. Chromosomes are present inside the nucleus of every cell. All human beings have 23 pairs of chromosomes in the nuclei of their cells. Two chromosomes out of these are the sex chromosomes, named X and Y. A female has two X chromosomes, while a male has one X and one Y chromosome. The gametes (egg and sperm) have only one set of chromosomes. The unfertilised egg always has one X chromosome. But sperms are of two kinds. One kind has an X chromosome, and the other kind has a Y chromosome. See Fig. 7.4. When a sperm containing X chromosome fertilises the egg, the zygote would have two X chromosomes and develop into a female child. If the sperm contributes a Y chromosome to the egg (ovum) at fertilisation, the zygote would develop into a male child."
    },
    {
      "sub-topic": "Role of Sex Chromosomes in Gender Determination",
      "Content": "Now you know that the sex chromosomes of the father determine the sex of an unborn baby. The belief that the mother is responsible for the sex of her baby is completely wrong and to blame her for this is totally unjustified."
    },
    {
      "sub-topic": "Hormones and Endocrine Glands",
      "Content": "The hormones secreted by the pituitary stimulate testes and ovaries to produce their hormones. You have already learnt that the pituitary gland is an endocrine gland. It is attached to the brain. Apart from the pituitary, the testes and the ovaries, there are other endocrine glands in the body such as thyroid, pancreas and adrenals (Fig. 7.5)."
    },
    {
      "sub-topic": "Functions of Different Hormones",
      "Content": "Their aunt had told them that Kaka was suffering from ‘goitre’, a disease of the thyroid gland. Kaka’s thyroid gland was not producing the hormone thyroxine. Their aunt also told them that their uncle was suffering from ‘diabetes’ because his pancreas was not producing the hormone insulin in sufficient quantities. Boojho and Paheli then asked their aunt about the adrenal glands, which are also shown in the chart hung on the wall of her clinic. The aunt told them that adrenal glands secrete hormones which maintain the correct salt balance in the blood. Adrenals also produce the hormone adrenalin. It helps the body to adjust to stress when one is very angry, embarrassed or worried. Thyroid and adrenals secrete their hormones when they receive orders from the pituitary through its hormones. Pituitary also secretes growth hormone which is necessary for the normal growth of a person."
    },
    {
      "sub-topic": "Hormones in Metamorphosis",
      "Content": "You have already learnt about the life cycle of the frog. The tadpole passes through certain stages to become a frog (Chapter 6). This change from larva to adult is called metamorphosis (Fig. 6.10). Metamorphosis in insects is controlled by insect hormones. In a frog, it is controlled by thyroxine, the hormone produced by thyroid. Thyroxine production requires the presence of iodine in water. If the water in which the tadpoles are growing does not contain sufficient iodine, the tadpoles cannot become adults."
    },
    {
      "sub-topic": "Importance of Reproductive Health",
      "Content": "To keep the body healthy, every human being, at any age, needs to have a balanced diet. The person must also observe personal hygiene and undertake adequate physical exercise. During adolescence, however, these become even more essential as the body is growing."
    },
    {
      "sub-topic": "Nutritional Needs of Adolescents",
      "Content": "Adolescence is a stage of rapid growth and development. Hence the diet for an adolescent has to be carefully planned. You have already learnt what a balanced diet is. Recall that a balanced diet means that the meals include proteins, carbohydrates, fats and vitamins in requisite proportions. Our Indian meal of roti/rice, dal (pulses) and vegetables is a balanced meal. Milk is a balanced food in itself. Fruits also provide nourishment. For infants, mother’s milk provides all the nourishment that they need. Iron builds blood and iron-rich food such as leafy vegetables, jaggery, meat, citrus, Indian gooseberry (amla) are good for adolescents. Check items for lunch and dinner in your meal. Is the meal balanced and nutritious? Does it include cereals which give energy and milk, meat, nuts and pulses which provide proteins for growth? Also, does it include fats and sugar that give energy? What about fruits and vegetables which are protective foods? Chips and packed or tinned snacks, though very tasty should never replace regular meals as they do not have adequate nutritional value."
    },
    {
      "sub-topic": "Personal Hygiene",
      "Content": "Everyone should have a bath at least once every day. It is more necessary for teenagers because the increased activity of sweat glands sometimes makes the body smelly. All parts of the body should be washed and cleaned every day. If cleanliness is not maintained there are chances of catching bacterial infection. Girls should take special care of cleanliness during the time of menstrual flow. They should keep track of their menstrual cycle and be prepared for the onset of menstruation. Use sanitary napkin or clean homemade pads. Change pads after every 4–5 hours as per the requirement."
    },
    {
      "sub-topic": "Importance of Physical Exercise",
      "Content": "Walking and playing in fresh air keeps the body fit and healthy. All young boys and girls should take walks, exercise and play outdoor games."
    },
    {
      "sub-topic": "Say NO to Drugs",
      "Content": "Adolescence is a period of much activity in the body and mind which is a normal part of growing up. So do not feel confused or insecure. If anybody suggests that you will get relief if you take some drugs, just say ‘No’ unless prescribed by the doctor. Drugs are addictive. If you take them once, you feel like taking them again and again. They harm the body in the long run. They ruin health and happiness. You must have heard about AIDS which is caused by a dangerous virus, HIV. This virus can pass on to a normal person from an infected person by sharing the syringes used for injecting drugs. It can also be transmitted to an infant from the infected mother through her milk. The virus can also be transmitted through sexual contact with a person infected with HIV."
    },
    {
      "sub-topic": "Adolescent Pregnancy",
      "Content": "You might be knowing that in our country, the legal age for marriage is 18 years for girls and 21 years for boys. This is because teenage mothers are not prepared mentally or physically for motherhood. Early marriage and motherhood cause health problems in the mother and the child. It also curtails employment opportunities for the young woman and may cause mental agony as she is not ready for responsibilities of motherhood."
    },
    {
      "sub-topic": "Myths and Taboos Related to Adolescence",
      "Content": "You have learnt here and from Chapter 6 the scientific facts related to human reproduction. There are many wrong notions which you should now be able to discard as informed adolescents. For example, there are myths and taboos regarding bodily changes that adolescents experience. Some of these are given below and you can now argue why these are myths and not facts. 1.A girl becomes pregnant if she looks at boys during menstruation. 2.The mother is responsible for the sex of her child. 3.A girl should not be allowed to work in the kitchen during menstruation. You may come across many other myths and taboos. Discard them."
    },
    {
      "sub-topic": "Summary of Key Concepts in Adolescence",
      "Content": "Humans become capable of reproduction after puberty sets in. Children between the ages of 11 and 19 years are called adolescents. The onset of puberty brings about growth of the reproductive organs. Hair grow at various places on the body. Breasts develop in girls and facial hair (moustache and beard) appear in boys. Voice of boys becomes hoarse as voice box enlarges during adolescence. Children gain height during adolescence. The onset of puberty and maturity of reproductive parts are controlled by hormones. Hormones are secretions of endocrine glands which pour them directly into the blood stream. Pituitary gland secretes hormones which include growth hormone and hormones that make other glands such as the testes, ovaries, thyroids and adrenals, secrete hormones. Pancreas secretes insulin, thyroid produces thyroxine and adrenals produce adrenalin. Testosterone is the male hormone and estrogen, the female hormone. The uterine wall in females prepares itself to receive the developing fertilised egg. In case there is no fertilisation, the thickened lining of the uterine wall breaks down and goes out of the body along with blood. This is called menstruation. Sex of the unborn child depends on whether the zygote has XX or XY chromosomes. It is important to eat balanced food and maintain personal hygiene during adolescence."
    }
  ]
}