{
  "topic": [
    {
      "sub-topic": "Tiger Reserve and National Parks",
      "Content": "Tiger Reserve is unique in the sense that a significant increase in the population of tigers has been seen here. Once upon a time, animals like lions, elephants, wild animals has become difficult because of disturbances in their natural habitat. Professor Ahmad tells them that in order to protect plants and animals strict rules are imposed in all National Parks."
    },
    {
      "sub-topic": "Endangered Species and Ecosystems",
      "Content": "Animals whose numbers are diminishing to a level that they might face extinction are known as the endangered animals. Boojho is reminded of the dinosaurs which became extinct a long time ago. Are only big animals facing extinction? Madhavji tells Paheli that small animals are much more in danger of becoming extinct than the bigger animals. At times, we kill snakes, frogs, lizards, bats and owls ruthlessly without realising their importance in the ecosystem. By killing them we are harming ourselves. They might be small in size but their role in the ecosystem cannot be ignored. They form part of food chains and food webs. An ecosystem is made of all the plants, animals and microorganisms in an area along with non-living components such as climate, soil, river deltas etc."
    },
    {
      "sub-topic": "Red Data Book",
      "Content": "Professor Ahmad explains about Red Data Book to the children. He tells them that Red Data Book is the source book which keeps a record of all the endangered animals and plants. Red Data Book is maintained internationally by an organisation. India also maintains Red Data Book for plants and animals found in India."
    },
    {
      "sub-topic": "Migration",
      "Content": "Madhavji tells the children that these are migratory birds. These birds have flown here from other parts of the world. Migratory birds fly to far away areas every year during a particular time because of climatic changes. They fly for laying eggs as the weather in their natural habitat becomes very cold and inhospitable. Birds who cover long distances to reach another land are known as migratory birds."
    },
    {
      "sub-topic": "Recycling of Paper",
      "Content": "Professor Ahmad draws attention of the children to another cause of deforestation. He tells them that it takes 17 full grown trees to make one tonne of paper. Therefore, we should save paper. Professor Ahmad also tells that paper can be recycled five to seven times for use. If each student saves at least one sheet of paper in a day, we can save many trees in a year. We should save, reuse used paper and recycle it. By this we not only save trees but also save energy and water needed for manufacturing paper. Moreover, the amount of harmful chemicals used in paper making will also be reduced."
    },
    {
      "sub-topic": "Reforestation",
      "Content": "Professor Ahmad suggests that the answer to deforestation is reforestation. Reforestation is restocking of the destroyed forests by planting new trees. The planted trees should generally be of the same species which were found in that forest. We should plant at least as many trees as we cut. Reforestation can take place naturally also. If the deforested area is left undisturbed, it re-establishes itself. In natural reforestation there is no role of human beings. We have already caused tremendous damage to our forests. If we have to retain our green wealth for future generations, plantation of more trees is the only option. Professor Ahmad told them that in India we have the Forest (Conservation) Act. This act is aimed at preservation and conservation of natural forests and meeting the basic needs of the people living in or near the forests."
    },
    {
      "sub-topic": "Conservation of Plants and Animals",
      "Content": "What you have learnt include details about wildlife sanctuary, national park and biosphere reserve as names given to the areas meant for conservation and preservation of forest and wild animals. Biodiversity refers to the variety of living organisms in a specific area. Plants and animals of a particular area are known as the flora and fauna of that area. Endemic species are found only in a particular area. Endangered species are those which are facing the danger of extinction. Migration is the phenomenon of movement of a species from its own habitat to some other habitat for a particular time period every year for a specific purpose like breeding. Saving, reusing and recycling paper can help save trees, energy and water. Reforestation is significant for restocking destroyed forests."
    }
  ]
}