{
  "topic": [
    {
      "sub-topic": "Introduction to Human Reproduction",
      "Content": "In the previous chapter, you have learnt how animals reproduce. It is only after ‘growing up’ to a certain age that human beings and many other animals can reproduce. Why can humans reproduce only after a certain age? In this chapter, you will learn about changes that take place in the human body after which a person becomes capable of reproduction."
    },
    {
      "sub-topic": "Adolescence and Puberty",
      "Content": "Growing up is a natural process. The period of life, when the body undergoes changes, leading to reproductive maturity, is called adolescence. Adolescence begins around the age of 11 and lasts up to 18 or 19 years of age. Since this period covers the ‘teens’ (13 to 18 or 19 years of age), adolescents are also called ‘teenagers’. In girls, adolescence may begin a year or two earlier than in boys. Also, the period of adolescence varies from person to person. The human body undergoes several changes during adolescence. These changes mark the onset of puberty. The most important change which marks puberty is that boys and girls become capable of reproduction."
    },
    {
      "sub-topic": "Changes at Puberty",
      "Content": "The most conspicuous change during puberty is the sudden increase in height. At this time the long bones, that is, the bones of the arms and the legs elongate and make a person tall. Sometimes the arms and legs or hands and feet of adolescents look oversized and out of proportion with the body. But soon the other parts catch up and result in a proportionate body. All parts of the body do not grow at the same rate. This is because height depends on the genes inherited from parents. It is, however, very important to eat the right kind of food during these growing years. This helps the bones, muscles and other parts of the body get adequate nourishment for growth. In boys, the region below the waist and shoulders generally broaden as a result of growth. In girls, the region below the waist becomes wider. In boys, the muscles of the body grow more prominently than in the girls."
    },
    {
      "sub-topic": "Changes in Body Shape and Voice",
      "Content": "At puberty, the voice box or the larynx begins to grow. Boys develop larger voice boxes. The growing voice box in boys can be seen as a protruding part of the throat called Adam’s apple. In girls, the larynx is hardly visible from the outside because of its small size. Generally, girls have a high pitched voice, whereas boys have a deep voice. In adolescent boys, sometimes, the muscles of the growing voice box go out of control and the voice becomes hoarse. This state may remain for a few days or weeks after which the voice becomes normal. During puberty, boys begin to grow facial hair and also develop hair on their chest. In both, boys and girls, hair grows under the arms and in the region above the thighs or the pubic region. These features help to distinguish the male from the female—they are called secondary sexual characters."
    },
    {
      "sub-topic": "Mental, Intellectual and Emotional Maturity",
      "Content": "Adolescence is also a period of change in a person’s way of thinking. Adolescents are more independent than before and are also self-conscious. Intellectual development takes place and they tend to spend considerable time thinking. It is often the time in one’s life when the brain has the greatest capacity for learning. Sometimes, however, an adolescent may feel insecure while trying to adjust to the changes in the body and mind. But as adolescent learners, you should know that there is no reason to feel insecure. These changes are a natural part of growing up."
    },
    {
      "sub-topic": "Role of Hormones in Changes at Puberty",
      "Content": "The testes and ovaries secrete sex hormones. The male hormone or testosterone begins to be released by the testes at the onset of puberty. This causes changes in boys about which you have just learnt, for example, the growth of facial hair. Once puberty is reached in girls, ovaries begin to produce the female hormone or estrogen which makes the breasts develop. Milk secreting glands or mammary glands develop inside the breasts. The production of these hormones is under the control of another hormone secreted from an endocrine gland called pituitary gland."
    },
    {
      "sub-topic": "Reproductive Phase of Life in Humans",
      "Content": "The capacity for maturation and production of gametes lasts for a much longer time in males than in females. In females, the reproductive phase of life begins at puberty (10 to 12 years of age) and generally lasts till approximately 45 to 50 years. The ova begin to mature with the onset of puberty. One ovum matures and is released by one of the ovaries once in about 28 to 30 days. During this period, the wall of the uterus becomes thick to receive the egg, in case it is fertilised and begins to develop. This results in pregnancy. If fertilisation does not occur, the released egg and the thickened lining of the uterus along with its blood vessels are shed off, causing menstruation, which occurs once in about 28 to 30 days."
    }
  ]
}