{
  "topic": [
    {
      "sub-topic": "CROP PRODUCTION AND MANAGEMENT",
      "Content": "1.1 Agricultural Practices\nTill 10,000 B.C.E. people were nomadic. They were wandering in groups from place to place in search of food and shelter. They ate raw fruits and vegetables and started hunting animals for food. Later, they could cultivate land and produce rice, wheat and other food crops. Thus, was born ‘Agriculture’. When plants of the same kind are cultivated at one place on a large scale, it is called a crop. For example, crop of wheat means that all the plants grown in a field are that of wheat. You already know that crops are of different types like cereals, vegetables and fruits. These can be classified on the basis of the season in which they grow. India is a vast country. The climatic conditions like temperature, humidity and rainfall vary from one region to another. Accordingly, there is a rich variety of crops grown in different parts of the country. Despite this diversity, two broad cropping patterns can be identified. These are: (i) Kharif Crops: The crops which are sown in the rainy season are called kharif crops. The rainy season in India is generally from June to September. Paddy, maize, soyabean, groundnut and cotton are kharif crops. (ii) Rabi Crops: The crops grown in the winter season (October to March) are called rabi crops. Examples of rabi crops are wheat, gram, pea, mustard and linseed. Besides these, pulses and vegetables are grown during summer at many places. \n\n1.2 Basic Practices of Crop Production\nTo as agricultural practices which are listed below: (i) Preparation of soil (ii) Sowing (iii) Adding manure and fertilisers (iv) Irrigation (v) Protecting from weeds (vi) Harvesting (vii) Storage\n\n1.3 Preparation of Soil\nThe preparation of soil is the first step before growing a crop. One of the most important tasks in agriculture is to turn the soil and loosen it. This allows the roots to penetrate deep into the soil. The loose soil allows the roots to breathe easily even when they go deep into the soil. Why does the loosening of soil allow the roots to breathe easily? The loosened soil helps in the growth of earthworms and microbes present in the soil. These organisms are friends of the farmer since they further turn and loosen the soil and add humus to it. But why the soil needs to be turned and loosened? You have learnt in the previous classes that soil contains minerals, water, air and some living organisms. In addition, dead plants and animals get decomposed by soil organisms. In this way, various nutrients in the dead organisms are released back into the soil. These nutrients are again absorbed by plants. Since only a few centimetres of the top layer of soil supports plant growth, turning and loosening of soil brings the nutrient-rich soil to the top so that plants can use these nutrients. \n\n1.4 Sowing\nSowing is an important part of crop production. Before sowing, good quality, clean and healthy seeds of a good variety are selected. Farmers prefer to use seeds which give high yield. Selection of Seeds before sowing is crucial, ensuring optimal growth conditions and crop yield."
    },
    {
      "sub-topic": "Agricultural Tools",
      "Content": "Agricultural Implements\nBefore sowing the seeds, it is necessary to break soil clumps to get better yield. This is done with the help of various tools. The main tools used for this purpose are the plough, hoe and cultivator. Plough: This is being used since ancient times for tilling the soil, adding fertilisers to the crop, removing the weeds and turning the soil. This is made of wood and is drawn by a pair of bulls or other animals (horses and camels). It contains a strong triangular iron strip called ploughshare. The main part of the plough is a long log of wood which is called a ploughshaft. There is a handle at one end of the shaft. The other end is attached to a beam which is placed on the bulls’ necks. One pair of bulls and a man can easily operate the plough. \nHoe: It is a simple tool which is used for removing weeds and for loosening the soil. It has a long rod of wood or iron. A strong, broad and bent plate of iron is fixed to one of its ends and works like a blade. It is pulled by animals. Cultivator: Nowadays ploughing is done by tractor-driven cultivator. The use of cultivator saves labour and time. You may find that these activities are similar to those carried out by a gardener or even by you when you grow ornamental plants in your house."
    },
    {
      "sub-topic": "Nutrient Management",
      "Content": "1.5 Adding Manure and Fertilisers\nThe substances which are added to the soil in the form of nutrients for the healthy growth of plants are called manure and fertilisers. Soil supplies mineral nutrients to the crop plants. These nutrients are essential for the growth of plants. In certain areas, farmers grow crop after crop in the same field. The field is never left uncultivated or fallow. Imagine what happens to the nutrients? Continuous cultivation of crops makes the soil poor in nutrients. Therefore, farmers have to add manure to the fields to replenish the soil with nutrients. This process is called manuring. Improper or insufficient manuring results in weak plants. Manure is an organic substance obtained from the decomposition of plant or animal wastes. Farmers dump plant and animal waste in pits at open places and allow it to decompose. The decomposition is caused by some microorganisms. The decomposed matter is used as organic manure. Fertilisers are chemicals which are rich in a particular nutrient. How are they different from manure? Fertilisers are produced in factories. Some examples of fertilisers are — urea, ammonium sulphate, super phosphate, potash, NPK (Nitrogen, Phosphorus, Potassium). The use of fertilisers has helped farmers to get better yield of crops such as wheat, paddy and maize. But excessive use of fertilisers has made the soil less fertile. Therefore, in order to maintain the fertility of the soil, we have to substitute fertilisers with organic manure or leave the field uncultivated (fallow) in between two crops. \n\nThe use of manure improves soil texture as well as its water retaining capacity. It replenishes the soil with nutrients. Another method of replenishing the soil with nutrients is through crop rotation. This can be done by growing different crops alternately.\n"
    }
  ]
}