{
  "topic": [
    {
      "sub-topic": "Essential Requirements for Crop Growth",
      "Content": "sufficient sunlight and nutrients and minerals from the soil are essential."
    },
    {
      "sub-topic": "Crops and Fertilizers",
      "Content": "(i) Kharif crops (e) Paddy and maize\n(ii) Rabi crops (d) Wheat, gram, pea\n(iii) Chemical fertilisers (b) Urea and super phosphate\n(iv) Organic manure (c) Animal excreta, cow dung urine and plant waste"
    },
    {
      "sub-topic": "Examples of Crops",
      "Content": "(a) Kharif crop: Paddy, Maize\n(b) Rabi crop: Wheat, Gram"
    },
    {
      "sub-topic": "Important Agricultural Processes",
      "Content": "(a) Preparation of soil: The preparation of soil involves several steps, including ploughing, leveling, and adding manure to enhance soil fertility.\n(b) Sowing: Sowing is the process of planting seeds in the soil, which can be done manually or using machines.\n(c) Weeding: Weeding involves removing unwanted plants (weeds) that compete with the crops for nutrients, light, and space.\n(d) Threshing: Threshing is the method of separating the grain from the chaff after harvest, which can be performed by beating the harvested crop or using a threshing machine."
    },
    {
      "sub-topic": "Fertilisers vs. Manure",
      "Content": "Fertilisers are chemical substances that provide specific nutrients to crops, while manure is organic matter derived from plants and animals that improves soil structure and fertility over time."
    },
    {
      "sub-topic": "Irrigation Practices",
      "Content": "Irrigation is the process of supplying water to crops to aid their growth. Two methods of irrigation that conserve water include:\n1. Drip irrigation: This method involves delivering water directly to the base of the plant, minimizing evaporation and runoff.\n2. Sprinkler irrigation: This method uses a system of pipes and pumps to spray water like rainfall, reducing waste and runoff."
    },
    {
      "sub-topic": "Crops and Seasons",
      "Content": "If wheat is sown in the kharif season, it would not yield well since wheat is a rabi crop, which requires cooler temperatures to grow and is typically sown in the winter."
    },
    {
      "sub-topic": "Impact of Continuous Crop Plantation",
      "Content": "Continuous plantation of crops in a field can deplete the soil of essential nutrients, leading to decreased soil fertility. Additionally, it can result in soil degradation and increased vulnerability to pests."
    },
    {
      "sub-topic": "Weeds and Control Methods",
      "Content": "Weeds are unwanted plants that grow alongside crops. They can be controlled through methods such as manual removal, using herbicides, and implementing crop rotation to disrupt their growth cycle."
    },
    {
      "sub-topic": "Flow Chart of Sugarcane Crop Production",
      "Content": "1. Preparation of soil\n2. Manuring\n3. Sowing\n4. Irrigation\n5. Harvesting\n6. Sending crop to sugar factory."
    },
    {
      "sub-topic": "Word Puzzle Clues",
      "Content": "1. Providing water to the crops is irrigation.\n2. Keeping crop grains for a long time under proper conditions is storage.\n3. Certain plants of the same kind grown on a large scale are crops.\n4. A rabi crop that is also one of the pulses is gram.\n5. A machine used for cutting the matured crop is a harvester.\n6. A process of separating the grain from chaff is threshing."
    },
    {
      "sub-topic": "Extended Learning Activities",
      "Content": "(i) Observe daily whether drip irrigation saves water and note the changes in the seed.\n(ii) Collect different types of seeds, label them, and gather information about seed selection and methods of irrigation during field trips."
    },
    {
      "sub-topic": "Field Trip Reflection",
      "Content": "The visit to Shri Jiwan Patel’s farmhouse highlighted various aspects of crop production, including traditional versus modern agricultural practices, the importance of earthworms, and new techniques for enhanced crop yield."
    }
  ]
}