{
  "topic": [
    {
      "sub-topic": "Overview of Reproduction",
      "Content": "There are two modes by which animals reproduce. These are: (i) Sexual reproduction, and (ii) Asexual reproduction."
    },
    {
      "sub-topic": "Sexual Reproduction",
      "Content": "Reproduction resulting from the fusion of male and female gametes is called sexual reproduction. The reproductive organs in the female include ovaries, oviducts and uterus. The reproductive organs in male include testes, sperm ducts and penis. The ovary produces female gametes called ova and the testes produce male gametes called sperms. The fusion of ovum and sperm is called fertilisation. The fertilised egg is called a zygote. Fertilisation that takes place inside the female body is called internal fertilisation. This is observed in human beings and other animals such as hens, cows and dogs. Fertilisation that takes place outside the female body is called external fertilisation. This is observed in frogs, fish, starfish, etc. The zygote divides repeatedly to give rise to an embryo. The embryo gets embedded in the wall of the uterus for further development. The stage of the embryo in which all the body parts are identifiable is called foetus. Animals such as human beings, cows and dogs which give birth to young ones are called viviparous animals. Animals such as hen, frog, lizard and butterfly which lay eggs are called oviparous animals."
    },
    {
      "sub-topic": "Asexual Reproduction",
      "Content": "The type of reproduction in which only a single parent is involved is called asexual reproduction. In hydra, new individuals develop from buds. This method of asexual reproduction is called budding. Amoeba reproduces by dividing itself into two. This type of asexual reproduction is called binary fission. Apart from budding and binary fission, there are other methods by which a single parent reproduces young ones. You will study about these in your higher classes."
    },
    {
      "sub-topic": "Budding in Hydra",
      "Content": "Get permanent slides of hydra. Observe them using hand lens or a microscope. Look out for any bulges from the parent body. Count the number of bulges that you see in different slides. Also, note the size of the bulges. Draw the diagram of hydra, as you see it. Compare it with the Fig. 6.11. In each hydra, there may be one or more bulges. These bulges are the developing new individuals and they are called buds. Recall the presence of buds in yeast. In hydra too the new individuals develop as outgrowths from a single parent. This type of asexual reproduction in which only a single parent is involved is called asexual reproduction. Since new individuals develop from the buds in hydra, this type of asexual reproduction is called budding."
    },
    {
      "sub-topic": "Binary Fission in Amoeba",
      "Content": "Amoeba is a single-celled organism. It begins the process of reproduction by the division of its nucleus into two nuclei. This is followed by division of its body into two, each part receiving a nucleus. Finally, two amoebae are produced from one parent amoeba. This type of reproduction in which an animal reproduces by dividing into two individuals is called binary fission."
    },
    {
      "sub-topic": "Cloning - The Story of Dolly",
      "Content": "Cloning is the production of an exact copy of a cell, any other living part, or a complete organism. Cloning of an animal was successfully performed for the first time by Ian Wilmut and his colleagues at the Roslin Institute in Edinburgh, Scotland. They successfully cloned a sheep named Dolly. Dolly was born on 5th July 1996 and was the first mammal to be cloned. During the process of cloning Dolly, a cell was collected from the mammary gland of a female Finn Dorsett sheep. Simultaneously, an egg was obtained from a Scottish blackface ewe. The nucleus was removed from the egg. Then, the nucleus of the mammary gland cell from the Finn Dorsett sheep was inserted into the egg of the Scottish blackface ewe whose nucleus had been removed. The egg thus produced was implanted into the Scottish blackface ewe. Development of this egg followed normally and finally Dolly was born. Though Dolly was given birth by the Scottish blackface ewe, it was found to be absolutely identical to the Finn Dorsett sheep from which the nucleus was taken. Since the nucleus from the egg of the Scottish blackface ewe was removed, Dolly did not show any character of the Scottish blackface ewe. Dolly was a healthy clone of the Finn Dorsett sheep and produced several offspring of her own through normal sexual means. Unfortunately, Dolly died on 14th February 2003 due to a certain lung disease. Since Dolly, several attempts have been made to produce cloned mammals. However, many die before birth or die soon after birth. The cloned animals are many-a-times found to be born with severe abnormalities."
    },
    {
      "sub-topic": "Reproductive Roles in Honey Bees",
      "Content": "An interesting organisation is observed in a honey bee hive, a colony of several thousand bees. Only one bee in the colony lays eggs. This bee is called the queen bee. All other female bees are worker bees. Their main job is to build the hive, look after the young and feed the queen bee adequately to keep her healthy so that she can lay eggs. A queen bee lays thousands of eggs. The fertilised eggs hatch into females, while the unfertilised eggs give rise to males, called drones. It is the job of the worker bees to maintain the temperature of the hive at around 35 °C to incubate the eggs."
    },
    {
      "sub-topic": "Exercises on Reproduction",
      "Content": "Exercises: 1.Explain the importance of reproduction in organisms. 2.Describe the process of fertilisation in human beings. 3.Choose the most appropriate answer. (a)Internal fertilisation occurs (i)in female body. (ii)outside female body. (iii)in male body. (iv)outside male body. (b)A tadpole develops into an adult frog by the process of (i) fertilisation (ii) metamorphosis (iii) embedding (iv) budding (c)The number of nuclei present in a zygote is (i) none (ii) one (iii) two (iv) four 4.Indicate whether the following statements are True (T) or False (F). (a)Oviparous animals give birth to young ones. ( ) (b)Each sperm is a single cell. ( ) (c)External fertilisation takes place in frog. ( ) (d)A new human individual develops from a cell called gamete. ( ) (e)Egg laid after fertilisation is made up of a single cell. ( ) (f)Amoeba reproduces by budding. ( ) (g)Fertilisation is necessary even in asexual reproduction. ( ) (h)Binary fission is a method of asexual reproduction. ( ) (i)A zygote is formed as a result of fertilisation. ( ) (j)An embryo is made up of a single cell. ( ) 5.Give two differences between a zygote and a foetus. 6.Define asexual reproduction. Describe two methods of asexual reproduction in animals. 7.In which female reproductive organ does the embryo get embedded? 8.What is metamorphosis? Give examples. 9.Differentiate between internal fertilisation and external fertilisation."
    }
  ]
}