{
  "topic": [
    {
      "sub-topic": "Introduction to Reproduction",
      "Content": "Reproduction is essential for the continuation of a species. Imagine what would have happened if organisms had not reproduced. You will realise that reproduction is very important as it ensures the continuation of similar kinds of individuals, generation after generation. You have already learnt in your previous class about reproduction in plants. In this chapter, we shall learn how reproduction takes place in animals."
    },
    {
      "sub-topic": "Modes of Reproduction",
      "Content": "Just as in plants, there are two modes by which animals reproduce. These are: (i) Sexual reproduction, and (ii) Asexual reproduction."
    },
    {
      "sub-topic": "Sexual Reproduction",
      "Content": "Try to recall reproduction in plants which you studied in Class VII. Y ou will remember that plants that reproduce sexually have male and female reproductive parts. Can you name these parts? In animals also, males and females have different reproductive parts or organs. Like plants, the reproductive parts in animals also produce gametes that fuse to form a zygote. It is the zygote which develops into a new individual. This type of reproduction beginning from the fusion of male and female gametes is called sexual reproduction."
    },
    {
      "sub-topic": "Male Reproductive Organs",
      "Content": "The male reproductive organs include a pair of testes (singular, testis), two sperm ducts and a penis. The testes produce the male gametes called sperms. Millions of sperms are produced by the testes. Each sperm is a single cell with all the usual cell components."
    },
    {
      "sub-topic": "Female Reproductive Organs",
      "Content": "The female reproductive organs are a pair of ovaries, oviducts (fallopian tubes) and the uterus. The ovary produces female gametes called ova (eggs). In human beings, a single matured egg is released into the oviduct by one of the ovaries every month. Uterus is the part where development of the baby takes place. Like the sperm, an egg is also a single cell."
    },
    {
      "sub-topic": "Fertilisation",
      "Content": "The first step in the process of reproduction is the fusion of a sperm and an ovum. When sperms come in contact with an egg, one of the sperms may fuse with the egg. Such fusion of the egg and the sperm is called fertilisation. During fertilisation, the nuclei of the sperm and the egg fuse to form a single nucleus. This results in the formation of a fertilised egg or zygote. Fertilisation which takes place inside the female body is called internal fertilisation."
    },
    {
      "sub-topic": "In Vitro Fertilisation (IVF)",
      "Content": "In case fertilisation occurs, the zygote is allowed to develop for about a week and then it is placed in the mother’s uterus. Complete development takes place in the uterus and the baby is born like any other baby. Babies born through this technique are called test-tube babies."
    },
    {
      "sub-topic": "External Fertilisation",
      "Content": "Though these animals lay hundreds of eggs and release millions of sperms, all the eggs do not get fertilised and develop into new individuals. This is because the eggs and sperms get exposed to water movement, wind and rainfall. Also, there are other animals in the pond which may feed on eggs. Thus, production of large number of eggs and sperms is necessary to ensure fertilisation of at least a few of them."
    },
    {
      "sub-topic": "Development of Embryo",
      "Content": "Fertilisation results in the formation of zygote which begins to develop into an embryo. The zygote divides repeatedly to give rise to a ball of cells. The cells then begin to form groups that develop into different tissues and organs of the body. This developing structure is termed an embryo. The embryo gets embedded in the wall of the uterus for further development. The embryo continues to develop in the uterus."
    },
    {
      "sub-topic": "Metamorphosis",
      "Content": "The new individuals which are born or hatched from the eggs continue to grow till they become adults. In some animals, the young ones may look very different from the adults. The transformation of the larva into an adult through drastic changes is called metamorphosis."
    },
    {
      "sub-topic": "Viviparous and Oviparous Animals",
      "Content": "We have learnt that some animals give birth to young ones while some animals lay eggs which later develop into young ones. The animals which give birth to young ones are called viviparous animals. Those animals which lay eggs are called oviparous animals."
    },
    {
      "sub-topic": "Asexual Reproduction",
      "Content": "So far, we have learnt about reproduction in some familiar animals. But what about very small animals like hydra and microscopic organisms like amoeba? Do you know how they reproduce?"
    }
  ]
}