{
  "topic": [
    {
      "sub-topic": "Introduction to Microorganisms",
      "Content": "You have seen several kinds of plants and animals. However, there are other living organisms around us which we normally cannot see. These are called microorganisms or microbes. For example, you might have observed that during the rainy season moist bread gets spoilt and its surface gets covered with greyish white patches. Observe these patches through a magnifying glass. You will see tiny, black rounded structures. Do you know what these structures are and where do these come from? Microorganisms are so small in size that they cannot be seen with the unaided eye. Some of these, such as the fungus that grows on bread, can be seen with a magnifying glass. Others cannot be seen without the help of a microscope. That is why these are called microorganisms or microbes. Microorganisms are classified into four major groups: bacteria, fungi, protozoa, and some algae. Some of the common microorganisms are shown in Figs. 2.1 - 2.4. Viruses are also microscopic but are different from other microorganisms. They, however, reproduce only inside the cells of the host organism, which may be a bacterium, plant, or animal. Common ailments like cold, influenza (flu), and most coughs are caused by viruses. Serious diseases like polio and chicken pox are also caused by viruses. Diseases like dysentery and malaria are caused by protozoa, whereas typhoid and tuberculosis (TB) are bacterial diseases. You have learned about some of these microorganisms in Classes VI and VII."
    },
    {
      "sub-topic": "Habitat of Microorganisms",
      "Content": "Microorganisms may be single-celled like bacteria, some algae and protozoa, or multicellular, such as many algae and fungi. They live in all types of environment, ranging from ice-cold climates to hot springs; and deserts to marshy lands. They are also found inside the bodies of animals, including humans. Some microorganisms grow on other organisms while others exist freely."
    },
    {
      "sub-topic": "Role of Microorganisms in Human Life",
      "Content": "Microorganisms play an important role in our lives. Some of them are beneficial in many ways whereas some others are harmful and cause diseases. Microorganisms have been used for the production of alcohol since ages. They are used in the preparation of curd, bread, and cake. Curd contains several microorganisms. Of these, the bacterium Lactobacillus promotes the formation of curd. It multiplies in milk and converts it into curd. Bacteria are also involved in the making of cheese, pickles, and many other food items. Microorganisms are also used in cleaning up the environment. For example, the organic wastes (vegetable peels, remains of animals, faeces, etc.) are broken down into harmless and usable substances by bacteria."
    },
    {
      "sub-topic": "Microorganisms in Food Production",
      "Content": "Making of Curd and Bread: You have learned in Class VII that milk is turned into curd by bacteria. Activity 2.3 Take ½ kg flour (atta or maida), add some sugar and mix with warm water. Add a small amount of yeast powder and knead to make a soft dough. What do you observe after two hours? Did you find the dough rising? Louis Pasteur discovered fermentation in 1857. Yeast reproduces rapidly and produces carbon dioxide during respiration. Bubbles of the gas fill the dough and increase its volume. This is the basis of the use of yeast in the baking industry for making breads, pastries, and cakes."
    },
    {
      "sub-topic": "Commercial Use of Microorganisms",
      "Content": "Commercial Use of Microorganisms: Microorganisms are used for the large-scale production of alcohol, wine, and acetic acid (vinegar). Yeast is used for commercial production of alcohol and wine. For this purpose, yeast is grown on natural sugars present in grains like barley, wheat, rice, crushed fruit juices, etc."
    },
    {
      "sub-topic": "Medicinal Applications of Microorganisms",
      "Content": "Medicinal Use of Microorganisms: Whenever you fall ill the doctor may give you some antibiotic tablets, capsules, or injections such as penicillin. The source of these medicines is microorganisms. These medicines kill or stop the growth of disease-causing microorganisms. Such medicines are called antibiotics. These days a number of antibiotics are being produced from bacteria and fungi. It is important to remember that antibiotics should be taken only on the advice of a qualified doctor. Antibiotics, however, are not effective against cold and flu as these are caused by viruses."
    },
    {
      "sub-topic": "Vaccination",
      "Content": "Several diseases, including cholera, tuberculosis, smallpox, and hepatitis can be prevented by vaccination. A worldwide campaign against smallpox has finally led to its eradication from most parts of the world. These days vaccines are made on a large scale from microorganisms to protect humans and other animals from several diseases."
    },
    {
      "sub-topic": "Increasing Soil Fertility",
      "Content": "Some bacteria are able to fix nitrogen from the atmosphere to enrich soil with nitrogen and increase its fertility. These microbes are commonly called biological nitrogen fixers. The plant waste has been converted into manure by the action of microbes. The nutrients released in the process can be used by the plants again."
    },
    {
      "sub-topic": "Harmful Microorganisms",
      "Content": "Microorganisms are harmful in many ways. Some microorganisms spoil food, clothing, and leather. Such disease-causing microorganisms are called pathogens. Pathogens enter our body through the air we breathe, the water we drink or the food we eat. They can also get transmitted by direct contact with an infected person or carried by an animal. Pathogens stick to their bodies. When these flies sit on uncovered food, they may transfer the pathogens. So, it is advisable to always keep food covered. Another example of a carrier is the female Anopheles mosquito."
    }
  ]
}