{
  "topic": [
    {
      "sub-topic": "Complex Permanent Tissue",
      "Content": "The different types of tissues we have discussed until now are all made of one type of cells, which look like each other. Such tissues are called simple permanent tissue. Yet another type of permanent tissue is complex tissue. Complex tissues are made of more than one type of cells. All these cells coordinate to perform a common function. Xylem and phloem are examples of such complex tissues. They are both conducting tissues and constitute a vascular bundle."
    },
    {
      "sub-topic": "Phloem and Xylem",
      "Content": "Phloem transports food from leaves to other parts of the plant. Except phloem fibres, other phloem cells are living cells. Sieve plate, Sieve tube, Phloem parenchyma, Companion cell are the constituents of phloem. Xylem includes Tracheid, Vessel, Xylem parenchyma. "
    },
    {
      "sub-topic": "Animal Tissues",
      "Content": "When we breathe we can actually feel the movement of our chest. For this we have specialised cells called muscle cells. The contraction and relaxation of these cells result in movement. Blood flows and carries various substances from one part of the body to the other. For example, it carries oxygen and food to all cells. Blood and muscles are both examples of tissues found in our body."
    },
    {
      "sub-topic": "Epithelial Tissue",
      "Content": "The covering or protective tissues in the animal body are epithelial tissues. Epithelium covers most organs and cavities within the body. It also forms a barrier to keep different body systems separate. The skin, the lining of the mouth, the lining of blood vessels, lung alveoli and kidney tubules are all made of epithelial tissue. Epithelial tissue cells are tightly packed and form a continuous sheet."
    },
    {
      "sub-topic": "Connective Tissue",
      "Content": "Blood is a type of connective tissue. The cells of connective tissue are loosely spaced and embedded in an intercellular matrix. The matrix may be jelly-like, fluid, dense or rigid. Blood has a fluid (liquid) matrix called plasma, in which red blood corpuscles, white blood corpuscles and platelets are suspended. Bone is another example of a connective tissue. Bone cells are embedded in a hard matrix composed of calcium and phosphorus compounds."
    },
    {
      "sub-topic": "Muscular Tissue",
      "Content": "Muscular tissue consists of elongated cells, also called muscle fibres. This tissue is responsible for movement in our body. These muscles are called skeletal muscles as they are mostly attached to bones and help in body movement. Under the microscope, these muscles show alternate light and dark bands or striations when stained appropriately. Smooth muscles control involuntary movements."
    },
    {
      "sub-topic": "Nervous Tissue",
      "Content": "All cells possess the ability to respond to stimuli. However, cells of the nervous tissue are highly specialised for being stimulated and then transmitting the stimulus very rapidly from one place to another within the body. The brain, spinal cord and nerves are all composed of the nervous tissue. The cells of this tissue are called nerve cells or neurons."
    },
    {
      "sub-topic": "Summary of Tissue Types",
      "Content": "Tissue is a group of cells similar in structure and function. Plant tissues are of two main types – meristematic and permanent. Meristematic tissue is the dividing tissue present in the growing regions of the plant. Permanent tissues are derived from meristematic tissue once they lose the ability to divide. They are classified as simple and complex tissues. Parenchyma, collenchyma and sclerenchyma are three types of simple tissues. Xylem and phloem are types of complex tissues. Animal tissues can be epithelial, connective, muscular and nervous tissue."
    }
  ]
}