{
  "topic": [
    {
      "sub-topic": "Animal Health and Disease Management",
      "Content": "and internal parasites. The external parasites live on the skin and mainly cause skin diseases. The internal parasites like worms, affect stomach and intestine while flukes damage the liver. Infectious diseases are also caused by bacteria and viruses. Vaccinations are given to farm animals against many major viral and bacterial diseases."
    },
    {
      "sub-topic": "Poultry Farming",
      "Content": "Poultry farming is undertaken to raise domestic fowl for egg production and chicken meat. Therefore, improved poultry breeds are developed and farmed to produce layers for eggs and broilers for meat. The cross-breeding programmes between Indian (indigenous, for example, Aseel) and foreign (exotic, for example, Leghorn) breeds for variety improvement are focused on to develop new varieties for the following desirable traits— (i) number and quality of chicks;(ii) dwarf broiler parent for commercial chick production; (iii) summer adaptation capacity/tolerance to high temperature; (iv) low maintenance requirements; (v) reduction in the size of the egg-laying bird with the ability to utilize more fibrous cheaper diets formulated using agricultural by-products. The ration (daily food requirement) for broilers is protein rich with adequate fat. The level of vitamins A and K is kept high in the poultry feeds. Poultry fowl suffer from a number of diseases caused by virus, bacteria, fungi, parasites, as well as from nutritional deficiencies. These necessitate proper cleaning, sanitation, and spraying of disinfectants at regular intervals. Appropriate vaccination can prevent the occurrence of infectious diseases and reduce loss of poultry during an outbreak of disease."
    },
    {
      "sub-topic": "Fish Production",
      "Content": "Fish is a cheap source of animal protein for our food. Fish production includes the finned true fish as well as shellfish such as prawns and molluscs. There are two ways of obtaining fish: one is from natural resources, which is called capture fishing. The other way is by fish farming, which is called culture fishery. The water source of the fish can be either seawater or freshwater, such as in rivers and ponds. Fishing can thus be done both by capture and culture of fish in marine and freshwater ecosystems."
    },
    {
      "sub-topic": "Marine Fisheries",
      "Content": "India’s marine fishery resources include 7500 km of coastline and the deep seas beyond it. Popular marine fish varieties include pomfret, mackerel, tuna, sardines, and Bombay duck. Marine fish are caught using many kinds of fishing nets from fishing boats. Yields are increased by locating large schools of fish in the open sea using satellites and echo-sounders. Some marine fish of high economic value are also farmed in seawater. This includes finned fishes like mullets, bhetki, and pearl spots, shellfish such as prawns, mussels, and oysters as well as seaweed. Oysters are also cultivated for the pearls they make. As marine fish stocks get further depleted, the demand for more fish can only be met by such culture fisheries, a practice called mariculture."
    },
    {
      "sub-topic": "Inland Fisheries",
      "Content": "Freshwater resources include canals, ponds, reservoirs and rivers. Brackish water resources, where seawater and fresh water mix together, such as estuaries and lagoons are also important fish reservoirs. While capture fishing is also done in such inland water bodies, the yield is not high. Most fish production from these resources is through aquaculture. Fish culture is sometimes done in combination with a rice crop so that fish are grown in the water in the paddy field. More intensive fish farming can be done in composite fish culture systems. Both local and imported fish species are used in such systems. In such a system, a combination of five or six fish species is used in a single fish pond. These species are selected so that they do not compete for food among them having different types of food habits. As a result, the food available in all the parts of the pond is used. As Catlas are surface feeders, Rohus feed in the middle-zone of the pond, Mrigals and Common Carps are bottom feeders, and Grass Carps feed on the weeds; together these species can use all the food in the pond without competing with each other. This increases the fish yield from the pond."
    },
    {
      "sub-topic": "Bee-Keeping",
      "Content": "Honey is widely used and therefore beekeeping for making honey has become an agricultural enterprise. Since beekeeping needs low investments, farmers use it as an additional income-generating activity. In addition to honey, the beehives are a source of wax which is used in various medicinal preparations. The local varieties of bees used for commercial honey production are Apis cerana indica, commonly known as the Indian bee, A. dorsata, the rock bee and A. florae, the little bee. An Italian bee variety, A. mellifera, has also been brought in to increase yield of honey. This is the variety commonly used for commercial honey production. The Italian bees have high honey collection capacity. They sting somewhat less. They stay in a given beehive for long periods, and breed very well. For commercial honey production, bee farms or apiaries are established."
    }
  ]
}