{
  "topic": [
    {
      "sub-topic": "Osmosis and Diffusion",
      "Content": "an egg by dissolving it in dilute hydrochloric acid. The shell is mostly calcium carbonate. A thin outer skin now encloses the egg. Put the egg in pure water and observe after 5 minutes. What do we observe? The egg swells because water passes into it by osmosis. (b)Place a similar de-shelled egg in a concentrated salt solution and observe for 5 minutes. The egg shrinks. Why? Water passes out of the egg solution into the salt solution because the salt solution is more concentrated. We can also try a similar activity with dried raisins or apricots. Activity ______________ 5.4 •Put dried raisins or apricots in plain water and leave them for some time. Then place them into a concentrated solution of sugar or salt. You will observe the following: (a)Each gains water and swells when placed in water . (b)However , when placed in the concentrated solution it loses water , and consequently shrinks. Unicellular freshwater organisms and most plant cells tend to gain water through osmosis. Absorption of water by plant roots is also an example of osmosis. Thus, diffusion is important in exchange of gases and water in the life of a cell. In additions to this, the cell also obtains nutrition from its environment. Different molecules move in and out of the cell through a type of transport requiring use of energy. The plasma membrane is flexible and is made up of organic molecules called lipids and proteins. However , we can observe the structure of the plasma membrane only through an electron microscope. The flexibility of the cell membrane also enables the cell to engulf in food and other material from its external environment. Such processes are known as endocytosis. Amoeba acquires its food through such processes."
    },
    {
      "sub-topic": "Cell Wall and Plasmolysis",
      "Content": "5.2.2 CELL WALL Plant cells, in addition to the plasma membrane, have another rigid outer covering called the cell wall. The cell wall lies outside the plasma membrane. The plant cell wall is mainly composed of cellulose. Cellulose is a complex substance and provides structural strength to plants. When a living plant cell loses water through osmosis there is shrinkage or contraction of the contents of the cell away from the cell wall. This phenomenon is known as plasmolysis. We can observe this phenomenon by performing the following activity: Activity ______________ 5.6 •Mount the peel of a Rhoeo leaf in water on a slide and examine cells under the high power of a microscope. Note the small green granules, called chloroplasts. They contain a green substance called chlorophyll. Put a strong solution of sugar or salt on the mounted leaf on the slide. Wait for a minute and observe under a microscope. What do we see? •Now place some Rhoeo leaves in boiling water for a few minutes. This kills the cells. Then mount one leaf on a slide and observe it under a microscope. Put a strong solution of sugar or salt on the mounted leaf on the slide. Wait for a minute and observe it again. What do we find? Did plasmolysis occur now? What do we infer from this activity? It appears that only living cells, and not dead cells, are able to absorb water by osmosis. Cell walls permit the cells of plants, fungi and bacteria to withstand very dilute (hypotonic) external media without bursting. In such media the cells tend to take up water by osmosis. The cell swells, building up pressure against the cell wall. The wall exerts an equal pressure against the swollen cell. Because of their walls, such cells can withstand much greater changes in the surrounding medium than animal cells."
    },
    {
      "sub-topic": "Nucleus",
      "Content": "5.2.3 NUCLEUS Remember the temporary mount of onion peel we prepared? We had put iodine solution on the peel. Why? What would we see if we tried observing the peel without putting the iodine solution? Try it and see what the difference is. Further , when we put iodine solution on the peel, did each cell get evenly coloured? According to their chemical composition different regions of cells get coloured differentially. Some regions appear darker than other regions. Apart from iodine solution we could also use safranin solution or methylene blue solution to stain the cells. We have observed cells from an onion; let us now observe cells from our own body. Activity ______________ 5.7 •Let us take a glass slide with a drop of water on it. Using an ice-cream spoon gently scrape the inside surface of the cheek. Does any material get stuck on the spoon? With the help of a needle we can transfer this material and spread it evenly on the glass slide kept ready for this. To colour the material we can put a drop of methylene blue solution on it. Now the material is ready for observation under microscope. Do not forget to put a cover-slip on it! •What do we observe? What is the shape of the cells we see? Draw it on the observation sheet.Q 2024-25 SCIENCE 54 •Was there a darkly coloured, spherical or oval, dot-like structure near the centre of each cell? This structure is called nucleus. Were there similar structures in onion peel cells? The nucleus has a double layered covering called nuclear membrane. The nuclear membrane has pores which allow the transfer of material from inside the nucleus to its outside, that is, to the cytoplasm (which we will talk about in section 5.2.4). The nucleus contains chromosomes, which are visible as rod-shaped structures only when the cell is about to divide. Chromosomes contain information for inheritance of characters from parents to next generation in the form of DNA (Deoxyribo Nucleic Acid) molecules. Chromosomes are composed of DNA and protein. DNA molecules contain the information necessary for constructing and organising cells. Functional segments of DNA are called genes. In a cell which is not dividing, this DNA is present as part of chromatin material. Chromatin material is visible as entangled mass of thread like structures. Whenever the cell is about to divide, the chromatin material gets organised into chromosomes. The nucleus plays a central role in cellular reproduction, the process by which a single cell divides and forms two new cells. It also plays a crucial part, along with the environment, in determining the way the cell will develop and what form it will exhibit at maturity, by directing the chemical activities of the cell. In some organisms like bacteria, the nuclear region of the cell may be poorly defined due to the absence of a nuclear membrane. Such an undefined nuclear region containing only nucleic acids is called a nucleoid. Such organisms, whose cells lack a nuclear membrane, are called prokaryotes (Pro = primitive or primary; karyote ≈ karyon = nucleus). Organisms with cells having a nuclear membrane are called eukaryotes. Prokaryotic cells (see Fig. 5.4) also lack most of the other cytoplasmic organelles present in eukaryotic cells. Many of the functions of such organelles are also performed by poorly organised parts of the cytoplasm (see section 5.2.4). The chlorophyll in photosynthetic prokaryotic bacteria is associated with membranous vesicles (bag like structures) but not with plastids as in eukaryotic cells (see section 5.2.5). RibosomesPlasma membrane Cell wall Nucleoid Fig. 5.4: Prokaryotic cell"
    },
    {
      "sub-topic": "Cytoplasm and Prokaryotic vs Eukaryotic Cells",
      "Content": "5.2.4 CYTOPLASM When we look at the temporary mounts of onion peel as well as human cheek cells, we can see a large region of each cell enclosed by the cell membrane. This region takes up very little stain. It is called the cytoplasm. The cytoplasm is the fluid content inside the plasma membrane. It also contains many specialised cell organelles. Each of these organelles performs a specific function for the cell. Cell organelles are enclosed by membranes. In prokaryotes, beside the absence of a defined nuclear region, the membrane-bound cell organelles are also absent. On the other hand, the eukaryotic cells have nuclear membrane as well as membrane-enclosed organelles. The significance of membranes can be illustrated with the example of viruses. Viruses lack any membranes and hence do not show characteristics of life until they enter a living body and use its cell machinery to multiply. 2024-25 THE FUNDAMENTAL UNIT OF LIFE 55uestion 1.Fill in the gaps in the following table illustrating differences between prokaryotic and eukaryotic cells. Prokaryotic Cell Eukaryotic Cell 1.Size : generally 1.Size: generally small ( 1-10 µm) large ( 5-100 µm) 1 µm = 10–6 m 2.Nuclear region: 2.Nuclear region: _______________ well defined and _______________ surrounded by a and known as__ nuclear membrane 3.Chromosome: 3.More than one single chromosome 4.Membrane-bound 4._______________ cell organelles _______________ absent _______________"
    },
    {
      "sub-topic": "Cell Organelles",
      "Content": "5.2.5 CELL ORGANELLES Every cell has a membrane around it to keep its own contents separate from the external environment. Large and complex cells, including cells from multicellular organisms, need a lot of chemical activities to support their complicated structure and function. To keep these activities of different kinds separate from each other, these cells use membrane-bound little structures (or ‘organelles’) within themselves. This is one of the features of the eukaryotic cells that distinguish them from prokaryotic cells. Some of these organelles are visible only with an electron microscope. We have talked about the nucleus in a previous section. Some important examples of cell organelles which we will discuss now are: endoplasmic reticulum, Golgi apparatus, lysosomes, mitochondria and plastids. They are important because they carry out some very crucial functions in cells. 5.2.5 (i) ENDOPLASMIC RETICULUM (ER) The endoplasmic reticulum (ER) is a large network of membrane-bound tubes and sheets. It looks like long tubules or round or oblong bags (vesicles). The ER membrane is similar in structure to the plasma membrane. There are two types of ER– rough endoplasmic reticulum (RER) and smooth endoplasmic reticulum (SER). RER looks rough under a microscope because it has particles called ribosomes attached to its surface. The ribosomes, which are present in all active cells, are the sites of protein manufacture. The manufactured proteins are then sent to various places in the cell depending on need, using the ER. The SER helps in the manufacture of fat molecules, or lipids, important for cell function. Some of these proteins and lipids help in building the cell membrane. This process is known as membrane biogenesis. Some other proteins and lipids function as enzymes and hormones. Although the ER varies greatly in appearance in different cells, it always forms a network system. Thus, one function of the ER is to serve as channels for the transport of materials (especially proteins) between various regions of the cytoplasm or between the cytoplasm and the nucleus. The ER also functions as a cytoplasmic framework providing a surface."
    }
  ]
}