{
  "topic": [
    {
      "sub-topic": "Definition of Tissue",
      "Content": "1. Define the term “tissue”."
    },
    {
      "sub-topic": "Types of Elements in Xylem Tissue",
      "Content": "2. How many types of elements together make up the xylem tissue? Name them."
    },
    {
      "sub-topic": "Simple vs Complex Tissues",
      "Content": "3. How are simple tissues different from complex tissues in plants?"
    },
    {
      "sub-topic": "Types of Plant Tissues: Parenchyma, Collenchyma, Sclerenchyma",
      "Content": "4. Differentiate between parenchyma, collenchyma and sclerenchyma on the basis of their cell wall."
    },
    {
      "sub-topic": "Regions of Parenchyma Tissue",
      "Content": "12. Name the regions in which parenchyma tissue is present."
    },
    {
      "sub-topic": "Role of Epidermis",
      "Content": "13. What is the role of epidermis in plants?"
    },
    {
      "sub-topic": "Cork as Protective Tissue",
      "Content": "14. How does the cork act as a protective tissue?"
    },
    {
      "sub-topic": "Naming Various Tissues",
      "Content": "10. Name the following. (a)Tissue that forms the inner lining of our mouth. (b)Tissue that connects muscle to bone in humans. (c) Tissue that transports food in plants. (d)Tissue that stores fat in our body. (e)Connective tissue with a fluid matrix. (f)Tissue present in the brain."
    },
    {
      "sub-topic": "Identification of Tissues",
      "Content": "11. Identify the type of tissue in the following: skin, bark of tree, bone, lining of kidney tubule, vascular bundle."
    },
    {
      "sub-topic": "Functions of Stomata",
      "Content": "5. What are the functions of the stomata?"
    },
    {
      "sub-topic": "Muscle Fibres Comparison",
      "Content": "6. Diagrammatically show the difference between the three types of muscle fibres."
    },
    {
      "sub-topic": "Function of Cardiac Muscle",
      "Content": "7. What is the specific function of the cardiac muscle?"
    },
    {
      "sub-topic": "Muscle Types Comparison",
      "Content": "8. Differentiate between striated, unstriated and cardiac muscles on the basis of their structure and site/location in the body."
    },
    {
      "sub-topic": "Structure of Neuron",
      "Content": "9. Draw a labelled diagram of a neuron."
    },
    {
      "sub-topic": "Neurons Function",
      "Content": "is made of neurons that receive and conduct impulses."
    }
  ]
}