{
  "topic": [
    {
      "sub-topic": "Food Production and Demand",
      "Content": "We know that all living organisms need food. Food supplies proteins, carbohydrates, fats, vitamins and minerals, all of which we require for body development, growth and health. Both plants and animals are major sources of food for us. We obtain most of this food from agriculture and animal husbandry. We read in newspapers that efforts are always being made to improve production from agriculture and animal husbandry. Why is this necessary? Why we cannot make do with the current levels of production? India is a very populous country. Our population is more than one billion people, and it is still growing. As food for this growing population, we will soon need more than a quarter of a billion tonnes of grain every year. This can be done by farming on more land. But India is already intensively cultivated. Therefore, it is necessary to increase our production efficiency for both crops and livestock."
    },
    {
      "sub-topic": "Sustainability in Agriculture",
      "Content": "Efforts to meet the food demand by increasing food production have led to some successes so far. We have had the green revolution, which contributed to increased food-grain production. We have also had the white revolution, which has led to better and more efficient use as well as availability of milk. However, these revolutions mean that our natural resources are getting used more intensively. As a result, there are more chances of causing damage to our natural resources to the point of destroying their balance completely. Therefore, it is important that we should increase food production without degrading our environment and disturbing the balances maintaining it. Hence, there is a need for sustainable practices in agriculture and animal husbandry."
    },
    {
      "sub-topic": "Food Security",
      "Content": "Also, simply increasing grain production for storage in warehouses cannot solve the problem of malnutrition and hunger. People should have money to purchase food. Food security depends on both availability of food and access to it."
    },
    {
      "sub-topic": "Economic Factors in Agriculture",
      "Content": "In India, as in many other agriculture-based countries, farming ranges from small to very large farms. Different farmers thus have more or less land, money and access to information and technologies. In short, it is the money or financial conditions that allow farmers to take up different farming practices and agricultural technologies. There is a correlation between higher inputs and yields. Thus, the farmer’s purchasing capacity for inputs decides cropping system and production practices. Therefore, production practices can be at different levels. They include ‘no cost’ production, ‘low cost’ production and ‘high cost’ production practices."
    },
    {
      "sub-topic": "Types of Food Crops",
      "Content": "Cereals such as wheat, rice, maize, millets and sorghum provide us carbohydrate for energy requirement. Pulses like gram (chana), pea (matar), black gram (urad), green gram (moong), pigeon pea (arhar), lentil (masoor), provide us with protein. And oil seeds including soyabean, ground nut, sesame, castor, mustard, linseed and sunflower provide us with necessary fats. Vegetables, spices and fruits provide a range of vitamins and minerals in addition to small amounts of proteins, carbohydrates and fats. In addition to these food crops, fodder crops like berseem, oats or sudan grass are raised as food for the livestock."
    },
    {
      "sub-topic": "Improvement in Crop Yields",
      "Content": "The first is the choice of seeds for planting. The second is the nurturing of the crop plants. The third is the protection of the growing and harvested crops from loss. Thus, the major groups of activities for improving crop yields can be classified as: Crop variety improvement, Crop production improvement, Crop protection management."
    },
    {
      "sub-topic": "Crop Variety Improvement",
      "Content": "This approach depends on finding a crop variety that can give a good yield. Varieties or strains of crops can be selected by breeding for various useful characteristics such as disease resistance, response to fertilisers, product quality and high yields. One way of incorporating desirable characters into crop varieties is by hybridization. Hybridization refers to crossing between genetically dissimilar plants. This crossing may be intervarietal (between different varieties), interspecific (between two different species of the same genus) or intergeneric (between different genera)."
    },
    {
      "sub-topic": "Historical Improvement in Food Production",
      "Content": "In India, there has been a four times increase in the production of food grains from 1952 to 2010 with only 25% increase in the cultivable land area. How has this increase in production been achieved?"
    },
    {
      "sub-topic": "Environmental Factors in Crop Production",
      "Content": "Different crops require different climatic conditions, temperature and photoperiods for their growth and completion of their life cycle. Photoperiods are related to the duration of sunlight. Growth of plants and flowering are dependent on sunlight. As we all know, plants manufacture their food in sunlight by the process of photosynthesis."
    },
    {
      "sub-topic": "Nutrient Requirements for Plants",
      "Content": "Just as we need food for development, growth and well-being, plants also require nutrients for growth. Nutrients are supplied to plants by air, water and soil. There are several nutrients which are essential for plants. Air supplies carbon and oxygen, hydrogen comes from water, and soil supplies the other thirteen nutrients to plants. Amongst these, some are required in large quantities and are therefore called macro-nutrients. The other nutrients are used by plants in small quantities and are therefore called micro-nutrients."
    },
    {
      "sub-topic": "Soil Fertility Management",
      "Content": "Manure contains large quantities of organic matter and also supplies small quantities of nutrients to the soil. Manure is prepared by the decomposition of animal excreta and plant waste. Manure helps in enriching soil with nutrients and organic matter and increasing soil fertility. The bulk of organic matter in manure helps in improving the soil structure. This involves increasing the water holding capacity in sandy soils."
    },
    {
      "sub-topic": "Organic Farming Practices",
      "Content": "The process in which farm waste material like livestock excreta (cow dung, etc.), vegetable waste, animal refuse, domestic waste, sewage waste, straw, eradicated weeds etc. is decomposed in pits is known as composting. The compost is rich in organic matter and nutrients. Compost is also prepared by using earthworms to hasten the process of decomposition of plant and animal refuse. This is called vermi-compost."
    },
    {
      "sub-topic": "Chemical Fertilizers and Their Management",
      "Content": "Fertilizers are commercially produced plant nutrients. Fertilizers supply nitrogen, phosphorus and potassium. They are used to ensure good vegetative growth (leaves, branches and flowers), giving rise to healthy plants. Fertilizers should be applied carefully in terms of proper dose, time, and observing pre- and post-application precautions for their complete utilisation. Excess fertilizer can lead to water pollution and harm the soil conditions in the long run."
    }
  ]
}