{
  "topic": [
    {
      "sub-topic": "Introduction to Tissues",
      "Content": "From the last chapter, we recall that all living organisms are made of cells. In unicellular organisms, a single cell performs all basic functions. For example, in Amoeba, a single cell carries out movement, intake of food, gaseous exchange, and excretion. But in multi-cellular organisms there are millions of cells. Most of these cells are specialised to carry out specific functions. Each specialised function is taken up by a different group of cells. Since these cells carry out only a particular function, they do it very efficiently. In human beings, muscle cells contract and relax to cause movement, nerve cells carry messages, blood flows to transport oxygen, food, hormones and waste material and so on. In plants, vascular tissues conduct food and water from one part of the plant to other parts. So, multi-cellular organisms show division of labour. Cells specialising in one function are often grouped together in the body. This means that a particular function is carried out by a cluster of cells at a definite place in the body. This cluster of cells, called a tissue, is arranged and designed so as to give the highest possible efficiency of function. Blood, phloem, and muscle are all examples of tissues."
    },
    {
      "sub-topic": "Comparison of Plant and Animal Tissues",
      "Content": "A group of cells that are similar in structure and/or work together to achieve a particular function forms a tissue. Are Plants and Animals Made of Same Types of Tissues? Let us compare their structure and functions. Do plants and animals have the same structure? Do they both perform similar functions? There are noticeable differences between the two. Plants are stationary or fixed – they don’t move. Since they have to be upright, they have a large quantity of supportive tissue. The supportive tissue generally has dead cells. Animals on the other hand move around in search of food, mates, and shelter. They consume more energy as compared to plants. Most of the tissues they contain are living. Another difference between animals and plants is in the pattern of growth. The growth in plants is limited to certain regions, while this is not so in animals. There are some tissues in plants that divide throughout their life. These tissues are localised in certain regions. Based on the dividing capacity of the tissues, various plant tissues can be classified as growing or meristematic tissue and permanent tissue. Cell growth in animals is more uniform. So, there is no such demarcation of dividing and non-dividing regions in animals. The structural organisation of organs and organ systems is far more specialised and localised in complex animals than even in very complex plants. This fundamental difference reflects the different modes of life pursued by these two major groups of organisms, particularly in their different feeding methods. Also, they are differently adapted for a sedentary existence on one hand (plants) and active locomotion on the other (animals), contributing to this difference in organ system design."
    },
    {
      "sub-topic": "Meristematic Tissue",
      "Content": "The growth of plants occurs only in certain specific regions. This is because the dividing tissue, also known as meristematic tissue, is located only at these points. Depending on the region where they are present, meristematic tissues are classified as apical, lateral, and intercalary. New cells produced by meristem are initially like those of meristem itself, but as they grow and mature, their characteristics slowly change and they become differentiated as components of other tissues. Apical meristem is present at the growing tips of stems and roots and increases the length of the stem and the root. The girth of the stem or root increases due to lateral meristem (cambium). Intercalary meristem, seen in some plants, is located near the node. Cells of meristematic tissue are very active; they have dense cytoplasm, thin cellulose walls, and prominent nuclei. They lack vacuoles."
    },
    {
      "sub-topic": "Permanent Tissue",
      "Content": "What happens to the cells formed by meristematic tissue? They take up a specific role and lose the ability to divide. As a result, they form a permanent tissue. This process of taking up a permanent shape, size, and a function is called differentiation. Differentiation leads to the development of various types of permanent tissues. A few layers of cells beneath the epidermis are generally simple permanent tissue. Parenchyma is the most common simple permanent tissue. It consists of relatively unspecialised cells with thin cell walls. They are living cells. They are usually loosely arranged, thus large spaces between cells (intercellular spaces) are found in this tissue. This tissue generally stores food. In some situations, it contains chlorophyll and performs photosynthesis, and then it is called chlorenchyma. In aquatic plants, large air cavities are present in parenchyma to help them float. Such a parenchyma type is called aerenchyma. The flexibility in plants is due to another permanent tissue, collenchyma. It allows bending of various parts of a plant like tendrils and stems of climbers without breaking. It also provides mechanical support. We find this tissue in leaf stalks below the epidermis. The cells of this tissue are living, elongated, and irregularly thickened at the corners. There is very little intercellular space. Yet another type of permanent tissue is sclerenchyma. It is the tissue which makes the plant hard and stiff. The cells of this tissue are dead. They are long and narrow as the walls are thickened due to lignin. Often these walls are so thick that there is no internal space inside the cell. This tissue provides strength to the plant parts."
    },
    {
      "sub-topic": "Epidermal Tissue",
      "Content": "The epidermis is usually made of a single layer of cells. In some plants living in very dry habitats, the epidermis may be thicker since protection against water loss is critical. The entire surface of a plant has an outer covering epidermis. It protects all the parts of the plant. Epidermal cells on the aerial parts of the plant often secrete a waxy, water-resistant layer on their outer surface. This aids in protection against loss of water, mechanical injury, and invasion by parasitic fungi. Since it has a protective role to play, cells of epidermal tissue form a continuous layer without intercellular spaces. Most epidermal cells are relatively flat. The epidermis also has small pores called stomata, which are necessary for exchanging gases with the atmosphere. Stomata are enclosed by two kidney-shaped cells called guard cells. Transpiration (loss of water in the form of water vapor) also takes place through stomata. Epidermal cells of the roots, whose function is water absorption, commonly bear long hair-like parts that greatly increase the total absorptive surface area. In some plants like desert plants, epidermis has a thick waxy coating of cutin (a chemical substance with water-proof quality) on its outer surface."
    },
    {
      "sub-topic": "Vascular Tissue",
      "Content": "Xylem consists of tracheids, vessels, xylem parenchyma, and xylem fibers. Tracheids and vessels have thick walls, and many are dead cells when mature. Tracheids and vessels are tubular structures. This allows them to transport water and minerals vertically. The parenchyma stores food. Xylem fibers are mainly supportive in function. Phloem is made up of five types of cells: sieve cells, sieve tubes, companion cells, phloem fibers, and the phloem parenchyma. Sieve tubes are tubular and play an essential role in the transport of nutrients throughout the plant."
    }
  ]
}