{
  "topic": [
    {
      "sub-topic": "Ozone Layer Depletion",
      "Content": "all the manufacturing companies to make CFC-free refrigerators throughout the world."
    },
    {
      "sub-topic": "Ozone Layer Depletion",
      "Content": "Find out from the library, internet or newspaper reports, which chemicals are responsible for the depletion of the ozone layer."
    },
    {
      "sub-topic": "Ozone Layer Depletion",
      "Content": "Find out if the regulations put in place to control the emission of these chemicals have succeeded in reducing the damage to the ozone layer. Has the size of the hole in the ozone layer changed in recent years?"
    },
    {
      "sub-topic": "Ozone Layer Depletion",
      "Content": "The use of chemicals like CFCs has endangered the ozone layer. Since the ozone layer protects against ultraviolet radiation from the Sun, this could damage the environment."
    },
    {
      "sub-topic": "Ozone Layer Depletion",
      "Content": "What is ozone and how does it affect any ecosystem?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Find out how the sewage in your locality is treated. Are there mechanisms in place to ensure that local water bodies are not polluted by untreated sewage?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Find out how the local industries in your locality treat their wastes. Are there mechanisms in place to ensure that the soil and water are not polluted by this waste?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Collect waste material from your homes. This could include all the waste generated during a day, like kitchen waste (spoilt food, vegetable peels, used tea leaves, milk packets and empty cartons), waste paper, empty medicine bottles/strips/bubble packs, old and torn clothes and broken footwear."
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Bury this material in a pit in the school garden or if there is no space available, you can collect the material in an old bucket/ flower pot and cover with at least 15 cm of soil."
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Keep this material moist and observe at 15-day intervals."
    },
    {
      "sub-topic": "Waste Management",
      "Content": "What are the materials that remain unchanged over long periods of time?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "What are the materials which change their form and structure over time?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Of these materials that are changed, which ones change the fastest?"
    },
    {
      "sub-topic": "Biodegradable and Non-Biodegradable Materials",
      "Content": "Have you ever wondered why the same enzyme does not break-down everything we eat? Enzymes are specific in their action, specific enzymes are needed for the break-down of a particular substance. That is why we will not get any energy if we try to eat coal."
    },
    {
      "sub-topic": "Biodegradable and Non-Biodegradable Materials",
      "Content": "Because of this, many human-made materials like plastics will not be broken down by the action of bacteria or other saprophytes. These materials will be acted upon by physical processes like heat and pressure, but under the ambient conditions found in our environment, these persist for a long time."
    },
    {
      "sub-topic": "Biodegradable and Non-Biodegradable Materials",
      "Content": "Substances that are broken down by biological processes are said to be biodegradable. How many of the substances you buried were biodegradable?"
    },
    {
      "sub-topic": "Biodegradable and Non-Biodegradable Materials",
      "Content": "Substances that are not broken down in this manner are said to be non-biodegradable. These substances may be inert and simply persist in the environment for a long time or may harm the various members of the eco-system."
    },
    {
      "sub-topic": "Biodegradable and Non-Biodegradable Materials",
      "Content": "Find out from the library or internet to find out more about biodegradable and non-biodegradable substances."
    },
    {
      "sub-topic": "Biodegradable and Non-Biodegradable Materials",
      "Content": "How long are various non-biodegradable substances expected to last in our environment?"
    },
    {
      "sub-topic": "Biodegradable and Non-Biodegradable Materials",
      "Content": "These days, new types of plastics which are said to be biodegradable are available. Find out more about such materials and whether they do or do not harm the environment."
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Find out what happens to the waste generated at home. Is there a system in place to collect this waste?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Find out how the local body (panchayat, municipal corporation, resident welfare association) deals with the waste. Are there mechanisms in place to treat the biodegradable and non-biodegradable wastes separately?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Calculate how much waste is generated at home in a day. How much of this waste is biodegradable?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Calculate how much waste is generated in the classroom in a day. How much of this waste is biodegradable?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Suggest ways of dealing with this waste. Improvements in our lifestyle have resulted in greater amounts of waste material generation. Changes in attitude also have a role to play, with more and more things we use becoming disposable."
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Changes in packaging have resulted in much of our waste becoming non-biodegradable. What do you think will be the impact of these on our environment?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Search the internet or library to find out what hazardous materials have to be dealt with while disposing of electronic items. How would these materials affect the environment?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "Find out how plastics are recycled. Does the recycling process have any impact on the environment?"
    },
    {
      "sub-topic": "Ecosystem",
      "Content": "There is a loss of energy as we go from one trophic level to the next, this limits the number of trophic levels in a food-chain. Human activities have an impact on the environment."
    },
    {
      "sub-topic": "Ecosystem",
      "Content": "The various components of an ecosystem are interdependent. The producers make the energy from sunlight available to the rest of the ecosystem."
    },
    {
      "sub-topic": "Waste Management",
      "Content": "The waste we generate may be biodegradable or non-biodegradable. The disposal of the waste we generate is causing serious environmental problems."
    },
    {
      "sub-topic": "Ecosystem",
      "Content": "What will happen if we kill all the organisms in one trophic level? Will the impact of removing all the organisms in a trophic level be different for different trophic levels? Can the organisms of any trophic level be removed without causing any damage to the ecosystem?"
    },
    {
      "sub-topic": "Ecosystem",
      "Content": "What is biological magnification? Will the levels of this magnification be different at different levels of the ecosystem?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "What are the problems caused by the non-biodegradable wastes that we generate?"
    },
    {
      "sub-topic": "Waste Management",
      "Content": "If all the waste we generate is biodegradable, will this have no impact on the environment?"
    },
    {
      "sub-topic": "Ozone Layer Depletion",
      "Content": "Why is damage to the ozone layer a cause for concern? What steps are being taken to limit this damage?"
    }
  ]
}