{
  "topic": [
    {
      "sub-topic": "Control of Involuntary Actions",
      "Content": "Involuntary actions are controlled by the mid-brain and hind-brain. All these involuntary actions including blood pressure, salivation and vomiting are controlled by the medulla in the hind-brain."
    },
    {
      "sub-topic": "Role of the Cerebellum in Voluntary Actions",
      "Content": "Think about activities like walking in a straight line, riding a bicycle, picking up a pencil. These are possible due to a part of the hind-brain called the cerebellum. It is responsible for precision of voluntary actions and maintaining the posture and balance of the body."
    },
    {
      "sub-topic": "Protection of Nervous Tissue",
      "Content": "A delicate organ like the brain, which is so important for a variety of activities, needs to be carefully protected. For this, the body is designed so that the brain sits inside a bony box. Inside the box, the brain is contained in a fluid-filled balloon which provides further shock absorption. If you run your hand down the middle of your back, you will feel a hard, bumpy structure. This is the vertebral column or backbone which protects the spinal cord."
    },
    {
      "sub-topic": "Mechanism of Muscle Movement",
      "Content": "So far, we have been talking about nervous tissue, and how it collects information, sends it around the body, processes information, makes decisions based on information, and conveys decisions to muscles for action. In other words, when the action or movement is to be performed, muscle tissue will do the final job. When a nerve impulse reaches the muscle, the muscle fibre must move. The simplest notion of movement at the cellular level is that muscle cells will move by changing their shape so that they shorten. Muscle cells have special proteins that change both their shape and their arrangement in the cell in response to nervous electrical impulses."
    },
    {
      "sub-topic": "Responses of Plants to Stimuli",
      "Content": "Animals have a nervous system for controlling and coordinating the activities of the body. But plants have neither a nervous system nor muscles. So, how do they respond to stimuli? When we touch the leaves of a chhui-mui (the ‘sensitive’ or ‘touch-me-not’ plant of the Mimosa family), they begin to fold up and droop. When a seed germinates, the root goes down, the stem comes up into the air. Firstly, the leaves of the sensitive plant move very quickly in response to touch. There is no growth involved in this movement."
    },
    {
      "sub-topic": "Types of Plant Movements",
      "Content": "The directional movement of a seedling is caused by growth. If it is prevented from growing, it will not show any movement. So plants show two different types of movement – one dependent on growth and the other independent of growth. Let us think about the first kind of movement, such as that of the sensitive plant. Since no growth is involved, the plant must actually move its leaves in response to touch. But there is no nervous tissue, nor any muscle tissue. The plants also use electrical-chemical means to convey this information from cell to cell, but unlike in animals, there is no specialised tissue in plants for the conduction of information."
    },
    {
      "sub-topic": "Growth-Dependent Movements",
      "Content": "When plants respond to stimuli slowly by growing in a particular direction, this is an example of movement due to growth. Environmental triggers such as light, or gravity will change the directions that plant parts grow in. These directional, or tropic movements can be either towards the stimulus, or away from it. In two different kinds of phototropic movement, shoots respond by bending towards light while roots respond by bending away from it."
    },
    {
      "sub-topic": "Plant Hormones and Growth",
      "Content": "Another example of chemotropism is the growth of pollen tubes towards ovules. It is vital for plants to communicate information rapidly to achieve quick responses to stimuli, which they achieve using electrical impulses or chemical communication. For example, a hormone called auxin, synthesized at the shoot tip, helps the cells to grow longer. When light is coming from one side of the plant, auxin diffuses towards the shady side of the shoot, stimulating the cells to grow longer on that side and causing the plant to bend towards light."
    },
    {
      "sub-topic": "Hormonal Coordination in Animals",
      "Content": "Chemical, or hormonal, means of information transmission are also used in animals. Many different tissue types will be used and their activities integrated together in these actions. For instance, when squirrels experience a scary situation, their bodies may have to prepare for either fighting or running away, which requires a lot of energy and coordination across different tissues. This hormonal response allows for efficient activation of bodily processes necessary for these actions."
    }
  ]
}