{
  "topic": [
    {
      "sub-topic": "Chemical Coordination",
      "Content": "Chemical coordination is seen in both plants and animals. Hormones produced in one part of an organism move to another part to achieve the desired effect. For the coming activity would be limited. On the other hand, if a chemical signal were to be sent as well, it would reach all cells of the body and provide the wide-ranging changes needed. This is done in many animals, including human beings, using a hormone called adrenaline that is secreted from the adrenal glands. Look at Fig. 6.7 to locate these glands. Adrenaline is secreted directly into the blood and carried to different parts of the body. The target organs or the specific tissues on which it acts include the heart. As a result, the heart beats faster, resulting in supply of more oxygen to our muscles. The blood to the digestive system and skin is reduced due to contraction of muscles around small arteries in these organs. This diverts the blood to our skeletal muscles. The breathing rate also increases because of the contractions of the diaphragm and the rib muscles. All these responses together enable the animal body to be ready to deal with the situation."
    },
    {
      "sub-topic": "Endocrine System",
      "Content": "Such animal hormones are part of the endocrine system which constitutes a second way of control and coordination in our body."
    },
    {
      "sub-topic": "Iodine and Thyroxin",
      "Content": "Let us examine some examples to understand how hormones help in coordinated growth. We have all seen salt packets which say ‘iodised salt’ or ‘enriched with iodine’. Why is it important for us to have iodised salt in our diet? Iodine is necessary for the thyroid gland to make thyroxin hormone. Thyroxin regulates carbohydrate, protein and fat metabolism in the body so as to provide the best balance for growth. Iodine is essential for the synthesis of thyroxin. In case iodine is deficient in our diet, there is a possibility that we might suffer from goitre. One of the symptoms in this disease is a swollen neck. Can you correlate this with the position of the thyroid gland in Fig. 6.7?"
    },
    {
      "sub-topic": "Growth Hormones",
      "Content": "Sometimes we come across people who are either very short (dwarfs) or extremely tall (giants). Have you ever wondered how this happens? Growth hormone is one of the hormones secreted by the pituitary. As its name indicates, growth hormone regulates growth and development of the body. If there is a deficiency of this hormone in childhood, it leads to dwarfism. You must have noticed many dramatic changes in your appearance as well as that of your friends as you approached 10–12 years of age. These changes associated with puberty are because of the secretion of testosterone in males and oestrogen in females."
    },
    {
      "sub-topic": "Insulin and Blood Sugar Regulation",
      "Content": "Do you know anyone in your family or friends who has been advised by the doctor to take less sugar in their diet because they are suffering from diabetes? As a treatment, they might be taking injections of insulin. This is a hormone which is produced by the pancreas and helps in regulating blood sugar levels. If it is not secreted in proper amounts, the sugar level in the blood rises causing many harmful effects."
    },
    {
      "sub-topic": "Feedback Mechanisms",
      "Content": "If it is so important that hormones should be secreted in precise quantities, we need a mechanism through which this is done. The timing and amount of hormone released are regulated by feedback mechanisms. For example, if the sugar levels in blood rise, they are detected by the cells of the pancreas which respond by producing more insulin. As the blood sugar level falls, insulin secretion is reduced."
    },
    {
      "sub-topic": "Endocrine Glands",
      "Content": "Activity 6.3Activity 6.3Activity 6.3Activity 6.3Activity 6.3 /square6Look at Fig. 6.7. /square6Identify the endocrine glands mentioned in the figure. /square6Some of these glands have been listed in Table 6.1 and discussed in the text. Consult books in the library and discuss with your teachers to find out about other glands. Remember that plants have hormones that control their directional growth. What functions do animal hormones perform?"
    },
    {
      "sub-topic": "Important Hormones and Their Functions",
      "Content": "Table 6.1 : Some important hormones and their functions S.No. Hormone Endocrine Gland Functions 1. Growth hormone Pituitary gland Stimulates growth in all organs 2. Thyroid gland Regulates metabolism for body growth 3. Insulin Regulates blood sugar level 4. Testosterone Testes 5. Ovaries Development of female sex organs, regulates menstrual cycle, etc. 6. Adrenaline Adrenal gland 7. Releasing hormones Stimulates pituitary gland to release hormones"
    }
  ]
}