{
  "topic": [
    {
      "sub-topic": "ANIMALS – NERVOUS SYSTEM",
      "Content": "In animals, such control and coordination are provided by nervous and muscular tissues, which we have studied in Class IX. Touching a hot object is an urgent and dangerous situation for us. We need to detect it, and respond to it. How do we detect that we are touching a hot object? All information from our environment is detected by the specialised tips of some nerve cells. These receptors are usually located in our sense organs, such as the inner ear, the nose, the tongue, and so on. So gustatory receptors will detect taste while olfactory receptors will detect smell. This information, acquired at the end of the dendritic tip of a nerve cell sets off a chemical reaction that creates an electrical impulse. This impulse travels from the dendrite to the cell body, and then along the axon to its end. At the end of the axon, the electrical impulse sets off the release of some chemicals. These chemicals cross the gap, or synapse, and start a similar electrical impulse in a dendrite of the next neuron. This is a general scheme of how nervous impulses travel in the body. A similar synapse finally allows delivery of such impulses from neurons to other cells, such as muscles cells or gland. It is thus no surprise that nervous tissue is made up of an organised network of nerve cells or neurons, and is specialised for conducting information via electrical impulses from one part of the body to another."
    },
    {
      "sub-topic": "ANIMALS – NERVOUS SYSTEM",
      "Content": "Put some sugar in your mouth. How does it taste? Block your nose by pressing it between your thumb and index finger. Now eat sugar again. Is there any difference in its taste? While eating lunch, block your nose in the same way and notice if you can fully appreciate the taste of the food you are eating. Is there a difference in how sugar and food taste if your nose is blocked? If so, why might this be happening? Read and talk about possible explanations for these kinds of differences. Do you come across a similar situation when you have a cold?"
    },
    {
      "sub-topic": "What happens in Reflex Actions?",
      "Content": "‘Reflex’ is a word we use very commonly when we talk about some sudden action in response to something in the environment. We say ‘I jumped out of the way of the bus reflexly’, or ‘I pulled my hand back from the flame reflexly’, or ‘I was so hungry my mouth started watering reflexly’. What exactly do we mean? A common idea in all such examples is that we do something without thinking about it, or without feeling in control of our reactions. Yet these are situations where we are responding with some action to changes in our environment. How is control and coordination achieved in such situations? Let us consider this further. Take one of our examples. Touching a flame is an urgent and dangerous situation for us, or in fact, for any animal! How would we respond to this? One seemingly simple way is to think consciously about the pain and the possibility of getting burnt, and therefore move our hand. An important question then is, how long will it take us to think all this?"
    },
    {
      "sub-topic": "What happens in Reflex Actions?",
      "Content": "Rather than having to think about the sensation of heat, if the nerves that detect heat were to be connected to the nerves that move muscles in a simpler way, the process of detecting the signal or the input and responding to it by an output action might be completed quickly. Such a connection is commonly called a reflex arc. Where should such reflex arc connections be made between the input nerve and the output nerve? The best place, of course, would be at the point where they first meet each other. Nerves from all over the body meet in a bundle in the spinal cord on their way to the brain. Reflex arcs are formed in this spinal cord itself, although the information input also goes on to reach the brain. Of course, reflex arcs have evolved in animals because the thinking process of the brain is not fast enough. In fact many animals have very little or none of the complex neuron network needed for thinking. So it is quite likely that reflex arcs have evolved as efficient ways of functioning in the absence of true thought processes. However, even after complex neuron networks have come into existence, reflex arcs continue to be more efficient for quick responses."
    },
    {
      "sub-topic": "Human Brain",
      "Content": "The spinal cord is made up of nerves which supply information to think about. Thinking involves more complex mechanisms and neural connections. These are concentrated in the brain, which is the main coordinating centre of the body. The brain and spinal cord constitute the central nervous system. They receive information from all parts of the body and integrate it. We also think about our actions. Writing, talking, moving a chair, clapping at the end of a programme are examples of voluntary actions which are based on deciding what to do next. So, the brain also has to send messages to muscles. This is the second way in which the nervous system communicates with the muscles. The communication between the central nervous system and the other parts of the body is facilitated by the peripheral nervous system consisting of cranial nerves arising from the brain and spinal nerves arising from the spinal cord. The brain thus allows us to think and take actions based on that thinking."
    },
    {
      "sub-topic": "Human Brain",
      "Content": "The brain has three such major parts or regions, namely the fore-brain, mid-brain, and hind-brain. The fore-brain is the main thinking part of the brain. It has regions which receive sensory impulses from various receptors. Separate areas of the fore-brain are specialised for hearing, smell, sight and so on. There are separate areas of association where this sensory information is interpreted by putting it together with information from other receptors as well as with information that is already stored in the brain. Based on all this, a decision is made about how to respond and the information is passed on to the motor areas which control the movement of voluntary muscles, for example, our leg muscles."
    }
  ]
}