{
  "topic": [
    {
      "sub-topic": "Tissue Culture",
      "Content": "In tissue culture, new plants are grown by removing tissue or separating cells from the growing tip of a plant. The cells are then placed in an artificial medium where they divide rapidly to form a small group of cells or callus. The callus is transferred to another medium containing hormones for growth and differentiation. The plantlets are then placed in the soil so that they can grow into mature plants. Using tissue culture, many plants can be grown from one parent in disease-free conditions. This technique is commonly used for ornamental plants."
    },
    {
      "sub-topic": "Spore Formation",
      "Content": "Even in many simple multi-cellular organisms, specific reproductive parts can be identified. The thread-like structures that developed on the bread in Activity 7.2 above are the hyphae of the bread mould (Rhizopus). They are not reproductive parts. On the other hand, the tiny blob-on-a-stick structures are involved in reproduction. The blobs are sporangia, which contain cells, or spores, that can eventually develop into new Rhizopus individuals. The spores are covered by thick walls that protect them until they come into contact with another moist surface and can begin to grow."
    },
    {
      "sub-topic": "Asexual Reproduction",
      "Content": "All the modes of reproduction that we have discussed so far allow new generations to be created from a single individual. This is known as asexual reproduction."
    },
    {
      "sub-topic": "Sexual Reproduction Overview",
      "Content": "We are also familiar with modes of reproduction that depend on the involvement of two individuals before a new generation can be created. Bulls alone cannot produce new calves, nor can hens alone produce new chicks. In such cases, both sexes, males and females, are needed to produce new generations. What is the significance of this sexual mode of reproduction? Are there any limitations of the asexual mode of reproduction, which we have been discussing above?"
    },
    {
      "sub-topic": "Significance of Sexual Reproduction",
      "Content": "The creation of two new cells from one involves copying of the DNA as well as of the cellular apparatus. The DNA copying mechanism, as we have noted, cannot be absolutely accurate, and the resultant errors are a source of variations in populations of organisms. Every individual organism cannot be protected by variations, but in a population, variations are useful for ensuring the survival of the species."
    },
    {
      "sub-topic": "Germ Cells and Meiosis",
      "Content": "Thus, when these germ-cells from two individuals combine during sexual reproduction to form a new individual, it results in re-establishment of the number of chromosomes and the DNA content in the new generation. If the zygote is to grow and develop into an organism which has highly specialised tissues and organs, then it has to have sufficient stores of energy for doing this."
    },
    {
      "sub-topic": "Sexual Reproduction in Flowering Plants",
      "Content": "The reproductive parts of angiosperms are located in the flower. You have already studied the different parts of a flower – sepals, petals, stamens, and pistil. Stamens and pistil are the reproductive parts of a flower which contain the germ-cells."
    },
    {
      "sub-topic": "Fertilization Process in Plants",
      "Content": "The swollen bottom part is the ovary, middle elongated part is the style, and the terminal part which may be sticky is the stigma. The ovary contains ovules and each ovule has an egg cell. The male germ-cell produced by pollen grain fuses with the female gamete present in the ovule. This fusion of the germ-cells or fertilisation gives us the zygote which is capable of growing into a new plant."
    },
    {
      "sub-topic": "Pollination Methods",
      "Content": "Thus the pollen needs to be transferred from the stamen to the stigma. If this transfer of pollen occurs in the same flower, it is referred to as self-pollination. On the other hand, if the pollen is transferred from one flower to another, it is known as cross-pollination. This transfer of pollen from one flower to another is achieved by agents like wind, water, or animals."
    },
    {
      "sub-topic": "Seed Formation and Germination",
      "Content": "The seed contains the future plant or embryo which develops into a seedling under appropriate conditions. This process is known as germination."
    },
    {
      "sub-topic": "Reproduction in Humans Overview",
      "Content": "Let us now look at the species that we are most interested in, namely, humans. Humans use a sexual mode of reproduction. How does this process work? Let us begin at an apparently unrelated point. All of us know that our bodies change as we become older."
    },
    {
      "sub-topic": "Physical Changes During Adolescence",
      "Content": "Some of these changes are common to both boys and girls. We begin to notice thick hair growing in new parts of the body such as armpits and the genital area between the thighs, which can also become darker in colour. Thinner hair can also appear on legs and arms, as well as on the face."
    },
    {
      "sub-topic": "Gender-Specific Changes During Adolescence",
      "Content": "In girls, breast size begins to increase, with darkening of the skin of the nipples at the tips of the breasts. Also, girls begin to menstruate at around this time. Boys begin to have new thick hair growth on the face and their voices begin to crack. Further, the penis occasionally begins to become enlarged and erect, either in daydreams or at night."
    }
  ]
}