{
  "samples": [
    {
      "context": "For aerobic respiration; organisms need a continuous supply of oxygen, and carbon dioxide produced during the process needs to be removed from the body. Different organisms use different methods for intake of oxygen and expulsion of carbon dioxide.",
      "question": "Why do organisms need a continuous supply of oxygen?"
    },
    {
      "context": "The human respiratory system is composed of a pair of lungs. These are attached to a system of tubes which open on the outside through the nostrils.",
      "question": "What are the main components of the human respiratory system?"
    },
    {
      "context": "Further, air is warmed up when it enters the nasal passage. Pharynx: It is a tube like structure which continues after the nasal passage.",
      "question": "What happens to air as it enters the nasal passage?"
    },
    {
      "context": "Alveolus is composed of a very thin membrane and is the place where blood capillaries open. This is alveolus; where oxygen mixes with the blood and carbon dioxide exits from the blood.",
      "question": "What happens in the alveoli during gas exchange?"
    },
    {
      "context": "Gills are the respiratory organs for fishes. Fishes take in oxygen; which is dissolved in water; through gills.",
      "question": "What are the respiratory organs for fishes?"
    },
    {
      "context": "Insects have a system of spiracles and tracheae which is used for taking in oxygen. Terrestrial organisms have developed lungs for exchange of gases.",
      "question": "How do insects and terrestrial organisms intake oxygen?"
    },
    {
      "context": "The exchange of gases; in alveoli; takes place due to pressure differential. These are air-sacs at the end of bronchioles.",
      "question": "How does gas exchange occur in the alveoli?"
    },
    {
      "context": "The inner lining of the nostrils is lined by hairs and remains wet due to mucus secretion. The mucus and the hairs help in filtering the dust particles out from inhaled air.",
      "question": "What role do hairs and mucus play in the nostrils?"
    },
    {
      "context": "Availability of oxygen is less in the aquatic environment so the breathing rate of aquatic organisms is faster. Insects have a system of spiracles and tracheae which is used for taking in oxygen.",
      "question": "Why do aquatic organisms have a faster breathing rate?"
    },
    {
      "context": "Trachea: This is composed of rings of cartilage. Cartilaginous rings prevent the collapse of trachea in the absence of air.",
      "question": "What is the function of the cartilaginous rings in the trachea?"
    }
  ]
}