{
  "samples": [
    {
      "context": "Isolating human activities to specific and limited areas would definitely help in reducing pollution to some extent. For example, if commercial areas, factories and industries are shifted to the isolated area far away from residential areas, it can reduce the effect of air pollution on people.",
      "question": "How can isolating industries impact air pollution?"
    },
    {
      "context": "Forests influence the quality of air, soil and water resources in following ways: These maintain temperature of the environment. Forests increase the rate of photosynthesis in surrounding region.",
      "question": "What role do forests play in photosynthesis?"
    },
    {
      "context": "If hot water generated by the industries is collected at common place, allowed to cool and then discharged in water bodies, will not affect the breeding capacity of aquatic organisms.",
      "question": "How can hot water discharge affect aquatic life?"
    },
    {
      "context": "Trees spread their roots deep inside the Earth and bind the soil particles firmly. This reduces soil erosion. Forests help to maintain nutrient cycles in the atmosphere.",
      "question": "What is the effect of trees on soil erosion?"
    },
    {
      "context": "Forests help to maintain oxygen and carbon dioxide balance in the air. They reduce the level of CO2 in the air and to prevent greenhouse effect.",
      "question": "How do forests influence air quality?"
    },
    {
      "context": "If sewage and garbage generated by homes and industries is treated properly before discharging into water sources, it will reduce water pollution and cause less harm to the aquatic life.",
      "question": "What is the importance of treating sewage before discharge?"
    },
    {
      "context": "Forests conserve water and make them available on the surface of Earth as water sources. Trees help to maintain the water cycle.",
      "question": "How do forests contribute to the water cycle?"
    },
    {
      "context": "Forests help to maintain temperature of the environment. They reduce the level of CO2 in the air and to prevent greenhouse effect.",
      "question": "In what way do forests help regulate temperature?"
    }
  ]
}