{
  "topic": [
    {
      "sub-topic": "ATP in Energy Production",
      "Content": "**Cellular Respiration**\nThe energy released during cellular respiration is immediately used to synthesise a molecule called ATP which is used to fuel all other activities in the cell. In these processes, ATP is broken down giving rise to a fixed amount of energy which can drive the endothermic reactions taking place in the cell. ATP is the energy currency for most cellular processes. The energy released during the process of respiration is used to make an ATP molecule from ADP and inorganic phosphate. When the terminal phosphate linkage in ATP is broken using water, the energy equivalent to 30.5 kJ/mol is released. This build-up of lactic acid in our muscles during sudden activity causes cramps."
    },
    {
      "sub-topic": "Gas Exchange in Organisms",
      "Content": "Aerobic organisms need to ensure that there is sufficient intake of oxygen. We have seen that plants exchange gases through stomata, and the large inter-cellular spaces ensure that all cells are in contact with air. Carbon dioxide and oxygen are exchanged by diffusion here. The direction of diffusion depends upon the environmental conditions and the requirements of the plant. At night, when there is no photosynthesis occurring, CO2 elimination is the major exchange activity going on. During the day, CO2 generated during respiration is used up for photosynthesis, hence there is no CO2 release. Instead, oxygen release is the major event at this time. Animals have evolved different organs for the uptake of oxygen from the environment and for getting rid of the carbon dioxide produced."
    },
    {
      "sub-topic": "Respiratory Structures and Functions",
      "Content": "Fish take in water through their mouths and force it past the gills where the dissolved oxygen is taken up by blood. Terrestrial organisms use the oxygen in the atmosphere for respiration. This oxygen is absorbed by different organs in different animals. All these organs have a structure that increases the surface area which is in contact with the oxygen-rich atmosphere. In human beings, air is taken into the body through the nostrils. The air passing through the nostrils is filtered by fine hairs that line the passage. Within the lungs, the passage divides into smaller and smaller tubes which finally terminate in balloon-like structures called alveoli. The alveoli provide a surface where the exchange of gases can take place. The walls of the alveoli contain an extensive network of blood vessels."
    },
    {
      "sub-topic": "Circulatory System in Humans",
      "Content": "The blood transports food, oxygen, and waste materials in our bodies. Blood consists of a fluid medium called plasma in which the cells are suspended. Plasma transports food, carbon dioxide, and nitrogenous wastes in dissolved form. Oxygen is carried by the red blood corpuscles. We thus need a pumping organ to push blood around the body, a network of tubes to reach all the tissues. The heart is a muscular organ which is as big as our fist. Because both oxygen and carbon dioxide have to be transported by the blood, the heart has different chambers to prevent the oxygen-rich blood from mixing with the blood containing carbon dioxide. The carbon dioxide-rich blood has to reach the lungs for the carbon dioxide to be removed, and the oxygenated blood from the lungs has to be brought back to the heart."
    },
    {
      "sub-topic": "Heart Function and Circulation Patterns",
      "Content": "Oxygen-rich blood from the lungs comes to the thin-walled upper chamber of the heart on the left, the left atrium. It then contracts, while the next chamber, the left ventricle, relaxes so that the blood is transferred to it. When the muscular left ventricle contracts, the blood is pumped out to the body. De-oxygenated blood comes from the body to the upper chamber on the right, the right atrium. As the right atrium contracts, the corresponding lower chamber, the right ventricle, dilates. This transfers blood to the right ventricle, which in turn pumps it to the lungs for oxygenation. Thus, blood goes only once through the heart in the fish during one cycle of passage through the body, while it goes through the heart twice during each cycle in other vertebrates. This is known as double circulation."
    },
    {
      "sub-topic": "Health Risks of Tobacco Use",
      "Content": "Using tobacco directly or any product of tobacco in the form of cigar, cigarettes, bidis, hookah, gutkha, etc., is harmful. Use of tobacco affects the tongue, lungs, heart, and liver. Smokeless tobacco is also a major risk factor for heart attacks, strokes, pulmonary diseases, and several forms of cancers. There is a high incidence of oral cancer in India due to the chewing of tobacco in the form of gutkha."
    }
  ]
}