{
  "topic": [
    {
      "sub-topic": "Excretion in Human Beings",
      "Content": "In human beings, excretory products in the form of soluble nitrogen compounds are removed by the nephrons in the kidneys. Normally, in a healthy adult, the initial filtrate in the kidneys is about 180 L daily. However, the volume actually excreted is only a litre or two a day, because the remaining filtrate is re-absorbed in the kidney tubules. The kidneys in human beings are part of the system for excretion."
    },
    {
      "sub-topic": "Excretion in Plants",
      "Content": "Plants use completely different strategies for excretion than those of animals. Oxygen itself can be thought of as a waste product generated during photosynthesis! For other wastes, plants use the fact that many of their tissues consist of dead cells, and that they can even lose some parts such as leaves. Many plant waste products are stored in cellular vacuoles. Waste products may be stored in leaves that fall off. Other waste products are stored as resins and gums, especially in old xylem. Plants also excrete some waste substances into the soil around them."
    },
    {
      "sub-topic": "Nutrition",
      "Content": "Autotrophic nutrition involves the intake of simple inorganic materials from the environment and using an external energy source like the Sun to synthesise complex high-energy organic material. Heterotrophic nutrition involves the intake of complex material prepared by other organisms."
    },
    {
      "sub-topic": "Respiration",
      "Content": "During the process of respiration, organic compounds such as glucose are broken down to provide energy in the form of ATP. ATP is used to provide energy for other reactions in the cell. Respiration may be aerobic or anaerobic. Aerobic respiration makes more energy available to the organism."
    },
    {
      "sub-topic": "Transport of Materials",
      "Content": "In human beings, the transport of materials such as oxygen, carbon dioxide, food and excretory products is a function of the circulatory system. The circulatory system consists of the heart, blood and blood vessels. In highly differentiated plants, transport of water, minerals, food and other materials is a function of the vascular tissue which consists of xylem and phloem."
    },
    {
      "sub-topic": "Organ Donation and Transplantation",
      "Content": "Organ donation is a generous act of donating an organ to a person who suffers from non-function of organ(s). Donation of an organ may be done by the consent of the donor and his/her family. Anyone regardless of age or gender can become an organ and tissue donor. Organ transplants can save or transform the life of a person. Transplantation is required because recipient’s organ has been damaged or has failed by disease or injury. In organ transplantation, the organ is surgically removed from one person (organ donor) and transplanted to another person (the recipient)."
    },
    {
      "sub-topic": "Nephron Structure and Functioning",
      "Content": "The kidney's nephron functions similarly to a specialized filter into the patient. It is essential for cleaning the blood by removing waste while also regulating the body's hydration levels through re-absorption. This vital process ensures that only necessary water and nutrients are retained while waste is expelled effectively."
    }
  ]
}