{
  "samples": [
    {
      "context": "Let us take a closer look at these rules. The most obvious outcome of the reproductive process still remains the generation of individuals of similar design. The rules of heredity determine the process by which traits and characteristics are reliably inherited.",
      "question": "What do heredity rules determine?"
    },
    {
      "context": "However, it does not look exactly like its parents, and human populations show a great deal of variation. We know that a child bears all the basic features of a human being.",
      "question": "What features do children inherit from parents?"
    },
    {
      "context": "Mendel used a number of contrasting visible characters of garden peas – round/wrinkled seeds, tall/short plants, white/violet flowers and so on.",
      "question": "What characters did Mendel study in peas?"
    },
    {
      "context": "The rules for inheritance of such traits in human beings are related to the fact that both the father and the mother contribute practically equal amounts of genetic material to the child.",
      "question": "What do parents contribute to a child's traits?"
    },
    {
      "context": "All plants were tall. This meant that only one of the parental traits was seen, not some mixture of the two.",
      "question": "What trait was seen in the F1 plants?"
    },
    {
      "context": "The progeny of the parental plants are, of course, all tall. However, the second-generation, or F2, progeny of the F1 tall plants are not all tall.",
      "question": "What was observed in the F2 progeny?"
    },
    {
      "context": "If this gene for that enzyme has an alteration that makes the enzyme less efficient, the amount of hormone will be less, and the plant will be short.",
      "question": "How do genes affect plant height?"
    },
    {
      "context": "Based on this evidence, suggest a possible rule for the inheritance of earlobe types. Correlate the earlobe type of each student with that of their parents.",
      "question": "What can you infer about earlobe inheritance?"
    },
    {
      "context": "Consider now an enzyme that is important for this process. If this enzyme works efficiently, a lot of hormone will be made, and the plant will be tall.",
      "question": "What role do enzymes play in plant growth?"
    },
    {
      "context": "Mendel proposed that two copies of factor (now called genes) controlling traits are present in sexually reproducing organisms.",
      "question": "How many copies of traits are present in organisms?"
    }
  ]
}