{
  "topic": [
    {
      "sub-topic": "Viral Diseases",
      "Content": "Viral diseases are extremely widespread infections caused by viruses, a type of microorganism. There are many types of viruses that cause a wide variety of viral diseases. The most common type of viral disease is the common cold, which is caused by a viral infection of the upper respiratory tract (nose and throat). Other common viral diseases include:\n- Chickenpox\n- Flu (influenza)\n- Herpes\n- Human immunodeficiency virus (HIV/AIDS)\n- Human papillomavirus (HPV)\n- Infectious mononucleosis\n- Mumps, measles and rubella\n- Shingles\n- Viral gastroenteritis (stomach flu)\n- Viral hepatitis\n- Viral meningitis\n- Viral pneumonia"
    },
    {
      "sub-topic": "Transmission of Viral Diseases",
      "Content": "Viral diseases are contagious and spread from person to person when a virus enters the body and begins to multiply. Common ways that viruses spread from person to person include:\n- Breathing in air-borne droplets contaminated with a virus\n- Eating food or drinking water contaminated with a virus\n- Having sexual contact with a person who is infected with a sexually transmitted virus\n- Indirect transmission from person to person by a virus host, such as a mosquito, tick, or field mouse\n- Touching surfaces or body fluids contaminated with a virus"
    },
    {
      "sub-topic": "Symptoms of Viral Diseases",
      "Content": "Viral diseases can affect almost any area of the body or body system. Symptoms of viral diseases can include:\n- Flu-like symptoms (fatigue, fever, sore throat, headache, cough, aches and pains)\n- Gastrointestinal disturbances, such as diarrhea, nausea and vomiting\n- Irritability\n- Malaise (general ill feeling)\n- Rash\n- Sneezing\n- Stuffy nose, nasal congestion, runny nose, or postnasal drip\n- Swollen lymph nodes\n- Swollen tonsils\n- Unexplained weight loss"
    },
    {
      "sub-topic": "Complications and Serious Symptoms",
      "Content": "In some cases, viral diseases can result in serious complications. Seek immediate medical care if you, or someone you are with, have any of the following symptoms:\n- Change in alertness or level of consciousness\n- Chest pain\n- Deep, wet chest cough that produces yellow, green or brownish phlegm\n- High fever (higher than 101 degrees Fahrenheit)\n- Lethargy or unresponsiveness\n- Seizure\n- Shortness of breath, wheezing, or difficulty breathing\n- Stiff neck\n- Yellowing of the skin and whites of the eyes (jaundice)"
    },
    {
      "sub-topic": "Causes of Viral Diseases",
      "Content": "Viral infections occur when a virus enters the body and invades the inside of the body’s cells in order to reproduce. If the body’s immune system is unable to fight off the virus, it multiplies and spreads to other cells, repeating the process and leading to a widespread infection. Types of viruses that cause a variety of viral infections include:\n- Epstein-Barr virus (causes infectious mononucleosis)\n- Human immunodeficiency virus (HIV) (causes AIDS)\n- Human papillomavirus (HPV) (causes HPV infection, cervical dysplasia, genital warts, and cervical cancer)\n- Influenza viruses (cause influenza)\n- Respiratory syncytial virus (RSV) (causes lower respiratory tract infections in young children)\n- Rhinoviruses (cause the common cold)\n- Rotavirus, enteroviruses, and noroviruses (cause viral gastroenteritis)\n- Varicella zoster virus (causes shingles and chickenpox)\n- West Nile virus (causes West Nile fever)"
    },
    {
      "sub-topic": "Risk Factors for Viral Diseases",
      "Content": "Viral diseases can occur in any age group or population. Risk factors for catching a viral disease or developing complications include:\n- Advanced age\n- Compromised immune system due to an immunodeficiency disorder, HIV/AIDS, cancer or cancer treatment, kidney disease, or other condition\n- History of chronic disease (asthma, COPD, diabetes, tuberculosis, heart disease)\n- Malnourishment\n- Not getting enough rest and having high levels of stress\n- Not washing hands frequently\n- Sharing needles to inject drugs or for tattooing\n- Unprotected sex with multiple partners\n- Young age including infancy and elementary-school-age children"
    },
    {
      "sub-topic": "Reducing Risk of Viral Diseases",
      "Content": "To lower your risk of catching or spreading a viral disease, you can:\n- Abstain from sexual activity, or only engage in sexual activities within a mutually monogamous relationship\n- Avoid contact of your hands with your eyes, nose and mouth\n- Avoid contact with a person who has a viral disease\n- Cover your mouth and nose when sneezing or coughing\n- Eat a well-balanced diet\n- Get sufficient rest\n- Use a new condom for each sex act\n- Use sterile needles for each act of tattooing or injectable drug use\n- Wash your hands frequently and properly\n- Vaccination as recommended by your healthcare provider for viral diseases"
    },
    {
      "sub-topic": "Treatment of Viral Diseases",
      "Content": "Treatment of viral infections varies depending on the specific virus and other factors. General treatments include:\n- Acetaminophen or ibuprofen for fever and pain\n- Drinking extra fluids\n- Getting extra rest and sleep\n- Maintaining good nutrition\nIn some cases, certain medications may be prescribed, such as:\n- Antiretroviral medications for HIV/AIDS\n- Antiviral drugs for the flu and shingles\nAntibiotics are not prescribed for viral diseases but may be prescribed for secondary bacterial infections."
    },
    {
      "sub-topic": "Complications of Viral Diseases",
      "Content": "In some people, viral diseases can result in complications such as:\n- Acute bronchitis\n- Cervical cancer (from HPV infection)\n- Dehydration\n- Frequent life-threatening, opportunistic infections\n- Otitis media (ear infection)\n- Pneumonia\n- Secondary bacterial infection\n- Seizures\n- Shock and coma\n- Sinusitis\n- Worsening of asthma"
    }
  ]
}