{
  "topic": [
    {
      "sub-topic": "Cardiac Muscles",
      "Content": "Cardiac muscles are involuntary muscles that control the contraction and relaxation of the heart. The cells of cardiac muscles are in the form of branched fibres, are cylindrical, and uninucleate. Striations are present in these muscles, which are capable of continuous contraction and relaxation throughout life. Three features of cardiac muscles are:\n(i) Cardiac muscles are involuntary muscles that contract rapidly, but do not get fatigued.\n(ii) The cells of cardiac muscles are cylindrical, branched, and uninucleate.\n(iii) They control the contraction and relaxation of the heart."
    },
    {
      "sub-topic": "Nervous Tissue",
      "Content": "All cells possess the ability to respond to stimuli. However, cells of the nervous tissue are highly specialised for being stimulated and then transmitting the stimulus very rapidly from one place to another within the body. The brain, spinal cord and nerves are all composed of the nervous tissue. The cells of this tissue are called nerve cells or neurons. A neuron consists of a cell body with a nucleus and cytoplasm, from which long thin hair-like parts arise. Usually, each neuron has a single long part, called the axon, and many short, branched parts called dendrites. An individual nerve cell may be up to a metre long. Many nerve fibres bound together by connective tissue make up a nerve. A neuron consists of a cell body with a nucleus and cytoplasm. It has two important extensions known as the axon and dendrites. An axon is a long thread-like extension of nerve cells that transmits impulses away from the cell body. Dendrites, on the other hand, are thread-like extensions of the cell body that receive nerve impulses. This coordinated function helps in transmitting impulses very quickly."
    },
    {
      "sub-topic": "Plant Tissue Classification",
      "Content": "Tissue is defined as a group of cells that are similar in structure and/or work together to achieve a particular function. The three main types of simple tissues in plants are:\n(i) Parenchyma\n(ii) Collenchyma\n(iii) Sclerenchyma\nComplex tissues in plants are made up of more than one type of cells, while simple tissues consist of only one type."
    },
    {
      "sub-topic": "Complex Plant Tissues",
      "Content": "The following four types of elements make up xylem tissue: (i) Xylem tracheids (tubular unicellular), (ii) Xylem vessels (multicellular), (iii) Xylem parenchyma (stores food and helps in sideways conduction of water), (iv) Xylem fibres (provide mechanical support). The constituents of phloem tissue are: (i) Sieve tubes (tubular living cells with perforated end walls) (ii) Companion cell (living cells) (iii) Phloem parenchyma (living cells) (iv) Phloem fibres (non-living and sclerenchyma cells)."
    },
    {
      "sub-topic": "Simple Plant Tissues",
      "Content": "Parenchyma characteristics include that cell walls are relatively thin, and the cells in parenchyma tissues are loosely packed. Collenchyma has irregularly thickened walls at the corners with very little space in between cells. Sclerenchyma has uniformly thickened walls with no intercellular spaces, and additional layers of the cell wall are composed mainly of lignin."
    },
    {
      "sub-topic": "Functions of Stomata",
      "Content": "Functions of the stomata include allowing the exchange of gases (CO2 and O2) with the atmosphere, and facilitating the process of transpiration through the evaporation of water from the leaf surface."
    },
    {
      "sub-topic": "Classification and Evolution",
      "Content": "The classification of living organisms is essential for easier study. Ancient classifications based on habitat were too simple. Modern classification takes into account various factors including: \n- Organization of nucleus: Prokaryotes (no membrane-bound nucleus) and Eukaryotes (membrane-bound nucleus).\n- Number of cells: Unicellular vs. Multicellular organisms.\n- Mode of Nutrition: Autotrophs (make their own food) vs. Heterotrophs (depend on others for food).\n- Level of Organization: Cellular, Tissue, Organ, and Organ System levels.\nThis current understanding acknowledges that all life forms have evolved from a common ancestor."
    },
    {
      "sub-topic": "Five Kingdom Classification",
      "Content": "The five kingdom classification proposed by Robert Whittaker includes Monera, Protista, Fungi, Plantae, and Animalia. This classification is based on cell structure, mode and source of nutrition, and body organization."
    }
  ]
}