{
  "topic": [
    {
      "sub-topic": "Types of Natural Resources",
      "Content": "Natural resources can be broadly categorized into two types, viz. exhaustible and non-exhaustible. Management of natural resources is all about their judicious use in a way that the exhaustible resources can last for many generations to come and non-exhaustible resources can be maintained in as pristine form as possible."
    },
    {
      "sub-topic": "Consequences of Exploitation of Natural Resources",
      "Content": "There are many consequences of exploitation of natural resources. Some examples are given below: Burning of fossil fuels creates air pollution. Excess amount of carbon dioxide in the atmosphere leads to global warming. Some polluting gases; like oxides of nitrogen and sulphur lead to acid rain, which is harmful for living beings. Acid rain is also harmful for monuments and buildings. Excess exploitation of groundwater leads to a drastic fall in water table. This is the reason many places are experiencing acute shortage of drinking water. Overuse of fertilisers and insecticides leads to soil pollution and soil erosion. Many pollutants are directly flown into water bodies. This has resulted in water pollution in many rivers, lakes and even in oceans."
    },
    {
      "sub-topic": "Coliform Bacteria",
      "Content": "Coliform bacteria originate as organisms in soil or vegetation and in the intestinal tract of warm-blooded animals (fecal coli). This group of bacteria has long been an indicator of water contamination and possible presence of intestinal parasites and pathogens. Coliform bacteria are relatively simple to identify, are present in much larger numbers than more dangerous pathogens, and react to the natural environment and treatment processes similarly to pathogens. By observing coliform bacteria, the increase or decrease of many pathogenic bacteria can be estimated. Sources of bacterial pollution include runoff from woodlands, pastures, and feedlots; septic tanks and sewage plants; and animals and wild fowl. Domestic animals contribute heavily to the bacterial population. Many coliform bacteria may be directly deposited into natural streams from waste in water and runoff from areas with high concentrations of animals or humans."
    },
    {
      "sub-topic": "Pollution of the Ganga",
      "Content": "The Ganga runs its course of over 2500 km from Gangotri in the Himalayas to Ganga Sagar in the Bay of Bengal. It is being turned into a drain by more than a hundred towns and cities in Uttar Pradesh, Bihar and West Bengal that pour their garbage and excreta into it. Largely untreated sewage is dumped into the Ganges every day. In addition, think of the pollution caused by other human activities like bathing, washing of clothes and immersion of ashes or unburnt corpses. And then, industries contribute chemical effluents to the Ganga’s pollution load and the toxicity kills fish in large sections of the river."
    },
    {
      "sub-topic": "Ganga Action Plan (GAP)",
      "Content": "Inertia in taking action to reduce the level of pollution stemmed largely from a widespread belief that the Ganga, as a holy river, had the ability to purify all that came into contact with it. Although there is some scientific evidence for the Ganga river’s high capacity to assimilate (i.e. biodegrade) a large level of organic waste input, including pathogens, but no river can sustain its self-purifying power with this kind of over-use, misuse and abuse of its waters. The Ganga Action Plan (GAP) originated from the personal intervention and interest of our late Prime Minister Mrs Indira Gandhi who had directed the Central Board for the Prevention and Control of Water Pollution, now Central Pollution Control Board (CPCB) to do a comprehensive survey of the situation in 1979."
    },
    {
      "sub-topic": "Sustainable Development",
      "Content": "Development is necessary for making all around economic development. But development often comes with a price in the form of environmental damage. Sustainable development means following certain practices which help in saving our environment from damage. This is necessary for maintaining the earth in a good shape so that future generations can also enjoy the bounty of nature."
    },
    {
      "sub-topic": "Three R’s (Reduce, Recycle, and Reuse)",
      "Content": "Reduce: We should reduce the consumption of various resources wherever possible. For example; we can reduce the consumption of electricity by switching off lights and other appliances when they are not required. While leaving the home, one should always check for fans and lights and switch them off. This can not only help in saving electricity but also in saving the fuels which are utilised in electricity production. We should immediately repair a leaking tap so that precious water can be saved. Recycling is another way of reducing the demand for natural resources. For example; by recycling paper, we reduce the demand for wood and thus help in saving the forest."
    },
    {
      "sub-topic": "Reuse Practices",
      "Content": "Many items can be reused many times. For example; old newspaper can be used for packing many items. Old envelopes can be used for doing rough work while doing your homework. Old plastic bottles can be used for many other purposes."
    },
    {
      "sub-topic": "Conservation of Forests and Wildlife",
      "Content": "Conservation of forests and wildlife is necessary to protect biodiversity. This is important because loss of biodiversity leads to ecological imbalance. But any conservation effort for forest and wildlife must keep the interests of all stakeholders in mind."
    },
    {
      "sub-topic": "Stakeholders in Forest Conservation",
      "Content": "The stakeholders who are directly or indirectly affected by forest are as follows: People living in or around forests; as they depend on various forest produce for their livelihood. The forest department which is the owner of the forest land. Various industrialists who depend on forest for many raw materials. For example; the beedi industry needs kendu leaves as raw material. Wood is used as raw material in many industries. The wildlife and nature enthusiasts. Before the beginning of the colonial rule in India, forest dwellers were free to utilize the resources from forests as they wished."
    },
    {
      "sub-topic": "Local People and Forest Conservation",
      "Content": "There are many examples which suggest that involvement of local communities is necessary for any conservation effort. The Bishnoi community of Rajasthan is one such example. Amrita Devi Bishnoi is still remembered with reverence for the way she fought for protecting the khejri trees in Khejrali village. She; along with 363 other people; sacrificed her life for the protection of khejri trees in 1731."
    },
    {
      "sub-topic": "Chipko Movement",
      "Content": "The Chipko Movement began in the early 1980s from a small village; Reni in Garhwal district. The women of the village began hugging a tree to prevent the cutting of trees by the contractors. The Chipko Movement later spread to other parts of India. It had been instrumental in stopping deforestation to a large extent."
    },
    {
      "sub-topic": "Arabari’s Example of People’s Participation in Forest Management",
      "Content": "In 1972, the forest department realized its mistake while reviving the degraded sal forests of Arabari forest range. Arabari forest lies in Midnapore district of West Bengal. The earlier methods of policing and surveillance were a total failure as they often led to frequent clashes with the local communities."
    }
  ]
}