{
  "topic": [
    {
      "sub-topic": "Overview of Chronic Diseases",
      "Content": "Chronic disease is a disease that persists for a long time. Chronic diseases are the major cause of death and disability worldwide. The total number of people dying from chronic diseases is double that of all infectious diseases (including HIV/AIDS, tuberculosis and malaria), maternal and parental conditions, and nutritional deficiencies combined. 80% of chronic disease deaths occur in low and middle income countries and half are in women. Without action to address the causes, deaths from chronic disease will increase by 17% between 2005 and 2015."
    },
    {
      "sub-topic": "Types of Chronic Diseases",
      "Content": "Chronic diseases include: \n- Cardiovascular diseases, mainly heart disease and chronic respiratory diseases; \n- Stroke; \n- Diabetes; \n- Cancer; \n- Genetic disorders; \n- Others, such as mental disorders, vision and hearing impairment, oral diseases, bone and joint disorders."
    },
    {
      "sub-topic": "Heart Disease",
      "Content": "There are many forms of heart disease. Coronary heart disease, also known as coronary artery disease or ischemic heart disease, is the leading cause of death globally. It is caused by disease of the blood vessels (atherosclerosis) of the heart."
    },
    {
      "sub-topic": "Stroke",
      "Content": "Stroke is a disease of the brain caused by interference to the blood supply. Stroke and heart disease are the main cardiovascular diseases."
    },
    {
      "sub-topic": "Cancer",
      "Content": "Cancer describes a range of diseases in which abnormal cells proliferate and spread out of control. Other terms used are tumors and neoplasms. There are many types of cancer, and all organs of the body can become cancerous."
    },
    {
      "sub-topic": "Chronic Respiratory Diseases",
      "Content": "Diseases of the lung take many forms. Chronic obstructive respiratory disease and asthma are the most common forms. Chronic obstructive respiratory disease is caused by irreversible obstruction of the larger airways in the lung; asthma is caused by reversible obstruction of the smaller airways in the lung."
    },
    {
      "sub-topic": "Diabetes",
      "Content": "Diabetes is characterized by raised blood glucose (sugar) levels. This results from a lack of the hormone insulin, which controls blood glucose levels, and/or an inability of the body’s tissues to respond properly to insulin. The most common type of diabetes is type 2, which accounts for about 90% of all diabetes and is largely the result of excessive weight and physical inactivity. The usual childhood form of diabetes (type 1 diabetes) is caused by an absolute lack of insulin. Without insulin, type 1 diabetes is rapidly fatal."
    },
    {
      "sub-topic": "Causes of Chronic Diseases",
      "Content": "The causes (risk factors) of chronic diseases are well established and well known; a small set of common risk factors are responsible for most of the main chronic diseases. These risk factors are modifiable and the same in men and women: \n- Unhealthy diet; \n- Physical inactivity; \n- Tobacco use."
    },
    {
      "sub-topic": "Risk Factors for Chronic Diseases",
      "Content": "These causes are expressed through the intermediate risk factors of raised blood pressure, raised glucose levels, abnormal blood lipids, overweight and obesity. The major modifiable risk factors, in conjunction with the non-modifiable risk factors of age and heredity, explain the majority of new events of heart disease, stroke, chronic respiratory diseases and some important cancers. The relationship between the major modifiable risk factors and the main chronic diseases is similar in all regions of the world."
    },
    {
      "sub-topic": "Other Risk Factors",
      "Content": "Many more risk factors for chronic diseases have been identified, but they account for a smaller proportion of disease. Harmful alcohol use is an important contributor to the global burden of disease but its relationship to chronic disease is more complex. Other risk factors for chronic disease include infectious agents that are responsible for cervical and liver cancers, and some environmental factors, such as air pollution, which contribute to a range of chronic diseases including asthma and other chronic respiratory diseases."
    },
    {
      "sub-topic": "Psychosocial Factors",
      "Content": "Childhood risk is significant. There is now extensive evidence from many countries that conditions before birth and in early childhood influence health in adult life. For example, low birth weight is now known to be associated with increased rates of high blood pressure, heart disease, stroke, and diabetes."
    },
    {
      "sub-topic": "Risk Accumulation",
      "Content": "Ageing is an important marker of the accumulation of modifiable risks for chronic disease: the impact of risk factors increases over the life course."
    },
    {
      "sub-topic": "Underlying Determinants",
      "Content": "The underlying determinants of chronic diseases are a reflection of the major forces driving social, economic, and cultural change – globalization, urbanization, population aging, and the general policy environment."
    },
    {
      "sub-topic": "Poverty",
      "Content": "Chronic diseases and poverty are interconnected in a vicious circle. At the same time, poverty and the worsening of already existing poverty are caused by chronic diseases. The poor are more vulnerable for several reasons, including greater exposure to risks and decreased access to health services."
    },
    {
      "sub-topic": "Infectious Diseases",
      "Content": "Infectious diseases (Communicable diseases): are diseases which spread from an infected person to a healthy person through air, water, food, vectors, physical contact, or sexual contact. Examples include common cold, chicken pox, mumps, measles, typhoid, cholera, tuberculosis, malaria, AIDS etc."
    },
    {
      "sub-topic": "Non-Infectious Diseases",
      "Content": "Non-infectious diseases (Non-communicable diseases): are diseases which are not spread from an infected person to a healthy person. Examples include beri beri, rickets, scurvy, night blindness, diabetes, cancer, high blood pressure etc."
    },
    {
      "sub-topic": "Causes of Diseases",
      "Content": "Diseases are caused by: \n- Pathogens like virus, bacteria, fungi, protozoans or worms. \n- Poor health and undernourishment. \n- Malfunctioning of body parts. \n- Environmental pollution. \n- Genetic disorders."
    },
    {
      "sub-topic": "Infectious Agents",
      "Content": "Infectious diseases are caused by microorganisms such as viruses, bacteria, fungi or parasites and can spread between individuals. Microorganisms that cause disease are collectively called pathogens."
    },
    {
      "sub-topic": "Means of Spread",
      "Content": "Infectious diseases spread from an infected person to a healthy person through air, water, food, vectors, physical contact, and sexual contact."
    },
    {
      "sub-topic": "Principles of Treatment",
      "Content": "Principles of treatment for infectious diseases consist of two steps: (1) To reduce the effects of the disease, this can be done by taking medicines to bring down the effects of the disease like fever, pain or loose motions etc., and by taking bed rest to conserve our energy; and (2) To kill the microbes, this can be done by taking suitable antibiotics and drugs which kills the microbes, and the disease is cured."
    },
    {
      "sub-topic": "Principles of Prevention",
      "Content": "The prevention of infectious diseases can be done in general and specific ways. General ways include public hygiene, proper nutrition, and safe drinking water. Specific ways involve immunization by taking vaccines that provide protection against infectious diseases."
    },
    {
      "sub-topic": "Immunization",
      "Content": "Immunization gives a good level of protection against many serious diseases. It uses your body's natural defense mechanism, the immune response, to build resistance to specific infection. The reasons for immunizing children include preventing illness with serious infectious diseases and protecting the population by reducing the spread of diseases."
    }
  ]
}