{
  "topic": [
    {
      "sub-topic": "Pollution Classification",
      "Content": "Pollutants can be classified as either primary or secondary. Usually, primary pollutants are substances directly emitted from a process, such as ash from a volcanic eruption, the carbon monoxide gas from a motor vehicle exhaust or sulfur dioxide released from factories. Secondary pollutants are not emitted directly. Rather, they form in the air when primary pollutants react or interact. An important example of a secondary pollutant is ground level ozone - one of the many secondary pollutants that make up photochemical smog."
    },
    {
      "sub-topic": "Water: A Wonder Liquid",
      "Content": "Water occupies a very large area of the Earth’s surface and is also found underground. Some amount of water exists in the form of water vapour in the atmosphere. Most of the water on Earth’s surface is found in seas and oceans and is saline. Fresh water is found frozen in the ice-caps at the two poles and on snow covered mountains. The underground water and the water in rivers, lakes and ponds is also fresh. However, the availability of fresh water varies from place to place. Practically every summer, most places have to face a shortage of water. And in rural areas, where water supply systems have not been installed, people are forced to spend considerable amounts of time in fetching water from faraway sources. Importance of Water: All cellular processes take place in a water medium. All the reactions that take place within our body and within the cells occur between substances that are dissolved in water. Substances are also transported from one part of the body to the other in a dissolved form. Hence, organisms need to maintain the level of water within their bodies in order to stay alive. Terrestrial life-forms require fresh water for this because their bodies cannot tolerate or get rid of the high amounts of dissolved salts in saline water. Thus, water sources need to be easily accessible for animals and plants to survive on land."
    },
    {
      "sub-topic": "Water Pollution",
      "Content": "Water pollution is the contamination of water bodies such as lakes, rivers, ocean and groundwater caused by human activities, which can be harmful to organisms and plants that live in these water bodies. Some of the causes of water pollution are shown in below figure: We use the term water-pollution to cover the following effects: 1. The addition of undesirable substances to water-bodies. These substances could be the fertilizers and pesticides used in farming or they could be poisonous substances, like mercury salts which are used by paper-industries. These could also be disease-causing organisms, like the bacteria which cause cholera. 2. The removal of desirable substances from water-bodies. Dissolved oxygen is used by the animals and plants that live in water. Any change that reduces the amount of this dissolved oxygen would adversely affect these aquatic organisms. Other nutrients could also be depleted from the water bodies. 3. A change in temperature. Aquatic organisms are used to a certain range of temperature in the water-body where they live, and a sudden marked change in this temperature would be dangerous for them or affect their breeding. The eggs and larvae of various animals are particularly susceptible to temperature changes."
    },
    {
      "sub-topic": "Soil Formation",
      "Content": "Soil is an important resource that decides the diversity of life in an area. The outermost layer of our Earth is called the crust and the minerals found in this layer supply a variety of nutrients to life-forms. The factors or processes that make soil: • The Sun: The Sun heats up rocks during the day so that they expand. At night, these rocks cool down and contract. Since all parts of the rock do not expand and contract at the same rate, this results in the formation of cracks and ultimately the huge rocks break up into smaller pieces. • Water: Water helps in the formation of soil in two ways. One, water could get into the cracks in the rocks formed due to uneven heating by the Sun. If this water later freezes, it would cause the cracks to widen. Two, flowing water wears away even hard rock over long periods of time. Fast flowing water often carries big and small particles of rock downstream. These rocks rub against other rocks and the resultant abrasion causes the rocks to wear down into smaller and smaller particles. The water then takes these particles along with it and deposits it further down its path. Soil is thus found in places far away from its parent rock. • Wind: In a process similar to the way in which water rubs against rocks and wears them down, strong winds also erode rocks down. The wind also carries sand from one place to the other like water does."
    },
    {
      "sub-topic": "Biogeochemical Cycles",
      "Content": "A constant interaction between the biotic and abiotic components of the biosphere makes it a dynamic, but stable system. These interactions consist of a transfer of matter and energy between the different components of the biosphere."
    },
    {
      "sub-topic": "The Water Cycle",
      "Content": "The water cycle, also known as the hydrologic cycle, describes the continuous movement of water on, above, and below the surface of the earth. Water can change states among liquid, vapor and ice at various places in the water cycle. Although the balance of water on Earth remains fairly constant over time, individual water molecules can come and go. The sun, which drives the water cycle, heats water in the oceans. Water evaporates as vapor into the air. Ice and snow can sublimate directly into water vapor. Rising air currents take the vapor up into the atmosphere where cooler temperatures cause it to condense into clouds. Air currents move clouds around the globe, cloud particles collide, grow, and fall out of the sky as precipitation. Some precipitation falls as snow and can accumulate as ice caps and glaciers, which can store frozen water for thousands of years. Snow packs can thaw and melt, and the melted water flows overland as snowmelt. Most precipitation falls back into the oceans or onto land, where the precipitation flows over the ground as surface runoff. A portion of runoff enters rivers in valleys in the landscape, with stream flow moving water towards the oceans. Runoff and groundwater are stored as freshwater in lakes. Not all runoff flows into rivers. Much of it soaks into the ground as infiltration. Some water infiltrates deep into the ground and replenishes aquifers, which store huge amounts of freshwater for long periods of time. Some infiltration stays close to the land surface and can seep back into surface-water bodies (and the ocean) as groundwater discharge. Some groundwater finds openings in the land surface and emerges as freshwater springs. Over time, the water reenters the ocean, where our water cycle started."
    },
    {
      "sub-topic": "The Nitrogen Cycle",
      "Content": "The nitrogen cycle is the biogeochemical cycle that describes the transformations of nitrogen and nitrogen-containing compounds in nature. It is a cycle which includes gaseous components. Earth’s atmosphere is about 78% nitrogen, making it the largest pool of nitrogen. Nitrogen is essential for many biological processes; it is crucial for any life here on Earth. It is in all amino acids, is incorporated into proteins, and is present in the bases that make up nucleic acids, such as DNA and RNA. In plants, much of the nitrogen is used in chlorophyll molecules which are essential for photosynthesis and further growth. Processing, or fixation, is necessary to convert gaseous nitrogen into forms usable by living organisms. Some fixation occurs in lightning strikes, but most fixation is done by free-living or symbiotic bacteria. These bacteria have the nitrogenase enzyme that combines gaseous nitrogen with hydrogen to produce ammonia, which is then further converted by the bacteria to make its own organic compounds. Some nitrogen fixing bacteria, such as Rhizobium, live in the root nodules of legumes (such as peas or beans). Here they form a mutualistic relationship with the plant, producing ammonia in exchange for carbohydrates. Nutrient-poor soils can be planted with legumes to enrich them with nitrogen. A few other plants can form such symbioses. Nowadays, a very considerable portion of nitrogen is fixated in ammonia chemical plants."
    },
    {
      "sub-topic": "The Carbon Cycle",
      "Content": "The carbon cycle is the biogeochemical cycle by which carbon is exchanged among the biosphere, pedosphere, geosphere, hydrosphere, and atmosphere of the Earth. The cycle is usually thought of as four major reservoirs of carbon interconnected by pathways of exchange. These reservoirs are: (I) The atmosphere. (II) The terrestrial biosphere, which is usually defined to include freshwater systems and non-living organic material, such as soil carbon. (III) The oceans, including dissolved inorganic carbon and living and non-living marine biota, (IV) The sediments including fossil fuels."
    },
    {
      "sub-topic": "The Greenhouse Effect",
      "Content": "The greenhouse effect refers to the change in the steady state temperature of a planet or moon by the presence of an atmosphere containing gas that absorbs and emits infrared radiation. Greenhouse gases, which include water vapor, carbon dioxide and methane, warm the atmosphere by efficiently absorbing thermal infrared radiation emitted by the earth’s surface, by the atmosphere itself, and by clouds. As a result of its warmth, the atmosphere also radiates thermal infrared in all directions, including downward to the Earth’s surface. Thus, greenhouse gases trap heat within the surface-troposphere system. The greenhouse effect is one of several factors that affect the temperature of the Earth."
    },
    {
      "sub-topic": "The Oxygen Cycle",
      "Content": "The oxygen cycle is the biogeochemical cycle that describes the movement of oxygen within and between its three main reservoirs: the atmosphere (air), the biosphere (living things), and the lithosphere (earth’s crust). The main driving factor of the oxygen cycle is photosynthesis, which is responsible for the modern Earth's atmosphere and life."
    },
    {
      "sub-topic": "Energy Cycle",
      "Content": "All the above mentioned cycles can be grouped or explained as the energy cycle on this earth. In fact, the sun is the main source of energy for every activity on earth. This energy facilitates the everlasting cycle of all resources in the biosphere. This system ensures that whatever we take from earth and its atmosphere we return it in some way or another. A living organism is made of Carbon, Oxygen, Nitrogen and other elements. All living organisms need a regular dose of these elements to continue life. During a lifetime, all these things are returned to the atmosphere in some way. For example, we return oxygen in the form of carbon dioxide and return water in the form of sweat or urine. Ultimately when a living being dies, then the body gets decomposed and returns these elements back to earth."
    }
  ]
}