{
  "topic": [
    {
      "sub-topic": "Bird FOOD WEB",
      "Content": "A food web is a graphical depiction of feeding connections among species of an ecological community. Food web consists of food chains of a particular ecosystem. The food web is an illustration of various methods of feeding that links the ecosystem. The food web also defines the energy flow through species of a community as a result of their feeding relationships. All the food chains are interconnected and overlapping within an ecosystem and they make up a food web. It increases the stability of the ecosystem. It provides other sources of food and allows the endangered species to grow."
    },
    {
      "sub-topic": "TROPHIC LEVELS OF FOOD CHAINS",
      "Content": "The levels of a food chain (food pyramid) is called Trophic levels. The trophic level of an organism is the level it holds in a food pyramid. The sun is the source of all the energy in food chains. Green plants, usually the first level of any food chain, absorb some of the Sun’s light energy to make their own food by photosynthesis. Green plants (autotrophs) are therefore known as ‘Producers’ in a food chain. The second level of the food chains is called the Primary Consumer. These consume the green plants. Animals in this group are usually herbivores. Examples include insects, sheep, caterpillars, and even cows. The third in the chain are Secondary Consumers. These usually eat up the primary consumers and other animal matter. They are commonly called carnivores and examples include lions, snakes, and cats. The fourth level is called Tertiary Consumers. These are animals that eat secondary consumers. Quaternary Consumers eat tertiary consumers. At the top of the levels are Predators. They are animals that have little or no natural enemies. They are the ‘bosses’ of their ecosystems. Predators feed on preys. A prey is an animal that predators hunt to kill and feed on. Predators include owls, snakes, wild cats, crocodiles, and sharks. Humans can also be called predators. When any organism dies, detrivores (like vultures, worms, and crabs) eat them up. The rest are broken down by decomposers (mostly bacteria and fungi), and the exchange of energy continues. Decomposers start the cycle again."
    },
    {
      "sub-topic": "ENERGY FLOW IS UNIDIRECTIONAL AND REQUIRES CONTINUOUS INPUTS",
      "Content": "Ecosystem energy processes conform to the thermodynamic laws. Energy cannot be made or destroyed. Energy transformations are not perfect and energy is lost in each transformation in the form of heat. The flow of energy in the ecosystem is unidirectional. The energy enters the plants (from the sun) through photosynthesis during the making of food. This energy is then passed on from one organism to another in a food chain. Energy given out by the organisms as heat is lost to the environment; it does not return to be used by the plants again. This makes the flow of energy in ecosystem 'unidirectional'. Thus, the flow of energy in the ecosystem is said to be unidirectional because the energy lost as heat from the living organisms of a food chain cannot be reused by plants in photosynthesis. During the transfer of energy through successive trophic levels in an ecosystem, there is a loss of energy all along the path. No transfer of energy is 100 percent. The energy available at each successive trophic level is 10 percent of the previous level. Thus, there is a progressive decline (gradual reduction) in the amount of energy available as we go from producer level to the higher trophic levels of organisms."
    },
    {
      "sub-topic": "NUCLEAR MOVEMENT IN ECOSYSTEMS",
      "Content": "The nutrient movement is a cyclic movement where the nutrients revolve round with an ecosystem, hence cyclic. Nutrients pass from abiotic nutrient stores, such as the soil and the atmosphere, into biotic, plant and animal stores (the biomass). The nutrients are then recycled, within the ecosystem, following death and decomposition."
    },
    {
      "sub-topic": "OZONE LAYER DEPLETION",
      "Content": "Ozone (O3) is a molecule formed by three atoms of oxygen. While O2, which we normally refer to as oxygen, is essential for all aerobic forms of life. Ozone is a deadly poison. However, at the higher levels of the atmosphere, ozone performs an essential function. It shields the surface of the earth from ultraviolet (UV) radiation from the Sun. This radiation is highly damaging to organisms; for example, it is known to cause skin cancer in human beings. Ozone at the higher levels of the atmosphere is a product of UV radiation acting on oxygen (O2) molecules. The higher energy UV radiations split apart some molecular oxygen (O2) into free oxygen (O) atoms. These atoms then combine with the molecular oxygen to form ozone. The amount of ozone in the atmosphere began to drop sharply in the 1980s. This decrease has been linked to synthetic chemicals like chlorofluorocarbons (CFCs) which are used as refrigerants and in fire extinguishers. In 1987, the United Nations Environment Programme (UNEP) succeeded in forging an agreement to freeze CFC production at 1986 levels."
    },
    {
      "sub-topic": "HOW TO PROTECT US FROM THESE HAZARDOUS WASTES?",
      "Content": "The following methods are adopted for the disposal of harmful waste materials: 1. Landfills - There are permanent storage facilities in secured lands for military-related liquid and radioactive waste materials. High-level radioactive wastes are stored in deep underground storage. 2. Deep well injection - It involves drilling a well into dry porous material below groundwater. Hazardous waste liquids are pumped into the well. They are soaked into the porous material and made to remain isolated indefinitely. 3. Incineration - The burning of materials is called incineration. Hazardous biomedical wastes are usually disposed of by means of incineration. Human anatomical wastes, discarded medicines, toxic drugs, blood, pus, animal wastes, microbiological and biotechnological wastes etc., are called biomedical wastes."
    },
    {
      "sub-topic": "MANAGEMENT OF NON-HAZARDOUS WASTES – SOLID WASTE MANAGEMENT",
      "Content": "Reuse and recycling technique - The separating out of materials such as rubber, glass, paper, and scrap metal from refuse and reprocessing them for reuse is named as reclamation of waste or recycling. Paper (54% recovery) can be repulped and reprocessed into recycled paper, cardboard, and other products. Glass (20% recovery) can be crushed, remelted, and made into new containers or crushed used as a substitute for gravel or sand in construction materials such as concrete and asphalt. Food waste and yard wastes (leaves, grass, etc.) can be composted to produce humus soil conditioner."
    },
    {
      "sub-topic": "PROBLEMS CAUSED BY OZONE DEPLETION",
      "Content": "Ozone gas is poisonous in nature, if inhaled. The thinning of the ozone layer present in the stratosphere is called depletion of the ozone layer. Due to depletion of the ozone layer, harmful ultraviolet radiations will reach the surface of Earth which may lead to skin diseases and cancer. To reduce the depletion of the ozone layer, the use of chemicals releasing substances like CFCs has been phased out by international agreements."
    },
    {
      "sub-topic": "IMPACT OF REMOVING ORGANISMS IN TROPHIC LEVELS",
      "Content": "If we kill all the organisms in one trophic level, the lower trophic level will grow more in number and the higher trophic level will not survive and flow of energy from one trophic level to another will not take place. The impact of removing all the organism in a trophic level will be different for different trophic levels. The lower trophic level of an ecosystem has a greater number of individuals than the higher trophic levels. If the organisms of any trophic level are removed they cause damage to the ecosystem. Removal of producers will affect all the organisms and they won’t survive. The removal of higher trophic level will lead to an increase in organisms of lower trophic level and the organisms die due to a shortage of food."
    }
  ]
}