{
  "topic": [
    {
      "sub-topic": "Advantages of Classifying Organisms",
      "Content": "There are millions of species on this earth. For anybody, it is impossible to study about each of them in his lifetime. Classification makes it easy to study the organisms; on the basis of certain common characters."
    },
    {
      "sub-topic": "Choosing Characteristics for Hierarchy in Classification",
      "Content": "- We need to look at the fact if given character is present in a small number of organisms or a larger number of organisms. In the first case, the commonality of characters would represent a species. In the latter case, the commonality of characters would represent a higher taxa; like genus, family, order or phylum."
    },
    {
      "sub-topic": "Basis for Grouping Organisms into Five Kingdoms",
      "Content": "Following points explain the basis of grouping organisms into five kingdoms. Organization of nucleus: Organisms with unorganized nucleus are kept under the kingdom Monera. Those with organized nucleus are kept in other kingdoms. Number of cells: Unicellular eukaryotes are kept in the kingdom Protista, while multicellular eukaryotes are kept in other kingdoms. Mode of nutrition and presence of cell wall: Heterotrophic organisms in which cell wall is present are taken under the kingdom fungi. Autotrophic organisms in which cell wall is present are taken in the kingdom Plantae. Organisms in which cell wall is absent are taken in the kingdom Animalia."
    },
    {
      "sub-topic": "Major Divisions in Plantae",
      "Content": "The major divisions of Plantae and the basis for these divisions are as follows:\nThallophyta: Simple body design; with no differentiation into root, stem and leaves.\nBryophyta: Body is differentiated into stem and leaf-like structures. Vascular system is absent.\nPteridophyta: Body is differentiated into root, stem and leaves. Vascular system is present. Reproductive organs are inconspicuous. Seeds are not produced.\nGymnosperms: Seeds are naked.\nAngiosperms: Seeds are covered."
    },
    {
      "sub-topic": "Criteria for Deciding Divisions in Plants vs. Subgroups Among Animals",
      "Content": "In the plant kingdom, morphological characters are taken into consideration while deciding about the divisions. Morphology is the study of shapes and forms of various parts. In the animal kingdom, anatomical characters are taken into consideration while deciding about subgroups. Anatomy is the study of various organs’ design in animals."
    },
    {
      "sub-topic": "Classification of Vertebrates",
      "Content": "Vertebrates are classified into further subgroups on following bases: 1. Pisces: The body is streamlined. Muscular tail is present which assists in locomotion. Body is covered with scales. Paired gills are present; which can breathe oxygen dissolved in water. They are cold-blooded animals. The heart has only two chambers. They lay eggs. 2. Tetrapoda: Animals have four limbs for locomotion and hence the name tetrapoda. Tetrapoda is divided into four classes, viz. amphibia, reptilia, aves and mammalia."
    },
    {
      "sub-topic": "Differences Between Amphibians and Reptiles",
      "Content": "Amphibians need water to lay eggs and fertilization is external. Reptilians do not need water to lay eggs and fertilization is internal. Amphibians use both skin and lungs for breathing. Reptilians breathe through lungs only."
    },
    {
      "sub-topic": "Differences Between Aves and Mammals",
      "Content": "In aves, body is covered with feathers; while in mammals, body is covered with hairs. Mammary glands are absent in aves. Forelimbs of aves are modified into wings which is not the case in mammals. Aves are oviparous, while most of the mammals are viviparous."
    },
    {
      "sub-topic": "Health and Its Importance",
      "Content": "Good health is a very hard thing to measure, but it is one of life's most precious things. The World Health Organisation has defined health as a state of complete physical, mental and social well-being. Community health can be defined as \"All the personal health along with the environmental services for the importance of health of community\". Some of the health services are given below: (i) Establishment of health care services like primary health centers, district hospitals, community health centers, medical colleges, all Indian institutes, regional hospitals etc. (ii) Provision of safe drinking water and proper disposal of garbage. (iii) Prevention of harmful insect breeding sites. (iv) Management of different types of environmental pollution by Central and State Pollution Control Boards. (v) Preventive vaccinations against number of diseases like tuberculosis, diphtheria, whooping cough, tetanus, measles, hepatitis, etc. (vi) Provision of family planning advices and services. (vii) Provision of medical care to school going children. (viii) Prevention of food adulteration. (ix) Health education."
    },
    {
      "sub-topic": "Conditions Essential for Good Health",
      "Content": "There are several conditions which have to be fulfilled for good health. The important ones are (i) Nutrition, (ii) Proper habits, and (iii) Exercise and relaxation."
    },
    {
      "sub-topic": "Nutrition",
      "Content": "Nutrition can be defined as the procurement of substances necessary for growth, development, maintenance and activities of a living organism. We obtain food from various plant and animal sources. In order to keep healthy and energetic, we need to take food. It takes care of the daily energy need also. We consume energy even while sleeping. Energy requirement depends on individual, age and special need. Growing children, pregnant women and nursing mothers need more energy."
    },
    {
      "sub-topic": "Proper Habits",
      "Content": "Another important aspect of good health is to observe proper dietary habits that are consumption of balanced diet and at fixed time. Good personal and domestic hygiene is very essential. Take full care of the following aspects. Your food should be fresh and kept away from dust, flies, insect and microbes to avoid any infection and spoilage. Utensils should be kept clean. You should wash your face and hands with soap before eating or handling the food. Food should be cooked with good feelings and cheerful state. Smoking, chewing tobacco, drinking alcohol, taking addictive drugs are bad habits and should be avoided. They can have damaging effects on our body and mind."
    },
    {
      "sub-topic": "Exercise and Relaxation",
      "Content": "Regular exercise is necessary to keep our body fit. These exercises vary with age, physical condition and nature of work of the individual. In the case of sedentary worker, exercise is even more essential. Another aspect of health is regular sleep and relaxation. The duration of sleep also varies with age and nature of work. Infants sleep for long hours, which is necessary for them to grow. For children, an average of eight hours of sound sleep is sufficient. For adults six hours of sleep is enough. Relaxation improves the capacity to work. Relaxation may be defined as an activity or recreation, which provides a relief or diversion from work or effort. There are various ways of relaxation. Yoga and meditation relax the body and mind. Listening to music and reading magazines are also relaxing."
    },
    {
      "sub-topic": "Personal and Community Health Issues",
      "Content": "Health is a state of physical, mental and social well being. The conditions necessary for good health are: - i) Good physical and social environment. ii) Good economic conditions. iii) Social equality and harmony. Good physical and social environment includes clean surroundings, good sanitation, proper garbage disposal and clean drinking water. Good economic conditions includes job opportunities for all for earning to have nutritious food and to lead a healthy life. Social equality and harmony are necessary for a healthy and peaceful life."
    },
    {
      "sub-topic": "Difference Between Healthy and Disease-Free",
      "Content": "Healthy: It is a state of physical, mental and social well being.\nDisease-Free: It is a state of absence from diseases. Healthy refers to the individual, physical and social environment. Disease-free refers only to the individual. The individual has good health. The individual may have good health or poor health."
    },
    {
      "sub-topic": "Disease and Its Causes",
      "Content": "A person may be regarded as suffering from a disease when his body does not function properly. Minor and major disorders of the body may lead to diseases. Infectious diseases are caused by germs. One of the greatest achievements in the history of mankind is the demonstration by Pasteur, Koch and others of germs or microbes that cause diseases. Microbes are the microscopic organisms such as virus, bacteria, some fungi and protozoans that are responsible for causing diseases in human beings. Cholera, tetanus, typhoid, diphtheria and pneumonia are some common diseases caused by bacteria. Polio, common cold, influenza, measles, chicken pox and AIDS are diseases caused by virus. Amoebic dysentery and malaria are caused by protozoans."
    },
    {
      "sub-topic": "Acute and Chronic Diseases",
      "Content": "Types of diseases: - Diseases are of different types. They are: - i) Acute diseases: - are diseases which last only for a short period of time and does not have long term effect on health. Eg:- cold, cough, typhoid, cholera etc. ii) Chronic disease: - are diseases which last for a long time and have long term drastic effect on health. Eg : - diabetes, tuberculosis, elephantiasis, arthritis, cancer etc."
    },
    {
      "sub-topic": "Differences Between Acute and Chronic Diseases",
      "Content": "Acute Disease: They are short duration disease. Patient recovers completely after the cure. There is no loss of weight or feeling of tiredness afterward. There is short duration loss of work and efficiency.\nChronic Disease: They are long lasting disease. Patient does not recover completely. There is often loss of weight or feeling of tiredness. There is a prolonged loss of work."
    }
  ]
}