{
  "topic": [
    {
      "sub-topic": "Symptoms of Disease",
      "Content": "a nd signs appear. These symptoms may be headache, cough, loose -motions, wound with pus, etc. These symptoms indicate disease but do not tell what the disease is. So, it is advisable to go to the doctor to diagnose any signs of a disease on the basis of these symptoms. The doctor will get laboratory tests done, if required for the confirmation of a particular disease."
    },
    {
      "sub-topic": "Long-term Health Effects",
      "Content": "If you get jaundice, If you get lice, If you get acne. Why? Answer: Lice and acne will not cause long lasting effects on our body. But in case of jaundice, there will be severe long lasting effects. For example: (i) High temperature, headache and joint pains. (ii) Feeling of nausea and vomiting. (iii) Initiating rashes. The patient will suffer from poor health and will recover by taking complete bed rest for sometime."
    },
    {
      "sub-topic": "Diet During Illness",
      "Content": "In case of illness, the normal functions of the body get disturbed. So, a nourishing food is required which is easily digestible and contains all the nutrients. Therefore, bland and nourishing food is advised to take during sickness."
    },
    {
      "sub-topic": "Transmission of Infectious Diseases",
      "Content": "Infectious diseases spread by different means. These are: (i) Through air An infected person when sneezes or coughs releases droplets containing germs. These droplets infect another healthy person through air and microbes enter a new body. Examples of such diseases are common cold, pneumonia and tuberculosis. (ii) Through water If the water source is polluted by the excreta of infectious persons having gut diseases and this water is used by other people they will be infected by diseases. For example, cholera, amoebiasis, hepatitis spread through water. (iii) Through sexual contact Some diseases like AIDS and syphilis, etc., are transmitted by sexual contact. Other than this, AIDS virus also spreads through blood, infected syringes, infected mother to her baby during pregnancy and through breast feeding. (iv) Through vectors There are some animals which act as intermediaries or vectors for a particular diseases. The vectors carry diseases from infected person to the healthy person. For example, mosquito spread malaria causing organism in humans, while sucking their blood."
    },
    {
      "sub-topic": "Precautions in Schools",
      "Content": "To prevent the incidence of infectious diseases in school following precautions can be taken: (i) Avoid contact of students suffering from air borne diseases like common cold, cough, eye, flu, etc. (ii) By checking the availability of clean drinking water in school. (iii) Clean surroundings in school will not allow the growth and multiplication of vectors. (iv) Starting childhood immunisation programme in schools."
    },
    {
      "sub-topic": "Immunisation and Vaccination",
      "Content": "Immunisation is a process of administration (injecting) of vaccine into a healthy person in order to develop immunity against a disease. Immunity means the ability of a body to recognise, destroy and eliminate external disease causing agents. This immunisation through administering vaccine is called vaccination. Vaccine contains disease -causing organisms in a diluted or weakened form or in living or dead form. It prevents further infection by microbes from causing the disease. The diseases like small pox, rabies, diphtheria chicken pox, polio, hepatitis are controlled by vaccination. Small pox is eliminated from the world through a world wide vaccination programme."
    },
    {
      "sub-topic": "Local Immunisation Programs",
      "Content": "The following immunisation programme is available at the nearest health centre in our locality (i) Immunisation for infants —DPT, BCG, polio, measles and MMR. (ii) For children —Typhoid, TT, DT, small pox and TAB. (iii) For pregnant woman — TT and hepatitis-B."
    },
    {
      "sub-topic": "Common Diseases and Prevention Steps",
      "Content": "Diseases Symptoms Steps could be Taken by Local Authorities to Bring Down the Incidence Typhoid Headache and fever which remains high in the second week and then declines Proper hygiene in surrounding areas of living. Safe disposal of excreta and other wastes. Providing TAB and typhoid oral vaccine. Cholera Painless watery diarrhoea, effortless vomiting Good sanitary condition in community. Provision of clean, purified drinking water. Providing standard cholera vaccination in the locality. Dengue fever High fever with headache, weakness and joint pains Maintenance of hygienic conditions in community. Preventing the mosquito breeding sites. Public awareness programme against mosquito borne diseases."
    },
    {
      "sub-topic": "Identifying Illness in Babies",
      "Content": "(a) Symptoms to help in finding out that the baby is sick are: (i) continuous crying (ii) drooping of eyes (iii) redness of eyes (iv) high temperature of body. (b) Signs which help to indicate the sickness in baby (i) loose motions, stomach pain indicate diarrhoea. (ii) high fever, headache, muscular pain, feeling of shivering and cold indicate malaria. (iii) redness and persistent rubbing of eyes indicate eye flu. (iv) pale skin, yellow urine, yellowing of eyes indicate jaundice. (v) doctors suggest for laboratory tests, if there is fever with no other symptoms to find out the kind of sickness."
    },
    {
      "sub-topic": "Conditions Leading to Illness",
      "Content": "In condition (c), a person is most likely to fall sick. The reasons are: (a) Due to malaria, the body becomes weak and loss of body fluids occur. In this condition, if she takes four days fast, her recovery from malaria related weakness will not occur and she will become more weak. (b) Her immune system is already weak due to malaria and if she takes care of someone suffering from chicken pox, there is high probability that she may also suffer this diseases."
    },
    {
      "sub-topic": "Biosphere and Its Components",
      "Content": "The whole combination of animals, plants and non-living beings which by their interaction make the planet earth a live and vibrant place is called biosphere. Living things constitute the biotic component of the biosphere. The air, the water and the soil form the non-living or abiotic component of the biosphere. The air is called the hygrosphere, the water is hydrosphere and the soil is called lithosphere."
    },
    {
      "sub-topic": "Composition and Importance of Air",
      "Content": "Air is a mixture of many gases like nitrogen, oxygen, carbon dioxide and water vapour. All living beings need oxygen to break down glucose molecules and get energy for their activities. This results in the production of carbon dioxide. Another process which results in the consumption of oxygen and the concomitant production of carbon dioxide is combustion. This includes not just human activities, which burn fuels to get energy, but also forest fires."
    },
    {
      "sub-topic": "Carbon Dioxide Fixation",
      "Content": "Green plants convert carbon dioxide into glucose in the presence of Sunlight and many marine animals use carbonates dissolved in sea-water to make their shells."
    },
    {
      "sub-topic": "Role of Atmosphere in Climate Control",
      "Content": "Atmosphere covers the Earth, like a blanket. We know that air is a bad conductor of heat. The atmosphere keeps the average temperature of the Earth fairly steady during the day and even during the course of the whole year. The atmosphere prevents the sudden increase in temperature during the daylight hours. And during the night, it slows down the escape of heat into outer space. The moon, which is about the same distance from the Sun that the Earth is, with no atmosphere, the temperature ranges from –190º C to 110º C."
    },
    {
      "sub-topic": "Movement of Air: Winds",
      "Content": "These phenomena are the result of changes that take place in our atmosphere due to the heating of air and the formation of water vapour. Water vapour is formed due to the heating of water bodies and the activities of living organisms. The rise in temperature creates a low pressure zone which attracts cool air from high pressure zone and pushes up the hot air. Thus the atmosphere can be heated from below by the radiation that is reflected back or re-radiated by the land or water bodies. On being heated, convection currents are set up in the air."
    },
    {
      "sub-topic": "Air Pollution",
      "Content": "An air pollutant is known as a substance in the air that can cause harm to humans and the environment. Pollutants can be in the form of solid particles, liquid droplets, or gases. In addition, they may be natural or man-made."
    }
  ]
}