{
  "topic": [
    {
      "sub-topic": "Fundamental Unit of Life",
      "Content": "Cell is called the fundamental unit of life. A cell is capable of independent existence and can carry out all the functions which are necessary for a living being. A cell carries out nutrition, respiration, excretion, transportation and reproduction; the way an individual organism does. Unicellular organisms are capable of independent existence which shows a cell’s capability to exist independently. Due to this, a cell is called the fundamental and structural unit of life. All living beings are composed of the basic unit of life, i.e. cell."
    },
    {
      "sub-topic": "Cell Theory",
      "Content": "CELL THEORY (Schleiden, Schwann and Virchow):  • All living organisms are composed of one or more cells. • The cell is the basic unit of structure, function, and organization in all organisms. • All cells come from preexisting, living cells."
    },
    {
      "sub-topic": "Cell Size, Shape and Number",
      "Content": "There is much variation in size, shape and number of cells in different organisms, and also in various parts of the body. Most of the cells are only a few micrometres in diameter and are visible only with the help of a microscope. Cells may be spherical, spindle shaped, elongated, polyhedral or irregular in shape. The shape of the cells is determined by the specific function they perform. The number of cells is related to the size of the organ or body. Thus, small organisms have a limited number of cells, while the larger ones such as elephant, whale or banyan tree have a countless number of cells. Some organisms can also have cells of different kinds."
    },
    {
      "sub-topic": "Discovery of Cells",
      "Content": "Cells were discovered in 1665 by an English Botanist, Robert Hooke. He used a primitive microscope to observe cells in a cork slice."
    },
    {
      "sub-topic": "Function and Structure of Cells",
      "Content": "Cells constitute various components of plants and animals. A cell is the smallest unit of life and is capable of all living functions. Cells are the building blocks of life. This is the reason why cells are referred to as the basic structural and functional units of life. All cells vary in their shape, size, and activity they perform. In fact, the shape and size of the cell are related to the specific functions they perform."
    },
    {
      "sub-topic": "Structure of Cell Protoplasm",
      "Content": "A cell is made of life giving substance called protoplasm. The protoplasm is a highly organised jelly-like, viscous, semi-fluid, composed of molecules of various chemicals. Most of these are organic molecules such as proteins, carbohydrates, fats, nucleic acid etc. Protoplasm is commonly called the ‘physical basis of life’. A plant cell consists of a cell wall and protoplast. Cell wall is absent in animal cells. Protoplast denotes the whole of protoplasm present in a cell. It is differentiated into plasma membrane, nucleus and cytoplasm."
    },
    {
      "sub-topic": "Plasma Membrane",
      "Content": "Plasma membrane is a semi-permeable membrane. It is composed of a bilayer of lipid and protein. This is the outermost covering of the cell that separates the contents of the cell from its external environment. The plasma membrane allows or permits the entry and exit of some materials in and out of the cell. It also prevents movement of some other materials. The cell membrane, therefore, is called a selectively permeable membrane."
    },
    {
      "sub-topic": "Functions of Plasma Membrane",
      "Content": " Plasma membrane selectively regulates the entry and exit of the substances into and out of the cell. Therefore, it is called a selectively permeable membrane or semi-permeable membrane.   It provides an outer boundary to the cell and protects the cell from injury.   It allows the flow of materials and information between different organelles of the same cell, as well as between the adjacent cells.   It provides some organic connections between the adjacent cells."
    },
    {
      "sub-topic": "Movement of Substances across Plasma Membrane",
      "Content": "The cell membrane is selectively permeable and regulates the movement of substances in and out of the cell. Movement of CO2: CO2 is produced during cellular respiration. Therefore, it is present in high concentrations inside the cell. This CO2 must be excreted out of the cell. In the cell’s external environment, the concentration of CO2 is low as compared to that inside the cell. Therefore, according to the principle of diffusion, CO2 moves from a region of higher concentration (inside the cell) towards a region of lower concentration (outside the cell). Similarly, O2 enters the cell by the process of diffusion when the concentration of O2 inside the cell is low as compared to its surroundings. Movement of water: Water moves from a region of high concentration to a region of low concentration through the plasma membrane. The plasma membrane acts as a semi-permeable membrane, and this movement of water is known as osmosis. However, the movement of water across the plasma membrane of the cell is affected by the amount of substance dissolved in water."
    },
    {
      "sub-topic": "Selectively Permeable Membrane",
      "Content": "Answer: The cell membrane or the plasma membrane is known as a selectively permeable membrane because it regulates the movement of substances in and out of the cell. This means that the plasma membrane allows the entry of only some substances and prevents the movement of some other materials."
    },
    {
      "sub-topic": "Cell Wall",
      "Content": "Cell wall is made of cellulose. Cell wall is present only in plant cells. It is a rigid protective covering outside the plasma membrane. Presence of cell wall in plant cells distinguishes them from animal cells. Most of the plant cell walls are made of cellulose. The cell wall consists of three layers namely, middle lamella, primary wall and secondary wall. The middle lamella is a thin amorphous cement-like layer between two adjacent cells. Primary wall is the first formed wall of the cell and is produced inner to the middle lamella. The secondary wall is a thick layer found inner to the primary wall."
    },
    {
      "sub-topic": "Functions of Cell Wall",
      "Content": " Cell wall gives a definite shape to the plant cells.   It provides mechanical strength to the cell.   It protects the protoplasm against injury.   It gives rigidity to the cell."
    },
    {
      "sub-topic": "Cytoplasm",
      "Content": "A cell is enclosed in a membranous casing and is filled with a liquid substance which is called the cytoplasm. There are many cell organelles in a typical cell. Some of the main structures of a cell are as follows: The cytoplasm is the fluid content inside the plasma membrane. It also contains many specialised cell organelles. Each of these organelles performs a specific function for the cell."
    },
    {
      "sub-topic": "Functions of Cytoplasm",
      "Content": " Cytoplasm helps in intracellular distribution of enzymes, nutrients and other biomolecules within the cell.   Synthesis of different types of biomolecules such as proteins, nucleotides, fatty acids etc., takes place in the cytoplasm."
    },
    {
      "sub-topic": "Nucleus Structure",
      "Content": "Nucleus is the major central structure in the cell. It is a dense spherical structure embedded in the cytoplasm. Nucleus has a double membraned envelope called nuclear envelope. Nuclear envelope encloses a ground substance called nucleoplasm or karyolymph. The nuclear envelope possesses many pores called nuclear pores. The nucleoplasm has two types of nuclear structures i) the nucleolus and, ii) chromatin."
    },
    {
      "sub-topic": "Nucleus Functions",
      "Content": "The nucleolus is a spherical body rich in protein and RNA. It is the site of ribosome formation. There may be one or more nucleoli in the nucleoplasm. The chromatin is a network of fine threads composed of genetic material DNA (Deoxyribo nucleic acid) and proteins. During cell division, chromatin is condensed into thick cord-like structures called Chromosomes. The chromosomes contain genes and each gene is responsible for one hereditary character of the organism. Genes contain information for inheritance of features from parents to next generation in the form of DNA molecule."
    },
    {
      "sub-topic": "Functions of Nucleus",
      "Content": "i) Nucleus controls all the metabolic activities of the cell.  ii) It controls the inheritance of characters from parents to off-springs.  iii) It controls cell division."
    },
    {
      "sub-topic": "Classification of Cells",
      "Content": "Based on the complexity of organization, especially nuclear organization, the cells are classified into two types. i) Prokaryotic cells. ii) Eukaryotic cells."
    },
    {
      "sub-topic": "Prokaryotic Cells",
      "Content": "The cells of Bacteria and Cyanobacteria (blue-green algae) lack a well-organized nucleus and are called prokaryotic cells. Their DNA (Deoxyribo Nucleic Acid) is not enclosed by a nuclear membrane. They also lack membrane-bound organelles. The organisms which possess prokaryotic cells are called prokaryotic organisms or prokaryotes. They are considered to be primitive organisms."
    },
    {
      "sub-topic": "Eukaryotic Cells",
      "Content": "The cells of all plants (except bacteria and cyanobacteria) and animals possess a well-organized nucleus and are called Eukaryotic cells. Their genetic material is enclosed by a nuclear membrane. They possess membrane-bound organelles like Endoplasmic reticulum, Golgi body, mitochondria, plastids and vacuoles. The organisms which possess eukaryotic cells are called Eukaryotic organisms or eukaryotes."
    },
    {
      "sub-topic": "Differences between Prokaryotic and Eukaryotic Cells",
      "Content": "Prokaryotic Cell Eukaryotic Cell 1. Size: generally small (1-10 μm) 1 um = 10–6 m 2. Nuclear region: poorly defined because of the absence of a nuclear membrane, and is known as nucleoid 3. Chromosome: single 4. Membrane-bound cell organelles absent 1. Size: generally large (5-100 μm) 2. Nuclear region: well defined and surrounded by a nuclear membrane 3. More than one chromosome 4. Membrane-bound cell organelles such as mitochondria, plastids, etc., are present"
    },
    {
      "sub-topic": "Cell Organelles",
      "Content": "A cell performs a variety of functions such as i) Synthesis of complex molecules and their breakdown, ii) Production of energy, iii) Secretion of certain substances, etc. These activities of the cell are performed by different cell organelles. These organelles are enclosed by membranes. To understand the functioning of the cell, it is necessary to know briefly about the structure of cell organelles."
    },
    {
      "sub-topic": "Endoplasmic Reticulum",
      "Content": "Endoplasmic reticulum is a complicated and interconnected system of membrane-bound channels and tubules. It is spread throughout the cytoplasm and is continuous with the plasma membrane and nuclear membrane. There are two types of Endoplasmic Reticulum. a) Rough Endoplasmic Reticulum. (RER) b) Smooth Endoplasmic Reticulum. (SER) Rough endoplasmic reticulum (Granular endoplasmic reticulum) They are found in cells which synthesize proteins. This type of endoplasmic reticulum possesses rough walls because the ribosomes remain attached with the membrane of endoplasmic reticulum. Smooth endoplasmic reticulum (Agranular endoplasmic reticulum) They are found in cells which synthesize lipid. The walls are smooth and ribosomes are not attached to its membrane."
    },
    {
      "sub-topic": "Functions of Endoplasmic Reticulum",
      "Content": " Endoplasmic Reticulum (E.R) provides large surface area for the metabolic activities of the cell.   Rough endoplasmic reticulum plays an important role in protein synthesis.   Smooth endoplasmic reticulum is involved in the synthesis of steroid hormones and lipids."
    },
    {
      "sub-topic": "Golgi Complex",
      "Content": "The Golgi apparatus or Golgi complex is another important cell organelle involved in the packaging, sorting, and distribution of proteins and lipids within the cell. It consists of a stack of membranous sacs (cisternae) and a network of tubules. The Golgi apparatus modifies the proteins produced in the rough endoplasmic reticulum (RER) and sends them to their destined locations, either inside or outside the cell."
    }
  ]
}