{
  "topic": [
    {
      "sub-topic": "General Overview of Bacteria and Infections",
      "Content": "Infectious bacteria can grow, divide and spread in the body, leading to infectious disease. Some infectious bacteria give off toxins which can make some diseases more severe. Bacteria are spread in many ways including:  Spread by aerosols (through coughing and sneezing). For example, Streptococcus. Spread by surface and skin contact. For example, Staphylococcus aureus, including MRSA. Spread through body fluids, such as blood and saliva. For example, meningococcal disease (meningitis). Antibiotics are usually given to treat severe bacterial infections. Antibiotic resistance in bacteria is a significant problem."
    },
    {
      "sub-topic": "Typhoid",
      "Content": "Typhoid is a common bacterial disease caused by a rodlike bacterium. Salmonella typhi, which is commonly found in the intestine of man. Certain humans function as carriers without suffering from it. Mary Mallon, called Typhoid Mary was such a case. She was a cook and typhoid carrier, who continued to spread the disease for several years through her food preparation. Mode of transmission of Typhoid: Incubation period varies from 1 -3 weeks, average 2 weeks. Typhoid spreads through food and water contaminated with faeces of the patient. House flies may carry the pathogens from the faeces to the food, milk and water. Symptoms of Typhoid: This disease is characterised by the inflammation of ileum and colon, liver and spleen also become enlarged, abdominal pain, pea-soup diarrhoea which may become haemorrhagic, constant fever, extreme weakness, vomiting, rash of rose coloured spots called rose spots on the upper abdomen and sore throat. Typhoid is diagnosed by Widal Test. Prevention and treatment Typhoid: Any patient with typhoid requires the highest standards of nursing together with isolation and hygienic disposal of faeces. The two most important preventive measures are proper sewage treatment and purification of water supplies. Contamination of food can be reduced by personal hygiene and control of flies. TAB vaccine provides immunity for about 3 years. Antibiotics like ampicillin and chloramphenicol are used to treat typhoid."
    },
    {
      "sub-topic": "Cholera",
      "Content": "Cholera commonly called haiza is a water-borne disease caused by the bacterium, Vibrio cholerae. Robert Koch discovered this disease. Mode of transmission of Cholera: Incubation period varies from a few hours to 2 -3 days. It spreads through contaminated food and drinks. The causative bacterium secretes cholera toxin, enterotoxin which induces excessive secretion of an isotonic electrolyte solution by the intestinal mucosa. This solution is lost in stool. Symptoms of Cholera: Cholera is mainly characterized by sudden onset of profuse, effortless, rice-water like stools, vomiting and rapid dehydration, loss of minerals and muscular cramps. Prevention and treatment of Cholera: Proper sanitation and hygienic conditions are the best methods of prevention. Cholera vaccine is effective for six months only. Fluid and salt lost is restored by Oral Rehydration Solution (ORS). It is water with a small amount of sugar and salt. Antibiotics like tetracycline and chloramphenicol are used to treat cholera."
    },
    {
      "sub-topic": "Diarrhoeal Diseases",
      "Content": "Diarrhoeal diseases are group of diseases caused by different bacteria such as Shigella dysenteriae, Escherichia coli, Campylobacter, Salmonella and Clostridium. Mode of transmission of Diarrhoeal diseases: Incubation period is variable. Epidemics are common in overcrowded insanitary conditions. It spreads through food poisoning, contaminated food, water or drinks, clothes, utensils and bed sheets. Symptoms of Diarrhoeal diseases: This is characterized by mild diarrhoea i.e., loose stools if infected by E. coli, frequent stools with blood and mucus and abdominal cramps if infected by Shigella. Other symptoms are dehydration, diminished appetite, fever, low B.P., increase in pulse rate etc. Prevention and treatment of Diarrhoeal diseases: One should avoid contaminated food and water. ORS is given repeatedly to check dehydration and loss of minerals."
    },
    {
      "sub-topic": "Pneumonia",
      "Content": "Pneumonia is a serious disease of lungs characterised by accumulation of mucus/fluid in alveoli and bronchioles to that extent that breathing becomes difficult. It is caused by Streptococcus pneumoniae or Diplococcus pneumoniae, and Haemophilus influenzae. Mode of transmission of Pneumonia: Incubation period is of 1 -3 days. A healthy person acquires the infection by inhaling the droplets/aerosols released by an infected person or even by sharing glasses and utensils with an infected person. Symptoms: The onset of pneumonia is usually sudden with a single shaking chill, followed by fever, pain with breathing on the side of lung involved, increased pulse and respiratory rates and cough. In severe cases the lips and finger nails turn grey to bluish in colour. Prevention and treatment of Pneumonia: The patients should be isolated and healthy persons should not share their belongings. Pneumococcal conjugate vaccine (PCV13) is available. Drugs against pneumonia are erythromycin, tetracycline and sulphonamide. If untreated, pneumonia leads to death."
    },
    {
      "sub-topic": "Diphtheria",
      "Content": "Diphtheria is an acute infectious disease in children mostly characterized by the development of a grey adherent false membrane over the upper respiratory tract or throat. It is caused by toxigenic strains of Corynebacterium diphtheriae (rod shaped, Gram +ve bacterium). Mode of transmission of Diphtheria: Incubation period is of 2 - 5 days. Endotoxin produced by pathogen causes nasal diphtheria, pharyngeal diphtheria and laryngotracheal diphtheria. The germs are present in the discharges from the nose and throat of patients and also of healthy people who act as the “carriers”. The patients and the carriers spread the disease through acts like kissing, talking, coughing and sneezing. Symptoms of Diphtheria: Symptoms are fever, sore throat, sometimes vomiting, headache, epithelial necrosis by endotoxin and oozing of semisolid material in the throat which develops into a grey false but tough membrane. The membrane chokes the air passage. Sometimes, bacterium infects the heart, nerve cells and adrenal glands. In severe cases, respiratory tract is blocked causing difficulty in breathing and even death due to choking. ‘Schick test’ tests the presence of antitoxin and the state of hypersensitivity to diphtheria toxin. Prevention and treatment of Diphtheria: One should avoid close contact with the patient. DPT (diphtheria, pertussis and tetanus) vaccine is available. Erythromycin is used to treat diphtheria."
    },
    {
      "sub-topic": "Whooping Cough",
      "Content": "Whooping cough is caused by Bordetella pertussis and is a common childhood disease affecting the respiratory system. Mode of transmission: It has an incubation period of 10 – 16 days. It spreads by droplet infection or by direct contact. Symptoms of Whooping cough (Pertussis): It causes loss of appetite, fever, running nose, fatigue, sneezing and constant cough leaving the child breathless, tired and red in face. Later the voice becomes hoarse and the cough gives a whoop or a loud crowing sound while inhaling. The child usually vomits and there is frothy discharge from his mouth and nose. There may be other complications like vomiting, convulsions and pneumonia. Prevention and treatment of Whooping cough (Pertussis): Immunisation of the disease is done in infants by DPT vaccination at six weeks, three months and five months. Erythromycin antibiotic is used for the treatment."
    },
    {
      "sub-topic": "Tuberculosis",
      "Content": "Tuberculosis (TB), also called Koch’s disease is caused by rod-shaped, Gram +ve bacteria, Mycobacterium tuberculosis. The bacterium releases a toxin, tuberculin which destroys the organs it infects. It can affect almost any tissue or organ in the body like the lungs, lymph nodes, brain, bones and joints but disease of the lung is by far the most frequent. Mode of transmission of Tuberculosis: Incubation period is 3 to 6 weeks or may be years. It spreads through sneezing, coughing, contaminated food and water. Symptoms of Tuberculosis: Constant cough and in severe cases sputum with blood, pain in chest while coughing, loss of body weight, failure of appetite, slight rise of temperature in the evening are the symptoms of lung T. B. Sputum, tuberculin, X-ray and gastric analysis are carried out to diagnose tuberculosis. Tuberculin test is also called Mantoux test. Prevention and treatment of Tuberculosis: BCG (Bacillus Calmette Guerin) vaccine for TB was obtained from bovine bacillus by Calmette and Guerin in 1921. Before giving vaccination to any individual it is important to check if they are already suffering from TB or have recovered from it. The test is to puncture the skin with a special instrument which has a ring of six short needles (the Heaf test). This introduces tuberculin, purified from dead tubercle bacilli. In the absence of past or present TB the skin shows no reaction, but if an individual has the disease or has recovered, then the skin swells and reddens at the injection site. This indicates a substantial immunity and no vaccine is offered. Some of the anti-tuberculosis drugs are streptomycin, rifampicin, isoniazid, thiatazone, PAS (Para amino salicydic acid) etc. Direct observation treatment (DOT) is a programme under WHO for treatment of TB across the world."
    },
    {
      "sub-topic": "Anthrax",
      "Content": "Anthrax is an acute infectious disease caused by airborne, spore-forming, rod-like, non-motile bacterium, Bacillus anthracis. Bacillus anthracis can be easily grown in the laboratory. Anthrax spores can be produced in a dry form which can be stored as particles. These particles can be used in biological warfare. Spores are infective in dry form, not in wet form. It most commonly occurs in wild and domestic vertebrates (cattle, sheep, goats, camels, antelopes, and other herbivores), but it can also occur in humans when they are exposed to infected animals or tissues from infected animals. Mode of transmission of Anthrax (Biowar disease): Infected animals shed, a large number of bacilli (bacteria) in the discharges from the mouth, nose and rectum which sporulate in the soil. These spores are a source of infection. It requires thousands of spores to cause human infection. Anthrax does not spread from human to human. Types of Anthrax of Anthrax (Biowar disease): Anthrax infection can occur in three different forms: cutaneous (skin), gastrointestinal (by ingestion) and pulmonary (by inhalation). Cutaneous anthrax occurs when bacteria enter through skin cuts and wounds. A skin lesion begins as a papule and soon becomes a vesicle and breaks, discharging bloody serum. This vesicle, in about 36 hours, becomes a bluish-black necrotic mass (dead tissue). It consists of minute particles rich in spores. Gastrointestinal anthrax is caused by taking under-cooked meat of infected animals. Patient experiences chill, high fever, body aches, nausea, vomiting, bloody diarrhoea, loss of appetite, and frequent haemorrhages from the mucous membranes and in the skin. Pulmonary anthrax is acquired by inhaling dust containing B. anthracis. Pulmonary anthrax is often called wool-sorter’s disease. Symptoms of Anthrax (Biowar disease): Initial symptoms resemble those of common cold. Later there is difficulty in breathing, cough, fever, fast pulse and cardiovascular collapse. If left untreated, anthrax in all forms can lead to septicemia and death. Death is apparently due to oxygen depletion, secondary shock, increased vascular permeability, respiratory failure and cardiac failure. Prevention and treatment of Anthrax (Biowar disease): The only known effective prevention against anthrax is the anthrax vaccine. The vaccine was developed from an attenuated strain B. anthracis. A suitable antibiotic like ciprofloxacin is quite effective, particularly if used in the initial stages of disease. But in cattle, ciprofloxacin may be effective only in chronic area. Antibiotics should be given to unvaccinated individuals exposed to pulmonary anthrax. Penicillin, tetracycline and fluoroquinolones are effective if administered before the onset of lymphatic spread or septicemia."
    }
  ]
}