{
  "topic": [
    {
      "sub-topic": "Importance of Forest and Wildlife Conservation",
      "Content": "We should conserve forests and wildlife to preserve the biodiversity (range of different life - forms) so as to avoid the loss of ecological stability. A large number of tribes are the habitants in and around the forests. If the forests are not conserved, then it may affect these habitants. Without proper management of forest and wildlife, the quality of soil, the water sources, and even the amount of rainfall may be affected. Without forest and wildlife, life would become impossible for human beings."
    },
    {
      "sub-topic": "Approaches to Forest Conservation",
      "Content": "Various approaches are required for the conservation of forests. Afforestation is one of the most important approach. Besides this a) Deforestation should be banned. b) People should be made more aware about importance of forests. (c) The protected areas should be managed by local people which would be quite efficient. (d) National parks and sanctuaries should be formed to conserve the biodiversity. (e) Hunting should be banned and laws should be formulated against hunting. (f) There should be proper laws for exploitation of forest resources."
    },
    {
      "sub-topic": "Traditional Methods of Water Harvesting",
      "Content": "Water harvesting is an age-old concept in India. Khadins, tanks and nadis in Rajasthan, bandharas and tals in Maharashtra, bundhis in Madhya Pradesh and Uttar Pradesh, ahars and pynes in Bihar, kulhs in Himachal Pradesh, ponds in the Kandi belt of Jammu region, and eris (tanks) in Tamil Nadu, surangams in Kerala, and kattas in Karnataka are some of the ancient water harvesting, including water conveyance, structures. These are still in use at many places. The traditional water harvesting structures are location specific and have been perfected by people over a long period of time. They take into account the local geography and the need of the local people and hence are highly efficient. The traditional water harvesting structures usually focus on recharging the groundwater rather making an open reservoir. It has several advantages. Unlike surface water; the groundwater does not evaporate and thus loss because of evaporation is prevented. The groundwater does not provide a breeding ground for the mosquitoes and hence is good for public health as well. The groundwater is relatively protected from contamination by human activities."
    },
    {
      "sub-topic": "Role of Dams in Water Management",
      "Content": "A dam is a barrier that impounds water or underground streams. Reservoirs created by dams not only suppress floods but also provide water for such activities as irrigation, human consumption, industrial use, aquaculture, and navigability. Hydropower is often used in conjunction with dams to generate electricity. A dam can also be used to collect water or for storage of water which can be even distributed between locations. Dams generally serve the primary purpose of retaining water, while other structures such as floodgates or levees (also known as dikes) are used to manage or prevent water flow into specific land regions."
    },
    {
      "sub-topic": "Advantages of Dams",
      "Content": "Once a dam is constructed, electricity can be produced at a constant rate. If electricity is not needed, the sluice gates can be shut, stopping electricity generation. The water can be saved for use another time when electricity demand is high. Dams are designed to last many decades and so can contribute to the generation of electricity for many years / decades. The lake that forms behind the dam can be used for water sports and leisure / pleasure activities. Often large dams become tourist attractions in their own right. The lake's water can be used for irrigation purposes. The build up of water in the lake means that energy can be stored until needed, when the water is released to produce electricity. When in use, electricity produced by dam systems do not produce greenhouse gases. They do not pollute the atmosphere."
    },
    {
      "sub-topic": "Disadvantages of Dams",
      "Content": "Dams are extremely expensive to build and must be built to a very high standard. The high cost of dam construction means that they must operate for many decades to become profitable. The flooding of large areas of land means that the natural environment is destroyed. People living in villages and towns that are in the valley to be flooded must move out. This means that they lose their farms and businesses. In some countries, people are forcibly removed so that hydro-power schemes can go ahead. The building of large dams can cause serious geological damage. For example, the building of the Hoover Dam in the USA triggered a number of earthquakes and has depressed the earth’s surface at its location. Although modern planning and design of dams is good, in the past old dams have been known to be breached (the dam gives under the weight of water in the lake). This has led to deaths and flooding. Dams built blocking the progress of a river in one country usually means that the water supply from the same river in the following country is out of their control. This can lead to serious problems between neighbouring countries. Building a large dam alters the natural water table level. For example, the building of the Aswan Dam in Egypt has altered the level of the water table. This is slowly leading to damage of many of its ancient monuments as salts and destructive minerals are deposited in the stone work from rising damp caused by the changing water table level."
    },
    {
      "sub-topic": "Water Harvesting Techniques",
      "Content": "Water harvesting is the act of collecting and storing rainwater for future use. This can be done in areas of low or high rainfall amounts using tanks and cisterns. Collecting rainfall can reduce the amount of run-off, flooding, and erosion in prone areas. This is especially relevant in urban areas where the land has been used to build infrastructure, and the rainwater run-off has nowhere which can result in flooding. In more rural areas when the water is collected, the run-off into rivers and ponds is reduced which in turn slows the contamination from surface fertilizers and pesticides. If the collected water is to be used as drinking water, it can be treated and used in environments where drinking water is scarce."
    },
    {
      "sub-topic": "Benefits of Water Harvesting",
      "Content": "Reduces the runoff volume and the peak flow, hence mitigate floods. Recharges ground water thus is a solution to water shortage problem in winters. Reduces the cost per litre of water since a large amount of power that is consumed while pumping water from subsurface aquifers can be saved."
    },
    {
      "sub-topic": "Alternate Energy Sources",
      "Content": "Coal and petroleum are the main energy resources for us. But since these are exhaustible in nature so we need to find out alternate sources of energy. Scientists are working on developing some alternate energy sources so that dependency on coal and petroleum can be reduced. Some examples are given below: Solar energy is being used to produce electricity at many places. Although the technologies for solar energy are still costly but future prospects look bright. Fuel cell is another development which may help in replacing the internal combustion engines from automobiles. Hydrogen is being used as fuel in buses and cars in many countries. Hydrogen, when used as a fuel, produces water as a byproduct. Thus, hydrogen can be an environmentally-friendly fuel."
    },
    {
      "sub-topic": "Environment-Friendly Changes at Home",
      "Content": "In order to be environment-friendly, certain changes can be incorporated in our daily work at home. This includes (i) We should plant different kinds of shady plants, fruit and vegetable-bearing plants. (ii) There should be less use of insecticides and pesticides. (iii) Food should be properly stored to avoid spoilage, thereby preventing wastage. (iv) There should be proper drainage systems for the water to pass in the drains. (v) There should be proper disposal of water. (vi) Dustbins and other waste products should be properly covered and the garbage should not be dumped around the houses. (vii) Proper sanitary and hygiene methods must be adopted."
    },
    {
      "sub-topic": "Environment-Friendly Changes at School",
      "Content": "To make our school environment eco-friendly, it is essential to plant different kinds of shady and fruity trees. Different flowering plants should also be planted. No waste material and used paper, foil, empty packets should be spread all over the school. The water facility should be in good condition. Rooms should be properly ventilated. There should be proper provision of dustbins for the disposal of waste. There should be big and clean playgrounds."
    }
  ]
}