{
  "topic": [
    {
      "sub-topic": "Golgi Complex",
      "Content": "Apparatus was first described by Camillo Golgi. Golgi complex consist of saucer - like compartments called cisternae, network of interconnecting tubules, vesicles and vacuoles at the peripheral regions. In plant cells, Golgi apparatus is referred to as dictyosomes."
    },
    {
      "sub-topic": "Functions of Golgi Complex",
      "Content": "Functions of Golgi Complex:\n- Golgi apparatus is involved in the formation of lysosomes.\n- It is also responsible for the synthesis of cell wall and cell membrane.\n"
    },
    {
      "sub-topic": "Lysosomes",
      "Content": "LYSOSOMES:\nLysosomes are small membrane bound vesicles which contain various types of digestive enzymes. These serve as intracellular digestive system, hence they are called digestive bags. They are produced by the joint activity of Endoplasmic reticulum and Golgi apparatus. If the membrane of Lysosome happens to get ruptured, the enzymes of Lysosome would digest the entire cellular structure causing death of the cell. So Lysosomes are called ‘suicide bags’."
    },
    {
      "sub-topic": "Functions of Lysosomes",
      "Content": "Functions of Lysosomes:\n- Lysosomes are involved in the intracellular digestion of food particles ingested by the cell through endocytosis.\n- The lysosomes of WBCs (White blood cells) destroy pathogens and other foreign particles and thus take part in natural defence of the body.\n"
    },
    {
      "sub-topic": "Ribosomes",
      "Content": "RIBOSOMES:\nRibosomes are small granular structures made up of ribo nucleic acids (RNA) and proteins. They occur free in the cytoplasm as well as attached to the outer surface of the rough endoplasmic reticulum. Each ribosome consists of two subunits – a small subunit and a large subunit. At the time of protein synthesis many ribosomes get attached to messenger RNA and form a structure called polyribosome or polysome."
    },
    {
      "sub-topic": "Functions of Ribosomes",
      "Content": "Functions of Ribosomes:\nRibosomes play an important role in protein synthesis. So they are called, ‘protein factories’ of the cell."
    },
    {
      "sub-topic": "Vacuoles",
      "Content": "VACUOLES:\nVacuoles are fluid – filled sacs bound by a single membrane and are present in plant cells as well as in certain protozoans as food vacuoles and contractile vacuoles. In plant cells, major portion of the cell is occupied by vacuoles and are bound by the definite membrane called tonoplast. Vacuoles of plants are filled with cell sap containing minerals, sugars, amino acids and dissolved waste products."
    },
    {
      "sub-topic": "Functions of Vacuoles",
      "Content": "Functions of Vacuoles:\n- Vacuoles store and concentrate mineral salts as well as nutrients.\n- They maintain proper osmotic pressure in the cell for its turgidity and absorption of water.\n"
    },
    {
      "sub-topic": "Mitochondria",
      "Content": "MITOCHONDRIA:\nMitochondria are globular or cylindrical organelles. Each mitochondrion is bound by two membranes – an outer continuous membrane and an inner membrane thrown into folds called cristae. These cristae divide the inner chamber incompletely. The inner chamber is filled with homogenous dense material called the matrix. The cristae have pin headed bodies called F1 particles or Oxysomes which play an important role in respiration."
    },
    {
      "sub-topic": "Functions of Mitochondria",
      "Content": "Functions of Mitochondria:\n- Mitochondria synthesize energy rich compounds such as ATP.\n- Mitochondria provide important intermediates for the synthesis of several biochemicals like chlorophyll, cytochromes, steroids, amino acids etc.\n"
    },
    {
      "sub-topic": "Plastids",
      "Content": "PLASTIDS:\nPlastids are disc or oval shaped organelles which occur in plant cells only. Plastids are of three types: Leucoplasts, Chromoplasts and Chloroplasts."
    },
    {
      "sub-topic": "Types of Plastids",
      "Content": "i) Leucoplasts: These are colourless plastids which store food in the form of starch, lipids and proteins.\n ii) Chromoplasts: These are yellow or reddish in colour due to the presence of pigments other than chlorophyll. Chromoplasts provide colour to many flowers and fruits."
    },
    {
      "sub-topic": "Chloroplasts and their Functions",
      "Content": "iii) Chloroplasts: These are green coloured plastids which possess the photosynthetic pigment chlorophyll. Each chloroplast consists of a double membraned envelope and a matrix. The inner membrane is arranged along the length of the plastids as lamellae. At certain regions, the lamellae are thickened and appear like pile of coins. These are called the grana. Each granum consists of disc shaped membranous sacs called thylakoids. Inside these grana, the chlorophyll is located. The non-thylakoid portion of the matrix is called stroma. It contains a number of enzymes involved in photosynthesis."
    },
    {
      "sub-topic": "Functions of Plastids",
      "Content": "Functions of Plastids:\n- Leucoplasts are responsible for storing food; such as carbohydrates, protein and lipid.\n- Chromoplasts impart various colours to the plant parts.\n- A leaf of a plant is green in colour because of chloroplast. Chloroplast is the site of photosynthesis.\n"
    },
    {
      "sub-topic": "Centrosome",
      "Content": "CENTROSOME:\nCentrosome is present in animal cells and in certain lower plants. It is absent in prokaryotic cells and in higher plant cells. It is located near one pole of the nucleus. It contains a pair of small, hollow granules called centrioles."
    },
    {
      "sub-topic": "Functions of Centrioles",
      "Content": "Functions of Centrioles:\nCentrioles play an important role in the formation of spindle fibres during cell division."
    },
    {
      "sub-topic": "Summary and History of Cell Discovery",
      "Content": "SUMMARY STRUCTURE OF CELL:\nHISTORY OF DISCOVERY OF CELLS:\n- Robert Hooke was the first to discover cell (1665).\n- Leeuwenhoek was the first to discover free living cells in pond water (1674).\n- Robert Brown discovered the nucleus (1831)."
    },
    {
      "sub-topic": "Intext Questions",
      "Content": "INTEXT QUESTIONS:\nQ1. Can you name the two organelles we have studied that contain their own genetic material? Answer: Mitochondria and plastids are the two organelles that contain their own genetic material. Both these organelles have their own DNA and ribosomes."
    },
    {
      "sub-topic": "Intext Questions",
      "Content": "Q2. If the organisation of a cell is destroyed due to some physical or chemical influence, what will happen? Answer: Cell is the smallest unit of life, which is capable of all living functions. If the organisation of a cell is destroyed due to some physical or chemical influence, then the ability of the cell to perform all living functions such as respiration, nutrition, excretion, etc. would be affected."
    },
    {
      "sub-topic": "Intext Questions",
      "Content": "Q3. Why are lysosomes known as suicide bags? Answer: Lysosomes are membrane -bound vesicular structures that contain powerful digestive enzymes. These enzymes are capable of breaking down any foreign food particle or microbes entering the cell. Sometimes, lysosomes can cause self-destruction of a cell by releasing these digestive enzymes within the cells. Hence, they are also known as ‘suicidal bags’."
    },
    {
      "sub-topic": "Intext Questions",
      "Content": "Q4. Where are proteins synthesized inside the cell? Answer: Ribosomes are the site for protein synthesis. Ribosomes are very small structures found either in a free state, suspended in the cytoplasm, or attached to the surface of the endoplasmic reticulum. They are composed of ribonucleic acids and proteins."
    },
    {
      "sub-topic": "Exercise Questions",
      "Content": "EXERCISE QUESTIONS:\nQ1. Make a comparison and write down ways in which plant cells are different from animal cells. Answer: Differences between Plant cell and Animal cell"
    },
    {
      "sub-topic": "Exercise Questions",
      "Content": "Q2. How is a prokaryotic cell different from a eukaryotic cell? Answer: Differences between Prokaryotic cell and Eukaryotic cell"
    },
    {
      "sub-topic": "Exercise Questions",
      "Content": "Q3. What would happen if the plasma membrane ruptures or breaks down? Answer: If the plasma membrane of a cell is ruptured, then the cell will die. The plasma membrane regulates the movement of substances in and out of the cell by diffusion or osmosis. Thus, if the plasma membrane is ruptured, then the cell might leak out its contents."
    },
    {
      "sub-topic": "Exercise Questions",
      "Content": "Q4. What would happen to the life of a cell if there was no Golgi apparatus? Answer: If there was no Golgi apparatus in the cell, then most activities performed by the Golgi apparatus will not take place."
    },
    {
      "sub-topic": "Exercise Questions",
      "Content": "Q5. Which organelle is known as the powerhouse of the cell? Why? Answer: Mitochondria are known as the powerhouse of cells. Mitochondria create energy for the cell, and this process of creating energy for the cell is known as cellular respiration. Most chemical reactions involved in cellular respiration occur in the mitochondria. The energy required for various chemical activities needed for life is released by the mitochondria in the form of ATP (Adenosine triphosphate) molecules. For this reason, mitochondria are known as the powerhouse of cells."
    },
    {
      "sub-topic": "Exercise Questions",
      "Content": "Q6. Where do the lipids and proteins constituting the cell membrane get synthesised? Answer: Lipids and proteins constituting the cell membrane are synthesized in the endoplasmic reticulum."
    },
    {
      "sub-topic": "Exercise Questions",
      "Content": "Q7. How does an Amoeba obtain its food? Answer: Amoeba obtains its food through the process of endocytosis. The flexibility of the cell membrane enables the cell to engulf the solid particles of food and other materials from its external environment."
    },
    {
      "sub-topic": "Exercise Questions",
      "Content": "Q8. What is osmosis? Answer: The movement of water molecules from a region of high concentration to a region of low concentration through a selectively permeable membrane is called osmosis. It is a special case of diffusion, where the medium is water."
    },
    {
      "sub-topic": "Experimental Questions",
      "Content": "Q9. Carry out the following osmosis experiment: Take four peeled potato halves and scoop each one out to make potato cups. One of these potato cups should be made from a boiled potato. Put each potato cup in a trough containing water."
    }
  ]
}