{
  "topic": [
    {
      "sub-topic": "Mitochondria Functionality",
      "Content": "Water and energy takes place in mitochondria."
    },
    {
      "sub-topic": "Digestion of Fats",
      "Content": "Fats are present in the form of large globules in the small intestine. The small intestine gets the secretions in the form of bile juice and pancreatic juice respectively from the liver and the pancreas. The bile salts (from the liver) break down the large fat globules into smaller globules so that the pancreatic enzymes can easily act on them. This is referred to as emulsification of fats. It takes place in the small intestine."
    },
    {
      "sub-topic": "Role of Saliva in Digestion",
      "Content": "Saliva is secreted by the salivary glands, located under the tongue. It moistens the food for easy swallowing. It contains a digestive enzyme called salivary amylase, which breaks down starch into sugar."
    },
    {
      "sub-topic": "Autotrophic Nutrition",
      "Content": "Autotrophic nutrition takes place through the process of photosynthesis. Carbon dioxide, water, chlorophyll pigment, and sunlight are the necessary conditions required for autotrophic nutrition. Carbohydrates (food) and O2 are the by-products of photosynthesis."
    },
    {
      "sub-topic": "Aerobic vs Anaerobic Respiration",
      "Content": "Aerobic respiration occurs in the presence of O2. It involves the exchange of gases between the organism and the outside environment. It occurs in cytoplasm and mitochondria. It always releases CO2 and H2O and yields 36 ATPs. Anaerobic respiration occurs in the absence of O2. Exchange of gases is absent. It occurs only in cytoplasm and yields only 2 ATPs. Anaerobic respiration occurs in the roots of some waterlogged plants, some parasitic worms, animal muscles, and some micro-organisms such as yeasts."
    },
    {
      "sub-topic": "Alveoli and Gas Exchange",
      "Content": "The alveoli are the small balloon-like structures present in the lungs. The walls of the alveoli consist of extensive network of blood vessels. Each lung contains 300 –350 million alveoli, making it a total of approximately 700 million in both the lungs. The alveolar surface when spread out covers about 80 m2 area. This large surface area makes the gaseous exchange more efficient."
    },
    {
      "sub-topic": "Deficiency of Haemoglobin",
      "Content": "Haemoglobin is the respiratory pigment that transports oxygen to the body cells for cellular respiration. Therefore, deficiency of haemoglobin in blood can affect the oxygen supplying capacity of blood. This can lead to deficiency of oxygen in the body cells. It can also lead to a disease called anaemia."
    },
    {
      "sub-topic": "Double Circulation",
      "Content": "The human heart is divided into four chambers − the right atrium, the right ventricle, the left atrium, and the left ventricle. Flow of blood in the heart: The heart has superior and inferior vena cava, which carries de-oxygenated blood from the upper and lower regions of the body respectively and supplies this de-oxygenated blood to the right atrium of the heart. The right atrium then contracts and passes the de-oxygenated blood to the right ventricle, through an auriculo-ventricular aperture. Then the right ventricle contracts and passes the de-oxygenated blood into the two pulmonary arteries, which pumps it to the lungs where the blood becomes oxygenated. From the lungs, the pulmonary veins transport the oxygenated blood to the left atrium of the heart. Then the left atrium contracts and through the auriculo-ventricular aperture, the oxygenated blood enters the left ventricle. The blood passes to aorta from the left ventricle. The aorta gives rise to many arteries that distribute the oxygenated blood to all the regions of the body. Therefore, the blood goes twice through the heart. This is known as double circulation. Importance of double circulation: The separation of oxygenated and de-oxygenated blood allows a more efficient supply of oxygen to the body cells. This efficient system of oxygen supply is very useful in warm-blooded animals such as human beings."
    },
    {
      "sub-topic": "Transport in Xylem and Phloem",
      "Content": "Transport of materials in xylem: Xylem tissue helps in the transport of water and minerals. Water is transported upwards from roots to all other plant parts. Transport in xylem occurs with the help of simple physical forces such as transpiration pull. Transport of materials in phloem: Phloem tissue helps in the transport of food. Food is transported in both upward and downward directions. Transport of food in phloem requires energy in the form of ATP."
    },
    {
      "sub-topic": "Function of Alveoli vs Nephrons",
      "Content": "ALVEOLI Structure (i) Alveoli are tiny balloon-like structures present inside the lungs. (ii) The walls of the alveoli are one cell thick and it contains an extensive network of blood capillaries. Function (i) The exchange of O2 and CO2 takes place between the blood of the capillaries that surround the alveoli and the gases present in the alveoli. (ii) Alveoli are the site of gaseous exchange. NEPHRON Structure (i) Nephrons are tubular structures present inside the kidneys. (ii) Nephrons are made of glomerulus, bowman’s capsule, and a long renal tube. It also contains a cluster of thin-walled capillaries. Function (i) The blood enters the kidneys through the renal artery which branches into many capillaries in the glomerulus. The water and solute are transferred to the nephron at Bowman’s capsule. Then the filtrate moves through the proximal tubule and then down into the loop of henle. From henle’s loop, filtrate passes into the distal tubule and then to the collecting duct. The collecting duct collects the urine from many nephrons and passes it to the ureter. During the flow of filtrate, some substances such as glucose, amino acids, and water are selectively re-absorbed. (ii) Nephrons are the basic filtration unit."
    },
    {
      "sub-topic": "Introduction to Control and Coordination",
      "Content": "As the complexity of the individuals, plants or animals increases the different cells and organs become separated from each other by greater distance. Thus it becomes necessary to have a system by which the different parts of the organisms can function as a single unit. This is possible only if the different parts can coordinate with each other and carry out a particular function. To carry out a simple function such as picking up an object from the ground there has to be coordination of the eyes, hands, legs and the vertebral column. The eyes have to focus on the object, the hands have to pick it up and grasp it, the legs have to bend and so does the back bone (vertebral column). All these actions have to be coordinated in such a manner that they follow a particular sequence and the action is completed. A similar mechanism is also needed for internal functions of the body. The individuals also have to adjust to the changing conditions around them and vary their responses. At the same time, the internal conditions of the body should be maintained constant. This is called homeostasis. Homeostasis is derived from 'homeo' meaning same and 'stasis' meaning standing still. The internal conditions of the body are maintained at a constant by controlling the physiology of the organism. Just as in animals, plants also have to control and coordinate their various functions."
    },
    {
      "sub-topic": "Nervous System Overview",
      "Content": "The nervous system of an animal is composed of i) Specialized cells called neurons or nerve cells which can detect, receive and transmit different kinds of stimuli. ii) The nerve fibres which are certain bundles of extended processes of nerve cells. Nerve cells or neurons are the structural and functional units of the nervous system. Billions of nerve cells make up our brain. A nerve cell is a microscopic structure consisting of three major parts namely cell body, dendrites and axon."
    },
    {
      "sub-topic": "Neurons Structure",
      "Content": "A nerve cell is a microscopic structure consisting of three major parts namely cell body, dendrites and axon. Cell Body: It is the cell structure irregular in shape or polyhedral structure, it is also called as cyton. Cell body contains cytoplasm with typical cell organelles and certain granular bodies called Nissl granules. Dendrites: Dendrites or Dendrons are shorter fibres which branch repeatedly and project out of the cell body. Dendrites transmit electrical impulses towards the cyton. Axon: One of the fibres arising from the cell body is very long with a branched distal end and it is called as Axon. The distal branches terminate as bulb-like structures called synaptic knob filled with chemicals called neurotransmitters. Axon contains axoplasm inside and is covered by a membrane called neurilemma. Neurilemma encloses the axon except at the branched distal ends. In some neurons called myelinated neurons an additional white fatty fibre called myelin sheath covers the neurilemma. Myelin sheath is not continuous over the neurilemma. The gaps left by the myelin sheath on the axon are called Nodes of Ranvier. Over the myelin sheath are found certain cells called Schwann cells."
    },
    {
      "sub-topic": "Types of Nerve Cells",
      "Content": "Types of Nerve Cells: a) Myelinated or Medullated or White neurons: When the axon is enclosed by the white fatty myelin cover it is called Myelinated or Medullated or White neurons. This forms the cerebral cortex of our brain. b) Non-Myelinated or Non-Medullated or Grey neurons: This neuron is not enclosed by myelin sheath; so it appears greyish in colour. The axon is covered by only neurilemma and Schwann cells. This type of neuron is found in the white matter of cerebrum. c) Unipolar neurons: The embryonic nervous tissue contains unipolar neurons. An unipolar neuron has a nerve cell body with a single process or fibre, which will act both as axon and Dendron. d) Bipolar neurons: The sensory hair cells of the sense organs like rods and cones of retina are made up of bipolar neurons. Each bipolar neuron has a cell body and two process at the ends, one acting as axon and the other acting as Dendron. e) Multipolar neuron: The cerebral cortex contains the multipolar neurons; each multipolar neuron has a cell body with many dendrites and an axon."
    },
    {
      "sub-topic": "Nerve Impulse",
      "Content": "The conduction of stimuli by the nerve cells is called nerve impulse. The dendrites will receive the stimuli from the receptor (sense organ) and conduct the same as electrical impulse to the axon through the cyton. At the synapse, the synaptic knobs release out chemical substances called neurotransmitters which convert the electrical impulse into chemical impulse and pass it to the neighbouring cells."
    }
  ]
}