{
  "topic": [
    {
      "sub-topic": "Phototropic Movement",
      "Content": "The growth in a plant part in response to light is called phototropic movement. Stems usually show positive phototropic movement, while roots usually show negative phototropic movement. If a plant is kept in a container in which no sunlight reaches and a hole in the container allows some sunlight; the stem finally grows in the direction of the sunlight. This happens because of a higher rate of cell division in the part of stem which is away from the sunlight. As a result, the stem bends towards the light. The heightened rate of cell division is attained by increased secretion of the plant hormone auxin in the part which is away from sunlight."
    },
    {
      "sub-topic": "Hydrotropic Movement",
      "Content": "Hydrotropic Movement: When roots grow in the soil, they usually grow towards the nearest source of water. This shows a positive hydrotrophic movement."
    },
    {
      "sub-topic": "Thigmotropic Movement",
      "Content": "Thigmotropic Movement: The growth in a plant part in response to touch is called thigmotropic movement. Such movements are seen in tendrils of climbers. The tendril grows in a way so as it can coil around a support. The differential rate of cell division in different parts of the tendril happens due to action of auxin."
    },
    {
      "sub-topic": "Nastic Movement",
      "Content": "NASTIC MOVEMENT: The movements which do not depend on the direction from the stimulus acts are called nastic movement. For example; when someone touches the leaves of mimosa, the leaves droop. The drooping is independent of the direction from which the leaves are touched. Such movements usually happen because of changing water balance in the cells. When leaves of mimosa are touched, the cells in the leaves lose water and become flaccid; resulting in drooping of leaves."
    },
    {
      "sub-topic": "Plant Hormones",
      "Content": "Some Plant Hormones: Auxin, gibberellins and cytokinin promote growth in plant parts. Abscissic acid inhibits growth in a particular plant part. Prepared by: M. S. KumarSwamy, TGT(Maths) Page - 60 - INTEXT QUESTIONS PAGE NO. 122 Question 1: What are plant hormones? Answer : Plant hormones or phytohormones are naturally -occurring organic substances. These are synthesized in one part of the plant body (in minute quantities) and are translocated to other parts when required. The five major types of phytohormones are auxins, gibberellins, cytokinins, abscisic acid, and ethylene."
    },
    {
      "sub-topic": "Comparative Movements",
      "Content": "Answer : The movement of leaves of the sensitive plant, Mimosa pudica or “touch me not”, occurs in response to touch or contact stimuli. This movement is independent of growth. The movement of shoot towards light is known as phototropism. This type of movement is directional and is growth dependent. Question 3: Give an example of a plant hormone that promotes growth. Answer : Auxin is an example of growth-promoting plant hormone."
    },
    {
      "sub-topic": "Auxins and Growth",
      "Content": "Answer : Auxin is synthesized at the shoot tip. It helps the cell grow longer. When a tendril comes in contact with a support, auxin stimulates faster growth of the cells on the opposite side, so that the tendril forms a coil around the support. This makes the tendrils appear as a watch spring."
    }
  ]
}