{
  "topic": [
    {
      "sub-topic": "Autotrophic nutrition",
      "Content": "1. Food is synthesised from simple inorganic raw materials such as CO2 and water."
    },
    {
      "sub-topic": "Heterotrophic nutrition",
      "Content": "1. Food is obtained directly or indirectly from autotrophs. This food is broken down with the help of enzymes."
    },
    {
      "sub-topic": "Autotrophic nutrition",
      "Content": "2. Presence of green pigment (chlorophyll) is necessary."
    },
    {
      "sub-topic": "Heterotrophic nutrition",
      "Content": "2. No pigment is required in this type of nutrition."
    },
    {
      "sub-topic": "Autotrophic nutrition",
      "Content": "3. Food is generally prepared during day time."
    },
    {
      "sub-topic": "Heterotrophic nutrition",
      "Content": "3. Food can be prepared at all times."
    },
    {
      "sub-topic": "Autotrophic nutrition",
      "Content": "4. All green plants and some bacteria have this type of nutrition."
    },
    {
      "sub-topic": "Heterotrophic nutrition",
      "Content": "4. All animals and fungi have this type of nutrition."
    },
    {
      "sub-topic": "Sources of raw materials for photosynthesis",
      "Content": "The following raw materials are required for photosynthesis: \n The raw material CO2 enters from the atmosphere through stomata. \n Water is absorbed from the soil by the plant roots. \n Sunlight, an important component to manufacture food, is absorbed by the chlorophyll and other green parts of the plants."
    },
    {
      "sub-topic": "Role of acid in stomach",
      "Content": "Following are the roles of acid in our stomach: \n1. The hydrochloric acid present in our stomach dissolves bits of food and creates an acid ic medium. In this acidic medium, enzyme pepsinogen is converted to pepsin, which is a protein -digesting enzyme. \n2. The hydrochloric acid kills the harmful microbes that enter with food and thus prevents infection of digestive tract."
    },
    {
      "sub-topic": "Function of digestive enzymes",
      "Content": "Digestive enzymes such as amylase, lipase, pepsin, trypsin, etc. help in the breaking down of complex food particles into simple ones. These simple particles can be easily absorbed by the blood and thus transported t o all the cells of the body."
    },
    {
      "sub-topic": "Design of small intestine for absorption",
      "Content": "The small intestine has millions of tiny finger -like projections called villi. These villi increase the surface area for more efficient food absorption. Within these villi, many blood vessels are present that absorb the digested food and carry it to the blood stream. From the blood stream, the absorbed food is delivered to each and every cell of the body."
    },
    {
      "sub-topic": "Introduction to respiration",
      "Content": "The process by which a living being utilizes the food to get energy is called respiration. Respiration is an oxidation reaction in which carbohydrate is oxidized to produce energy. Mitochondrion is the site of respiration and the energy released is stored in the form of ATP (Adenosine triphosphate). ATP is stored in mitochondria and is released as per need."
    },
    {
      "sub-topic": "Steps of respiration",
      "Content": "Breaking down glucose into pyruvate: This step happens in the cytoplasm. Glucose molecule is broken down into pyruvic acid. Glucose molecule is composed of 6 carbon atoms, while pyruvic acid is composed of 3 carbon atoms. \nFate of Pyruvic Acid: Further breaking down of pyruvic acid takes place in mitochondria and the molecules formed depend on the type of respiration in a particular organism. Respiration is of two types, viz. aerobic respiration and anaerobic respiration."
    },
    {
      "sub-topic": "Types of respiration",
      "Content": "Aerobic Respiration: This type of respiration happens in the presence of oxygen. Pyruvic acid is converted into carbon dioxide. Energy is released and water molecule is also formed at the end of this process. \nAnaerobic Respiration: This type of respiration happens in the absence of oxygen. Pyruvic acid is either converted into ethyl alcohol or lactic acid. Ethyl alcohol is usually formed in case of anaerobic respiration in microbes; like yeast or bacteria. Lactic acid is formed in some microbes as well as in the muscle cells."
    },
    {
      "sub-topic": "Anaerobic respiration in muscles",
      "Content": "Pain in Leg Muscles on Running: When someone runs too fast, he may experience a throbbing pain in the leg muscles. This happens because of anaerobic respiration taking place in the muscles. During running, the energy demand from the muscle cells increases. This is compensated by anaerobic respiration and lactic acid is formed in the process. The deposition of lactic acid causes the pain the leg muscles. The pain subsides after taking rest for some time."
    },
    {
      "sub-topic": "Gas exchange in organisms",
      "Content": "For aerobic respiration; organisms need a continuous supply of oxygen, and carbon dioxide produced during the process needs to be removed from the body. Different organisms use different methods for intake of oxygen and expulsion of carbon dioxide. Diffusion is the method which is utilized by unicellular and some simple organisms for this purpose. In plants also, diffusion is utilized for exchange of gases. In complex animals, respiratory system does the job of exchange of gases. Gills are the respiratory organs for fishes. Fishes take in oxygen; which is dissolved in water; through gills. Since availability of oxygen is less in the aquatic environment so the breathing rate of aquatic organisms is faster. Insects have a system of spiracles and tracheae which is used for taking in oxygen. Terrestrial organisms have developed lungs for exchange of gases. Availability of oxygen is not a problem in the terrestrial environment so breathing rate is slower compared to what it is in fishes."
    },
    {
      "sub-topic": "Human respiratory system",
      "Content": "The human respiratory system is composed of a pair of lungs. These are attached to a system of tubes which open on the outside through the nostrils. Following are the main structures in the human respiratory system: \nNostrils: There two nostrils which converge to form a nasal passage. The inner lining of the nostrils is lined by hairs and remains wet due to mucus secretion. The mucus and the hairs help in filtering the dust particles out from inhaled air. Further, air is warmed up when it enters the nasal passage. \nPharynx: It is a tube like structure which continues after the nasal passage. \nLarynx: This part comes after the pharynx. This is also called the voice box. \nTrachea: This is composed of rings of cartilage. Cartilaginous rings prevent the collapse of trachea in the absence of air. \nBronchi: A pair of bronchi comes out from the trachea; with one bronchus going to each lung. \nBronchioles: A bronchus divides into branches and sub-branches; inside the lung. \nAlveoli: These are air-sacs at the end of bronchioles. Alveolus is composed of a very thin membrane and is the place where blood capillaries open. This is alveolus; where oxygen mixes with the blood and carbon dioxide exits from the blood. The exchange of gases; in alveoli; takes place due to pressure differential."
    },
    {
      "sub-topic": "Breathing mechanism",
      "Content": "The breathing mechanism of lungs is controlled by the diaphragm and the intercostalis muscles. Diaphragm is a membrane which separates the thoracic chamber from the abdominal cavity. When diaphragm moves down, the lungs expand and air is inhaled. When diaphragm moves up, the lungs contract and air is exhaled."
    },
    {
      "sub-topic": "Comparison of oxygen obtaining in terrestrial and aquatic organisms",
      "Content": "Terrestrial organisms take up oxygen from the atmosphere whereas aquatic animals need to utilize oxygen present in the water. Air contains more O2 as compared to water. Since the content of O2 in air is high, the terrestrial animals do not have to breathe faster to get more oxygen. Therefore, unlike aquatic animals, terrestrial animals do not have to show various adaptations for better gaseous exchange."
    },
    {
      "sub-topic": "Glucose oxidation for energy",
      "Content": "Glucose is first broken down in the cell cytoplasm into a three carbon molecule called pyruvate. Pyruvate is further broken down by different ways to provide energy."
    },
    {
      "sub-topic": "Oxygen and carbon dioxide transport in humans",
      "Content": "Haemoglobin transports oxygen molecule to all the body cells for cellular respiration. The haemoglobin pigment present in the blood gets attached to four O2 molecules that are obtained from breathing. It thus forms oxyhaemoglobin and the blood becomes oxygenated. This oxygenated blood is then distributed to all the body cells by the heart. After giving away O2 to the body cells, blood takes away CO2 which is the end product of cellular respiration. Now the blood becomes de-oxygenated. Since haemoglobin pigment has less affinity for CO2, CO2 is mainly transported in the dissolved form. This de-oxygenated blood gives CO2 to lung alveoli and takes O2 in return."
    },
    {
      "sub-topic": "Alveoli and gas exchange",
      "Content": "The exchange of gases takes place between the blood of the capillaries that surround the alveoli and the gases present in the alveoli. Thus, alveoli are the site for exchange of gases. The lungs get filled up with air during the process of inhalation as ribs are lifted up and diaphragm is flattened. The air that is rushed inside the lungs fills the numerous alveoli present in the lungs. Each lung contains 300 -350 million alveoli. These numerous alveoli increase the surface area for gaseous exchange making the process of respiration more efficient."
    }
  ]
}