{
  "topic": [
    {
      "sub-topic": "Organisms Dependent on Soil",
      "Content": "Living organisms depend on soil in the following ways: (i) It provides natural habitat for various living organisms, e.g., bacteria, fungi, algae, earthworms, etc. These help to maintain the fertility of soil. (ii) Earthworm performs all its activities in the soil. It maintains the fertility of soil by releasing nitrogen rich excreta. (iii) Many animals like rats, rabbits, etc., make their home in the soil. (iv) Soil helps to bind the roots of plants to provide them anchorage. The nutrients in soil are absorbed by the plants for their growth and development. All organisms that live in water are totally dependent on soil because the mineral nutrients are present in water in dissolved form. But, their recycling depends on the decomposers which are present in soil beds. For this, all water bodies have soil beds which contain decomposers for the recycling of nutrients."
    },
    {
      "sub-topic": "Weather Prediction",
      "Content": "Meterologists collect information regarding the pattern of temperature, speed of wind, air pressure and all other features which influence weather. All these information are collected by remote sensing and weather forecast satellites. This information is then compiled in meteorological departments which prepare a weather report that is displayed on the maps. This information is further transmitted through radio, television and newspaper."
    },
    {
      "sub-topic": "Pollution Reduction Strategies",
      "Content": "Isolating human activities to specific and limited areas would definitely help in reducing pollution to some extent. For example, (i) If sewage and garbage generated by homes and industries is treated properly before discharging into water sources, it will reduce water pollution and cause less harm to the aquatic life. (ii) If hot water generated by the industries is collected at common place, allowed to cool and then discharged in water bodies, will not affect the breeding capacity of aquatic organisms. (iii) If commercial areas, factories and industries are shifted to the isolated area far away from residential areas, it can reduce the effect of air pollution on people."
    },
    {
      "sub-topic": "Influence of Forests on Resources",
      "Content": "Forests influence the quality of air, soil and water resources in following ways: (i) Influence of forests on air occurs in these ways: (a) Forests help to maintain oxygen and carbon dioxide balance in the air. They reduce the level of CO2 in the air and to prevent greenhouse effect. (b) These maintain temperature of the environment. (c) Forests increase the rate of photosynthesis in surrounding region. (ii) Influence of forests in quality of soil: (a) Trees spread their roots deep inside the Earth and bind the soil particles firmly. This reduces soil erosion. (b) Forests help to maintain nutrient cycles (biogeochemical cycles) in the atmosphere. (iii) Influence of forests in quality of water: (a) Trees help to maintain the water cycle. (b) Forests conserve water and make them available on the surface of Earth as water sources."
    },
    {
      "sub-topic": "Introduction to Food Resources",
      "Content": "There is a need to introduce production efficiency of crops and livestock because 1. rapid increase in population 2. No major scope of increasing area of land under cultivation. Increase in food production without degrading our environment and disturbing the ecological balance i.e. Sustainable Practices are required in agriculture and animal husbandry."
    },
    {
      "sub-topic": "Types of Crops",
      "Content": "Cereals: wheat, rice, maize, millets and sorghum. Provide carbohydrates for energy requirements. Pulses: pea, gram, black gram, green gram, pigeon pea and lentil. Provide proteins. Oilseeds: soya bean, ground nut, sesame, castor, mustard, linseed and sun flower. Provide necessary fats. Vegetables, spices and fruits provide vitamins and minerals."
    },
    {
      "sub-topic": "Rabi Crops",
      "Content": "Rabi crops or Rabi harvests are the crops in agriculture that are sown in winter or cold season. They are harvested in the spring. Rabi is Arabic word which in actual means \"spring\". Thus the word \"Rabi\" is used frequently in subcontinent. Rabi is grown around the month of November to April in our subcontinent. The water collected from the rain in this season is the main source of water in these plants. Rabi crops require greater amount of irrigation. Thus heavy raining may ruin a Kharif crop but it is healthy and beneficial for Rabi crops. These crops are then taken out at departure of the monsoon rains. The harvesting may begin by April or May. Major Rabi crops that are harvested in subcontinents are wheat, grams, peas, mustard, linseed and barley. Most of the crops are under Rabi season."
    },
    {
      "sub-topic": "Kharif Crops",
      "Content": "Kharif crop refers to the farming, plowing, reaping and harvesting of any household plants sown in the rainy season. It is derived from mochas words in subcontinent. In subcontinent they are popularly known as monsoon plants. They are cultivated for autumn harvest. By the beginning of first rain in July during south west rainy season in monsoon the crops are sown. Its begins at April 16 to October 15 in Pakistan, while in India Kharif season varies state to state in may and ending latest by January. The Indian subcontinent is referred to areas covering India, Pakistan, Nepal and Sri Lanka. These crops are totally dependent on quantity of rain and water as well as its timings."
    },
    {
      "sub-topic": "Difference between Kharif and Rabi Crops",
      "Content": "Kharif crops sown between April and May while Rabi crops are sown between September and October. Kharif crops are harvested after monsoon rains while Rabi crops are produced after winter. Kharif crops are popularly known as monsoon crops while Rabi crops are called winter or spring crops. Kharif crops are completely relying over the rain like if less or more in quantity while Rabi can deal with whatever water is present for irrigation. Rain has less impact over Rabi crops. The major examples that can be counted as Kharif crops are sunflower, rice, sugar cane, soya bean and tea while Rabi crops can be wheat, barley, pea, gram and mustard."
    },
    {
      "sub-topic": "Improving Crop Yield",
      "Content": "Improving crop yields involves the practices carried out by farmers to achieve higher standards of crop production. It includes: 1. Choice of seeds for planting 2. Nurturing of the crop plants 3. Protection of the growing and harvested crops from loss. The major activities for improving crop yields can be classified as (i) Crop variety improvement (ii) Crop production improvement (iii) Crop protection improvement."
    },
    {
      "sub-topic": "Crop Variety Improvement",
      "Content": "This approach depends on finding a crop that can give a good yield. Some of the factors for which variety improvement is done are:  Higher yield : for increasing the productivity per acre.  Improved quality : quality considerations vary from crop to crop as per the requirements.  Biotic and abiotic resistance : crops should have sufficient resistance to biotic factors (diseases, insects and nematodes) and abiotic stresses (heat, cold, frost etc.)  Change in maturity duration : the shorter the duration, the more economical is the variety.  Wider adaptability : it can be grown in different climatic conditions.  Desirable agronomic characteristics : tallness and profuse branching for fodder crops. Dwarfs are desired for cereals. This can be achieved by two methods; hybridisation and genetically modified crops."
    },
    {
      "sub-topic": "Hybridisation and GM Crops",
      "Content": "In genetics, hybridisation is the process of combining different varieties or species of organisms which are genetically dissimilar to create a hybrid. It can be inter varietal, inter specific, intergeneric. 2. Genetically modified crops. Here the crop is improved by introducing a gene that would provide desired characteristics."
    },
    {
      "sub-topic": "Biotic and Abiotic Factors Affecting Crop Production",
      "Content": "A variety of biotic factors such as pests, nematodes, diseases, etc. can reduce the net crop production. A pest causes damage to agriculture by feeding on crops. For example, boll weevil is a pest on cotton. It attacks the cotton crop, thereby reducing its yield. Weeds also reduce crop productivity by competing with the main crop for nutrients, light, and space. Similarly, abiotic factors such as salinity, temperature, etc. affect the net crop production. Some natural calamities such as droughts and floods are unpredictable. Their occurrence has a great impact on crops sometimes, destroying the entire crop."
    },
    {
      "sub-topic": "Desirable Agronomic Characteristics",
      "Content": "The desirable agronomic characteristics for crop improvements are: (i) Tallness and profuse branching in any fodder crop. (ii) Dwarfness in cereals. These desirable agronomic characteristics help in increasing crop productivity."
    },
    {
      "sub-topic": "Nutrient Management",
      "Content": "Nutrient management involves different practices carried out by farmers to achieve higher yields. The higher yields of crops mainly depend upon input applications like improved seeds, fertilizers and modern techniques of sowing and harvesting. Plants require a number of nutrients for their growth and development. Plants get nutrients from air, water and soil. Nearly 16 elements are essential for plant growth and reproduction. On the basis of the requirement by the plants, they are further classified into Macro Nutrients and Micro Nutrients."
    },
    {
      "sub-topic": "Macro and Micro Nutrients",
      "Content": "Elements which are needed in large quantities for the growth of the plants are called Macro Nutrients. They are Carbon, Hydrogen, Oxygen, Nitrogen, Phosphorous, Sulphur, Potassium, Calcium, Magnesium and Iron. Elements which are needed by the plants in very small quantities are called Micro Nutrients. They are Manganese, Copper, Molybdenum, Zinc, Boron and Chlorine. Deficiency of these nutrients affects physiological processes in plants including reproduction, growth and susceptibility to diseases. To increase the yield, the soil can be enriched by supplying these nutrients in the form of manure and fertilizers."
    }
  ]
}