{
  "topic": [
    {
      "sub-topic": "Tetanus (Lock jaw) - Overview",
      "Content": "Lock jaw disease is caused by the spores of Clostridium tetani that enter through wounds."
    },
    {
      "sub-topic": "Tetanus (Lock jaw) - Incubation and Transmission",
      "Content": "Incubation period is of 3 -25 days during which the bacterium secretes a powerful exotoxin tenanospasmin into the tissue, and blood carries it to the central nervous system and brings about tetanus of muscles."
    },
    {
      "sub-topic": "Tetanus (Lock jaw) - Mode of Transmission",
      "Content": "Its infection is acquired by contamination of wounds with tetanus spores as these infected spores are abundant in the soil manured with animal dung. Spores may survive for 60 or more years in contaminated soil."
    },
    {
      "sub-topic": "Tetanus (Lock jaw) - Symptoms",
      "Content": "Symptoms include painful muscular spasms especially of neck and jaw. Lock jaw condition occurs when the patient cannot open the mouth. Convulsions and paralysis of muscles, difficulty in chewing and swallowing, fever and headache are the other symptoms."
    },
    {
      "sub-topic": "Tetanus (Lock jaw) - Prevention and Treatment",
      "Content": "All wounds should be treated carefully and cleaned with iodine solution. Immunisation of infants by DPT should be done. Anti-tetanus serum (ATS) injection within 24 hours of injury provides passive immunity while tetanus toxoid (TT) gives active immunity."
    },
    {
      "sub-topic": "Plague (Black Death) - Overview",
      "Content": "Plague is caused by a rod-shaped non-motile bacterium called Pasteurella/Yersinia pestis and is transmitted by the bite of infected rat flea, Xenopsylla cheopis."
    },
    {
      "sub-topic": "Plague (Black Death) - Historical Context",
      "Content": "The first authenticated plague epidemics in India in modern times occurred in 1895-96 and from 1898 onwards the disease was appreciably manifest, reaching a peak in the year 1907."
    },
    {
      "sub-topic": "Plague (Black Death) - Mode of Transmission",
      "Content": "Pasteurella pestis endoparasite of gut of rat flea (which is an ectoparasite of rat and mouse). Head louse (Pediculus) and bedbug (Cimex) may also transmit the germs from man to man."
    },
    {
      "sub-topic": "Plague (Black Death) - Prevention and Treatment",
      "Content": "Plague is confirmed by Wayson stain test. Anti-plague vaccine, spray of insecticides, killing of rats, nose caps and high cots (rat flea can jump up to 45 cm) are some preventive measures. Streptomycin or oral tetracycline is effective against plague."
    },
    {
      "sub-topic": "Leprosy (Hansen’s Disease) - Overview",
      "Content": "Leprosy is a contagious chronic bacterial disease caused by Mycobacterium leprae which is characterised by the chronic infection of the skin and other tissues."
    },
    {
      "sub-topic": "Leprosy (Hansen’s Disease) - Transmission",
      "Content": "The incubation period is very long and averages up to 2-5 years. Infection occurs by prolonged contact with leprosy patients. The bacilli leave the body in nasal discharge, from the throat during coughing, sneezing and even speaking and through broken skin lesions."
    },
    {
      "sub-topic": "Leprosy (Hansen’s Disease) - Symptoms",
      "Content": "These include appearance of light coloured patches on the skin, thickening of the nerves, partial or total loss of sensation in the affected parts of the body. These are accompanied by fever, pain, ulcers and skin eruptions. Deformities of toes and fingers may also develop. Lepromin test is used to evaluate leprosy using an intradermal injection of a lepromin. This test classifies the type of leprosy based on reaction. Tuberculoid leprosy gives positive test with lepromin while lepromatous leprosy is negative to lepromin test."
    },
    {
      "sub-topic": "Leprosy (Hansen’s Disease) - Prevention and Treatment",
      "Content": "No vaccine is available. Leprosy is treated with drugs like rifampicin, dapsone, and clofazimine."
    },
    {
      "sub-topic": "Fungi - Overview",
      "Content": "Fungi are microorganisms characterised by cell walls made from a substance called chitin. Most fungi are harmless to humans and some are edible. Other fungi can be infectious and may lead to life-threatening diseases. Fungi reproduce by releasing spores that can be picked up by direct contact or even inhaled."
    },
    {
      "sub-topic": "Fungi - Infections and Examples",
      "Content": "Fungal infections often affect the lungs, skin or nails. Some infections may also penetrate the body to affect organs and cause whole-body infections. Examples of fungal infections include: Athlete’s foot: itching, scaling or cracking of the skin; Ringworm: reddish, itchy, scaly rash usually on the skin and scalp; Thrush: caused by the fungus Candida albicans which can infect the mouth, vagina, stomach and urinary tract."
    },
    {
      "sub-topic": "Fungi - Dermatophytes",
      "Content": "Fungi that commonly cause skin diseases are called dermatophytes. “Dermatophytes” doesn't refer to a particular group of fungi, but rather to the fact that they attack the dermis, or skin. Fungal infections of the skin can be treated with topical creams as well as prescription drugs."
    },
    {
      "sub-topic": "Fungi - Athlete's Foot",
      "Content": "The best-known fungal skin infection is athlete's foot. It infects approximately 10 percent of the United States population. It is most common among adolescents and adults; however, it may affect people of any age. Athlete's foot can grow on the feet in different forms, including the following: Interdigital, Moccasin, Vesicular, and Ulcerative."
    },
    {
      "sub-topic": "Fungi - Scalp Itch",
      "Content": "Scalp itch is a fungal infection of the scalp and hair. It usually occurs in young children, but may appear in all age groups. It is contagious and may be spread from child to child in a school or day care setting. An antifungal drug called griseofulvin cures scalp itch in one to three months."
    },
    {
      "sub-topic": "Fungi - Nail Fungus",
      "Content": "Nail fungus is most common in adolescents and adults, especially among people who have frequent manicures. These infections can manifest themselves in a variety of patterns. Sometimes a portion of the nail becomes thick and brittle. Other times, the fungi attack the cuticle and the growth spreads out from there. This cuticle-based infection is common in AIDS patients."
    },
    {
      "sub-topic": "Parasitic Diseases - Overview",
      "Content": "A parasite is an organism that lives off another organism, typically attaching itself to feed from the victim’s blood, bowels, or other various bodily fluids. Parasitic diseases are more common than most people realize, and can strike anyone regardless of race, age, or social status."
    },
    {
      "sub-topic": "Parasitic Diseases - Symptoms",
      "Content": "Parasites such as roundworms feed off the human waste in the intestines. Symptoms of various worm infestation include itching, usually of the anus or vaginal area, weight loss, increased appetite, abdominal pain, bowel obstructions, vomiting, disturbed sleep, worms present in the stools or vomit, diarrhea, anemia, symptoms of pneumonia, food poisoning symptoms, aching muscles or joints, or a generally feeling of illness. These symptoms can range from barely noticeable to very severe."
    },
    {
      "sub-topic": "Parasitic Diseases - Causes",
      "Content": "Parasitic disease is typically caused by the parasite’s entry into the body via the skin or mouth. It is not unusual to pick up parasitic infections from soil, typically by either walking barefoot and allowing entry through the feet, or by placing the hands in the dirt and eventually placing the fingers in the mouth. Often people carry a parasite without ever knowing it."
    },
    {
      "sub-topic": "Parasitic Diseases - Risk Factors",
      "Content": "Risk factors for parasites include children who play outdoors in the dirt, close contact with pets, farming, gardening, outdoor activities that include walking near wooded areas, digging in the dirt, walking outside barefoot, being in close or sexual contact with someone who has specific parasites, or sometimes simply the act of walking from the car to the house. Parasites exist in the world and cannot be avoided simply by avoiding being outdoors."
    },
    {
      "sub-topic": "Parasitic Diseases - Treatment",
      "Content": "Treatment of parasitic disease is typically nothing. Most often there are no symptoms, or symptoms are so mild that there is no concern, and thus physicians are not told to consider the symptoms as a possible parasitic disease. Unless there are serious symptoms or the infestation is large enough to cause health problems, most parasitic diseases will clear up on their own."
    },
    {
      "sub-topic": "Parasitic Diseases - Prevention",
      "Content": "Coping with a parasitic disease can be stressful, more so when the patient believes that parasites come from being dirty. Parasites can be contracted regardless of the cleanliness of the home. While hand washing and overall cleanliness are positive ways to prevent parasitic infections and diseases, they in no way guarantee that parasites won’t infect a family member."
    },
    {
      "sub-topic": "Introspection Questions - Good Health",
      "Content": "Good health of a person depends on (i) social environment. (ii) public cleanliness. (iii) good economic conditions and earnings. (iv) social equality and harmony."
    },
    {
      "sub-topic": "Introspection Questions - Free from Disease",
      "Content": "The conditions essential for being free of diseases include (i) Taking good food (balanced diet) (ii) Maintaining personal and public hygiene."
    }
  ]
}