{
  "topic": [
    {
      "sub-topic": "Artificial Vegetative Propagation",
      "Content": "If a leaf is put under the soil, small saplings grow from the notches on the leaf margin. (see above figure) Artificial Vegetative Propagation: Man has used artificial vegetative propagation to grow many plants. This has enabled farmers and horticulturists to grow many plants in shorter duration and has helped them to earn more profit. Artificial vegetative propagation has also helped in developing many new varieties of plants. Stem cutting, layering and grafting are the preferred means of artificial vegetative propagation."
    },
    {
      "sub-topic": "Spore Formation",
      "Content": "SPORE FORMATION Rhizopus produces hundreds of microscopic reproductive units called spores. When the spore case (also called sporangium) bursts, the spores spreads into air. The air-borne spores land on food or soil, under favourable conditions like damp and warm conditions, they germinate and produce new individuals. Most of the fungi like Rhizopus, Mucor etc., Bacteria and non-flowering plants such as ferns and mosses reproduce by the method of spore formation."
    },
    {
      "sub-topic": "Asexual Reproduction",
      "Content": "Advantages of Asexual Reproduction: 1. The organism does not have to depend on another organism for carrying out reproduction; because a single parent is needed. 2. It takes less time than sexual reproduction and hence more number of offspring can be produced in shorter time. 3. The offspring are exact clones of their parent. 4. Desirable characteristics can be easily incorporated into plants with artificial vegetative propagation. Disadvantages of Asexual Reproduction: 1. As a single parent is involved, so there is negligible chance of variation. 2. In most of the cases in simple organisms, the parent generation ceases to exist after asexual reproduction. 3. Asexual reproduction cannot give rise to biodiversity which is important for a healthy ecosystem."
    },
    {
      "sub-topic": "Binary Fission vs Multiple Fission",
      "Content": "Q1. How does binary fission differ from multiple fission? Ans: 1. In binary fission, the parent organism splits to form two new organisms. In multiple fission, the parent organism splits to form many new organisms at the same time. 2. It takes place during favourable environmental conditions. It takes place during unfavourable environmental conditions. 3. It takes place in organisms like Amoeba, Paramecium, etc. It takes place in organisms like Plasmodium."
    },
    {
      "sub-topic": "Benefits of Spore Reproduction",
      "Content": "Q2. How will an organism be benefited if it reproduces through spores? Ans: Spores are tiny, spherical, asexual reproductive bodies which under favourable conditions, like damp and warm conditions, germinate to produce new plants. They are covered by the hard protective wall, which enables the plant to survive unfavourable conditions."
    },
    {
      "sub-topic": "Complex Organisms and Regeneration",
      "Content": "Q3. Can you think of reasons why more complex organisms cannot give rise to new individuals through regeneration? Ans: Multicellular organisms cannot reproduce by cell because they are not simple random collection of cells. In them, specialised cells are organized as tissues and tissues are organised into organs, which then have to be kept at different positions in the body. Cell-by-cell division would be impractical. Multicellular organisms, therefore, require to use more complex ways of reproduction. Moreover, simple multicellular organisms possess special type of tissues which have the potential to grow into a new organism but complex multicellular organisms have no such specialised cells."
    },
    {
      "sub-topic": "Uses of Vegetative Propagation",
      "Content": "Q4. Why is vegetative propagation practised for growing some types of plants? Ans: Vegetative propagation method is used for growing certain plants which do not produce viable seeds. It is also used for growing of plants bearing superior traits, because they produce genetically identical plants. It is also used for growing plants which require longer time to grow and become mature. Plants which require a lot of care during early stages of development are also grown by this method."
    },
    {
      "sub-topic": "Importance of DNA in Reproduction",
      "Content": "Q5. Why is DNA copying an essential part of the process of reproduction? Ans: Chromosome in the nucleus of a cell contain information for inheritance of features from parent to next generation in the form of DNA. The DNA in the cell nucleus is the information source of making proteins. Therefore, a basic event in reproduction is creation of DNA copy for the next generation."
    },
    {
      "sub-topic": "Sexual Reproduction Overview",
      "Content": "SEXUAL REPRODUCTION IN PLANTS Sexual reproduction is the process in which two components (male and female) are involved to produce offsprings of their own kind. A bull alone cannot produce new calves. It needs a cow. Female sheep alone cannot produce new ones. It needs a male sheep. Both the sexes, male and female, are needed to produce new offspring."
    },
    {
      "sub-topic": "Parts of a Flower",
      "Content": "A flower is a modified shoot with a limited growth. Flowers vary in size, shape, structure and colour. The main parts of a flower are, 1. Calyx 2. Corolla 3. Androecium and 4. Gynoecium. Androecium is the male part of a flower, and Gynoecium is the female part. Androecium is a group of stamens. Each Stamen consists of a stalk called the filament and a small bag-like structure called the anther at the tip. The pollen grains are contained in the anther within the pollen sacs. Gynoecium is the female part of the flower and consists of the carpels or ovary. Gynoecium has three parts 1) Stigma 2) Style and 3) Ovary. The ovary contains the ovules and each ovule carries within it an embryo sac, within which lies the egg cell or the female gamete."
    },
    {
      "sub-topic": "Pollination Process",
      "Content": "Pollination is the first and important event in the development of the fruit and seed. Pollination is the transfer of pollen grains from the anther to the stigma. Pollen grains are transferred mainly by wind, water, and insects. They are called pollinating agents."
    },
    {
      "sub-topic": "Types of Pollination",
      "Content": "Pollination is of two types. They are 1. Self pollination 2. Cross pollination. Self pollination is also known as autogamy. The transfer of pollen grains from the anther of a flower to the stigma of the same flower or another flower of the same plant is known as self pollination. Cross pollination or allogamy is the transfer of pollen grains of a flower to the stigma of another flower of a different plant of the same species."
    },
    {
      "sub-topic": "Self Pollination",
      "Content": "Advantages of Self Pollination: 1. Self pollination is certain in bisexual flowers. 2. Flowers need not depend on agents of pollination. 3. There is no wastage of pollen grains. Disadvantages of Self Pollination: 1. The seeds are less in number. 2. Endosperm is minute. Therefore, the seeds produce weak plants. 3. New varieties of plants cannot be produced resulting in the degradation of the plant."
    },
    {
      "sub-topic": "Cross Pollination",
      "Content": "Advantages of Cross Pollination: 1. The seeds produced as a result of cross-pollination develop, germinate properly, and grow into better plants, i.e., cross-pollination leads to the production of new varieties. 2. More viable seeds are produced."
    },
    {
      "sub-topic": "Agents of Cross Pollination",
      "Content": "In order to bring about cross-pollination, it is necessary that the pollen should be carried from one flower to another of a different plant. This takes place through agency of animals, insects, wind, and water. Pollination by birds (Ornithophily), Pollination by insects and animals (Zoophily)."
    },
    {
      "sub-topic": "Anemophily",
      "Content": "Flowers pollinated by air are mostly small in size and without any attractive colour, smell and nectar. They produce a large number of pollen grains to make up for the wastage of pollen in times of transit. Pollen grains are dry and powdery and hence are easily carried by the wind."
    },
    {
      "sub-topic": "Hydrophily",
      "Content": "This pollination takes place in water plants or plants that are adapted to water habitat. The flowers are small and inconspicuous."
    },
    {
      "sub-topic": "Fertilization Process",
      "Content": "Fertilization happens after pollination. A mature pollen consists of two cells. The larger one is the vegetative cell and the smaller one is the generative cell. The vegetative cell starts growing and emerges through the germination pore, developing into a pollen tube. The generative cell divides into two male gametes (sperms). The pollen tube enters into the embryo sac through micropyle. The pollen tube bursts open, gametes are released from the pollen tube and enter the embryo sac. One of the gametes fuses with the egg, and the other fuses with the secondary nucleus. The fusion of a male gamete with the egg is known as fertilization."
    },
    {
      "sub-topic": "Post Fertilization Changes",
      "Content": "The ovule develops into seed. The integuments of the ovule develop into seed coats. The ovary enlarges and develops into fruit."
    },
    {
      "sub-topic": "Reproductive System in Humans",
      "Content": "MALE REPRODUCTIVE SYSTEM: The male reproductive system in human beings is composed of following parts: Testis, Scrotum, Vas Deferens, Seminal Vesicle, and Penis. The testis primarily serves the function of sperm production and also produces testosterone. FEMALE REPRODUCTIVE SYSTEM: The female reproductive system in human beings consists of Uterus, Fallopian Tubes, and Ovaries. The Uterus is where the embryo gets implanted and develops into a newborn baby. Fertilization happens in the Fallopian Tube."
    }
  ]
}