{
  "topic": [
    {
      "sub-topic": "Mendel's Experiments and Laws",
      "Content": "round and yellow seeds; which means that wrinkled texture was the recessive character and so was the green colour of seeds. When plants of F1 generation were allowed to self pollinate; it was observed that most of the plants in F2 generation produced round and yellow seeds. Some plants produces round green seeds, some produced wrinkled yellow seeds and some produced wrinkled green seeds. The ratio was 9 : 3 : 3 : 1; as shown in the below figure."
    },
    {
      "sub-topic": "Mendel's Experiments and Laws",
      "Content": "MENDEL’S SECOND LAW: Law of Independent Assortment: Alleles of different characters separate independent from each other during gamete formation. In the above example; alleles of texture were assorted independently from those of seed colour."
    },
    {
      "sub-topic": "Mendel's Experiments and Laws",
      "Content": "Q1. How do Mendel’s experiments show that traits may be dominant or recessive? Ans: Mendel crossed a pure tall pea plant (TT) with pure dwarf pea plant (tt) and observed that all the progeny were hybrid tall (Tt), i.e., only one of the trait was able to express itself in the F1 generation, which is the dominant trait. The other trait called the recessive trait remain suppressed. However, when he self crossed plants of F1 generation, he observed that one fourth of the plants were dwarf and three fourth were tall."
    },
    {
      "sub-topic": "Mendel's Experiments and Laws",
      "Content": "Q2. How do Mendel’s experiments show that traits are inherited independently? Ans: Please refer the above section DIHYBRID CROSS"
    },
    {
      "sub-topic": "Mendel's Experiments and Laws",
      "Content": "Q3. A man with blood group A marries a woman with blood group O and their daughter has blood group O. Is this information enough to tell you which of the traits – blood group A or O – is dominant? Why or why not? Ans: This shows that blood group ‘O’ is dominant and ‘A’ is recessive because blood group ‘O’ was able to express itself in heterozygous condition, due to which the progeny had blood group ‘O’."
    },
    {
      "sub-topic": "Sex Determination in Humans",
      "Content": "Q4. How is the sex of the child determined in human beings? Ans: Somatic cells in human beings contain 23 pairs of chromosomes. Out of them the 23rd pair is composed of different types of chromosomes which are named as X and Y chromosomes. The 23rd pair contains one X and one Y chromosome in a male. On the other hand, the 23rd pair in a female contains X chromosomes. This means that all the eggs would have X chromosome as the 23rd chromosome, while a sperm may have either X or Y chromosome as the 23rd chromosome. When a sperm with X chromosome fertilizes the egg, the resulting zygote would develop into a female child. When a sperm with Y chromosome fertilizes the egg, the resulting zygote would develop into a male child."
    },
    {
      "sub-topic": "Evolution",
      "Content": "The change in inherited traits in biological population over subsequent generations is called evolution. Scientists have proven that life evolved in the form of simple unicellular organisms on this earth; and all the organisms which are present today have evolved from a common ancestor. The idea of evolution is based on the premise of a common ancestry."
    },
    {
      "sub-topic": "Natural Selection and Adaptation",
      "Content": "Let us consider a group of twelve beetles. They live in bushes on green leaves. Their population will grow by sexual reproduction. So they were able to generate variations in population. Let us assume crows eat these red beetles. If the crows eat more Red beetles their population slowly reduced. Let us think of different situations. Situation -1: In this situation a colour variation arises during reproduction. So that there appears one beetle that is green in colour instead of red. Moreover this green coloured beetle passes it’s colour to it’s offspring (Progeny). So that all its progeny are green. Crows cannot see the green coloured beetles on green leaves of the bushes and therefore crows cannot eat them. But crows can see the red beetles and eat them. As a result there are more and more green beetles than red ones which decrease in their number. The variation of colour in beetle ‘green’ gave a survival advantage to ‘green beetles’ than red beetles. In other words it was naturally selected."
    },
    {
      "sub-topic": "Natural Selection and Adaptation",
      "Content": "Thus the natural selection is directing evolution in the beetle population. It results in adaptation in the beetle population to fit in their environment better."
    },
    {
      "sub-topic": "Natural Selection and Adaptation",
      "Content": "Situation -2: In this situation a colour variation occurs again in its progeny during reproduction, but now it results in ‘Blue’ colour beetles instead of ‘red’ colour beetle. This blue colour beetle can pass its colour to its progeny. So that all its progeny are blue. Crows can see blue coloured beetles on the green leaves of the bushes and the red ones as well. And therefore crows can eat both red and blue coloured beetles. In this case there is no survival advantage for blue coloured beetles as we have seen in case of green coloured beetles. What happens initially in the population, there are a few blue beetles, but most are red. Imagine at this point an elephant comes by and stamps on the bushes where the beetles live. This kills most of the beetles. By chance the few beetles survived are mostly blue."
    },
    {
      "sub-topic": "Genetic Drift",
      "Content": "Thus sometimes accidents may also result in changes in certain characters of the population. Characters as we know are governed by genes. Thus there is change in the frequency of genes in small populations. This is known as 'Genetic drift', which provides diversity in the population."
    },
    {
      "sub-topic": "Acquired vs Inherited Characteristics",
      "Content": "Situation -3: In this case beetles population is increasing, but suddenly bushes were affected by a plant disease in which leaf material were destroyed or in which leaves are affected by this beetles got less food material. So beetles are poorly nourished. So the weight of beetles decrease but no changes take place in their genetic material (DNA). After a few years the plant disease are eliminated. Bushes are healthy with plenty of leaves."
    },
    {
      "sub-topic": "Acquired vs Inherited Characteristics",
      "Content": "ACQUIRED AND INHERITED CHARACTERS AND EVOLUTION The germ cells of sexually reproducing population are formed in specialised reproductive tissue. If the weight of the beetles is reduced because of starvation, that will not change the DNA of the germ cells. Therefore, low weight is not a trait that can be inherited by progeny of a starving beetle. Therefore even if some generations of beetles lose their weight because of starvation, that is not an example of evolution, since the change is not inherited over generations. Change in non reproductive tissues cannot be passed on to the DNA of the germ cells. Therefore the experiences of an individual during its lifetime cannot be passed on to its progeny, and cannot direct evolution."
    },
    {
      "sub-topic": "Darwin's Theory of Evolution",
      "Content": "DARWIN’S THEORY OF EVOLUTION: Charles Darwin wrote his famous book ‘Origin of Species’. He threw new insights on evolution of species. Some salient points of Darwin’s theory are as follows: Organisms have unlimited capacity to reproduce: Organisms can reproduce offspring at a fast pace. This is necessary for survival, because a higher number of offspring ensures that at least some of them could survive."
    },
    {
      "sub-topic": "Darwin's Theory of Evolution",
      "Content": "Natural Selection: Different individuals of a particular species have different traits. Those with more suitable traits are selected by the nature. Each organism needs a particular trait for finding food and finding a mate. Those with better traits are finally able to pass on their traits to the next generation. Survival of the Fittest: Those organisms which are the fittest are able to survive, while others perish. That is how many species become extinct and some species continue to evolve over a period of time."
    },
    {
      "sub-topic": "Origin of Life",
      "Content": "MOLECULAR ORIGIN OF LIFE: Stanley L. Miller and Harold C. Urey, conducted the Miller -Urey experiment in 1953 to demonstrate how the life would have originated on the earth. They created an environment in laboratory which mimicked the environment of earth as it was during the time of origin of life. Water, methane, ammonia and hydrogen were used in that experiment. The liquid was heated to initiate evaporation and electrodes were used to create electric discharge."
    },
    {
      "sub-topic": "Origin of Life",
      "Content": "At the end of two weeks, some organic molecules were formed in the setup. Some amino acids and sugar were also formed. This proved the hypothesis of J. B. S. Haldane that life originated from inorganic raw materials."
    },
    {
      "sub-topic": "Population Dynamics and Genetics",
      "Content": "Q1. What are the different ways in which individuals with a particular trait may increase in a population? Ans: There are different ways in which an individual with a particular trait may increase in a population When a colour variation arise during reproduction, it can pass the colour on to its progeny which may protect them from prey. Accidents in small population can change the frequency of some genes in a population even if they give no survival advantage. Poor nourishment may reduce the population of individuals but when nourishment conditions improve the population starts increasing again. Thus, the maturation, adaptation to environment and natural selection may increase a particular trait in a population."
    },
    {
      "sub-topic": "Population Dynamics and Genetics",
      "Content": "Q2. Why are traits acquired during the life-time of an individual not inherited? Ans: Traits acquired during the life-time of an individual just enable an individual to adapt itself to the surrounding and do not change the genetic make up of the organism. Only those variations are inherited, which come into the germ cell of the organism."
    },
    {
      "sub-topic": "Population Dynamics and Genetics",
      "Content": "Q3. Why are the small numbers of surviving tigers a cause of worry from the point of view of genetics? Ans: Small numbers of surviving tigers are a cause of worry from the point of genetics because their loss would cause a loss of gene pool, i.e., many genes will be eliminated from a gene pool."
    },
    {
      "sub-topic": "Speciation",
      "Content": "The process of origin of a new species is called speciation. A species is a group of organisms in which most of the characters are similar and members of a species are able to breed among themselves. Speciation can happen if two groups of the same species are somehow prevented from interbreeding for several generations. This can happen because of geographical segregation or because of some other factors."
    }
  ]
}