{
  "topic": [
    {
      "sub-topic": "Introduction to Tissues",
      "Content": "The body of plants and animals is made up of different types of cells. These cells originate from a single cell by repeated divisions and get differentiated during development. In unicellular organisms all the body functions are performed by a single cell. But in multicellular organisms, different functions are performed by different groups of cells. The groups of cells having a common origin and performing similar functions are called tissues. Several tissues are organized to form tissue system and the tissue systems form the organs and several organs into organism. Study of tissues is called Histology."
    },
    {
      "sub-topic": "Tissue and Division of Labour",
      "Content": "In complex organisms, different tasks are carried out by different organs and organ systems. Tissues are the first step towards division of labour in complex organisms."
    },
    {
      "sub-topic": "Definition of Tissue",
      "Content": "What is a tissue? Answer: A group of cells that are similar in structure and/or work together to achieve a particular function is called tissue."
    },
    {
      "sub-topic": "Utility of Tissues in Multicellular Organisms",
      "Content": "In multicellular organisms, the body system is based on the division of labour. It means the cells performing a specific function are grouped together to form a particular tissue. The different tissues are organized in a way to provide highest efficiency in functioning of the body."
    },
    {
      "sub-topic": "Plant Tissues",
      "Content": "Plant tissues are of two main types, viz. meristematic tissue and permanent tissue."
    },
    {
      "sub-topic": "Meristematic Tissue",
      "Content": "The growth of plants occurs only in certain specific regions. This is because the dividing tissue also known as meristematic tissue (Meristos – divisible) is located only at these points. The meristematic tissues are made up of group of similar and immature cells, which can divide and form new cells. Meristematic cells divide continuously and thus help in increasing the length and thickness of the plant. Depending upon the position, meristematic tissues are of three types: i) Apical meristems: Apical meristem is present at the growing tips of stems and roots and increases the length of the plant body. They are responsible for growth in length, i.e. primary growth. ii) Intercalary meristems: These meristems occupy base of the leaves and the base of the internodal regions in plants such as grasses (mostly in monocotyledonous plants). These help in elongation of the internodes. iii) Lateral meristems: This includes the meristematic tissues occupying the lateral regions of the stems and roots which bring about increase in the width of the plant body. (e.g. Cork cambium and Vascular cambium)."
    },
    {
      "sub-topic": "Features of Meristematic Tissues",
      "Content": "Characteristic features of Meristematic tissues include: The meristematic cells may be round, oval, polygonal or rectangular in shape. Their cell walls are thin, elastic and made up of cellulose. They are closely arranged without intercellular spaces. They have dense cytoplasm with large nucleus."
    },
    {
      "sub-topic": "Permanent Tissue",
      "Content": "Once the cells of meristematic tissue divide to a certain extent, they become specialized for a particular function. This process is called differentiation. Once differentiation is accomplished, the cells lose their capability to divide and the tissue becomes permanent tissue. Some cells produced by meristematic tissues stop dividing and form a permanent tissue. They have definite structure and function. They are differentiated into various types to perform different functions."
    },
    {
      "sub-topic": "Simple Tissues",
      "Content": "A tissue with the cells of similar structure (one type of cells) and function is called simple tissue. It is of three types. 1. Parenchyma 2. Collenchyma 3. Sclerenchyma"
    },
    {
      "sub-topic": "Parenchyma",
      "Content": "The cells of parenchyma have thin cell wall. They are loosely packed; with lot of intercellular spaces between them. They are living cells. They are generally present in all organs of a plant. They are oval or spherical or rectangular or cylindrical in shape. The cell wall is made of cellulose and pectic materials. Parenchyma makes the largest portion of a plant body. Parenchyma mainly works as packing material in plant parts. The main function of parenchyma is to provide support and to store food. In some plant parts, parenchyma has chlorophyll as well. In that case, parenchyma carries out photosynthesis and is then termed as chlorenchyma. In aquatic plants, large air cavities are present in parenchyma. This provides buoyancy to the plant, and then the parenchyma is known as aerenchyma."
    },
    {
      "sub-topic": "Collenchyma",
      "Content": "The cells of collenchyma are polygonal in cross section and have unevenly thickened walls. These thickenings are due to the deposition of more cellulose, hemicellulose and pectin. The thickening is confined to the corners of the cells. They generally occur in the dicot stem in two or more layers below the epidermis. It is absent in the roots. It also occurs in petiole and pedicel. Like Parenchyma, Collenchyma is also a living tissue. The main function of Collenchyma is to provide strength and flexibility to the growing organs like young stem."
    },
    {
      "sub-topic": "Sclerenchyma",
      "Content": "Sclerenchyma is a dead tissue. The cells are thick with lignified walls. They give mechanical support to the organs. This has two types of cells – Sclereids and Fibres."
    },
    {
      "sub-topic": "Complex Permanent Tissues: Xylem",
      "Content": "Xylem is mainly concerned with the transport of nutrients, water and minerals upwards in the plant body. It forms a continuous tube through the roots, stems, leaves, flowers and fruits by the fusion of elongated cells. It is composed of different kinds of cells namely, 1. Tracheids 2. Xylem vessels. 3. Xylem fibres 4. Xylem parenchyma."
    },
    {
      "sub-topic": "Tracheids",
      "Content": "Tracheids are elongated, tapering cells with blunt ends. They have lignified secondary wall. They are the chief water conducting elements in Pteridophytes and Gymnosperms."
    },
    {
      "sub-topic": "Xylem Vessels",
      "Content": "Xylem vessels have perforations at the end and are placed one above the other like a long pipe line. They are seen in the xylem of angiosperms. They conduct water, mineral nutrients and also provide mechanical strength to the plant body."
    },
    {
      "sub-topic": "Xylem Fibres",
      "Content": "The fibres of sclerenchyma associated with the xylem are known as xylem fibres. They give additional mechanical strength to the plant. They are also called wood fibres."
    },
    {
      "sub-topic": "Xylem Parenchyma",
      "Content": "The parenchyma cells associated with xylem are known as xylem parenchyma. It is the only living tissue amongst xylem cells. They store food reserves in the form of starch and fat. They also help in conduction of water."
    },
    {
      "sub-topic": "Phloem",
      "Content": "Phloem conducts food materials from leaves to the other parts of the plant. It is made up of four types of cells. 1. Sieve elements 2. Companion cells 3. Phloem fibres 4. Phloem parenchyma."
    },
    {
      "sub-topic": "Sieve Elements",
      "Content": "Sieve elements are the conducting elements of the phloem. Sieve elements are of two types – sieve cells and sieve tubes. Sieve cells are present in Pteridophytes and Gymnosperms whereas sieve tubes are present in Angiosperms."
    },
    {
      "sub-topic": "Companion Cells",
      "Content": "Companion cells are thin walled elongated specialized Parenchyma cells. They are associated with sieve elements. They have a prominent nucleus and cytoplasm. They help the sieve tube in conduction of food materials in angiosperms."
    },
    {
      "sub-topic": "Phloem Fibres",
      "Content": "The fibres of sclerenchyma associated with phloem are called phloem fibres. They are also called bast-fibres. They give mechanical support to the plant. Among the four types of phloem cells, phloem fibres are the only dead tissues."
    },
    {
      "sub-topic": "Phloem Parenchyma",
      "Content": "The parenchyma cells associated with phloem are called phloem parenchyma. They store starch and fats."
    },
    {
      "sub-topic": "Animal Tissues",
      "Content": "Animal tissues are of four types, viz. epithelial tissue, connective tissue, muscular tissue and nervous tissue."
    },
    {
      "sub-topic": "Epithelial Tissue",
      "Content": "The epithelial tissue forms the covering or lining of most of the organs. The cells of epithelial tissue are tightly packed and form a continuous sheet. There is small amount of cementing materials between the cells and no intercellular space is present. Permeability of the epithelial tissue plays a great role in exchange of materials among various organs; it also plays an important role in osmoregulation. All epithelial tissues are separated by the underlying tissue by an extracellular fibrous basement membrane. Epithelial tissues are of the following types: 1. Simple Epithelium 2. Cuboidal Epithelium 3. Columnar Epithelium 4. Stratified Epithelium."
    },
    {
      "sub-topic": "Simple Epithelium",
      "Content": "The simple epithelium is composed of a single layer of cells. This type of epithelial tissue forms the lining of blood vessels and alveoli. Thin layer of cells facilitates exchange of substances; in such cases."
    },
    {
      "sub-topic": "Cuboidal Epithelium",
      "Content": "The cells are cube-shaped in cuboidal epithelium. Linings of kidney tubules and ducts of salivary glands are composed of cuboidal epithelium. Cuboidal cells provide mechanical support. Cells of epithelium may play the role of secretion and then they are called glandular epithelium."
    },
    {
      "sub-topic": "Columnar Epithelium",
      "Content": "Cells are column-shaped in columnar epithelium. Columnar epithelium facilitates secretion and absorption. For example; the lining of intestine is composed of columnar epithelium. In some organs, columnar epithelium has cilia present on the outer surface. Cilia facilitate movements of certain substances. The ciliated epithelium in the respiratory tract pushes the mucus forward."
    },
    {
      "sub-topic": "Stratified Epithelium",
      "Content": "Cells of the stratified epithelium are in many layers. Skin is an example of stratified epithelium. Stratification of layers prevents wear and tear."
    },
    {
      "sub-topic": "Connective Tissue",
      "Content": "The cells of a connective tissue are loosely scattered in a matrix. The matrix can be a fluid, jelly-like, dense or rigid. The nature of matrix depends on the function a connective tissue serves. Following are the various connective tissues: Areolar (Loose) Connective Tissue, Dense connective tissue (Fibrous connective tissue), Adipose Tissue, Bone, Cartilage, Blood."
    },
    {
      "sub-topic": "Areolar (Loose) Connective Tissue",
      "Content": "Areolar tissue is found between skin and muscles, around blood vessels and nerves and in bone marrow. Areolar tissue fills the gap between tissues and provides support. It also helps in the repair of tissues."
    },
    {
      "sub-topic": "Dense Connective Tissue (Fibrous Connective Tissue) ",
      "Content": "It has thicker, denser fibers and fewer cells. The matrix is made up mostly of collagen fibers, with fibroblasts arranged in rows. This type of connective tissue forms tendons and ligaments, which attach muscle to bone and bone to bone, respectively."
    },
    {
      "sub-topic": "Adipose Tissue",
      "Content": "Adipose tissue is composed of fat globules. This tissue is found below the skin and beneath the organs. Adipose tissue provides insulation and works as a cushion."
    },
    {
      "sub-topic": "Bone",
      "Content": "Bone is mainly composed of osteoblasts. Bone makes the skeletal system. Skeletal system is responsible for providing structural framework to the body. It provides protection to important organs and facilitates movements."
    },
    {
      "sub-topic": "Cartilage",
      "Content": "Cartilage is mainly composed of chondrioblasts. Cartilage is present at the ends of articulatory bones. Cartilage is also present in the external ear, bronchii, etc."
    },
    {
      "sub-topic": "Blood",
      "Content": "Blood is composed of blood cells, platelets and plasma. Blood plays an important role in the transportation of various substances in the body. It also helps in osmoregulation and temperature control."
    },
    {
      "sub-topic": "Muscular Tissue",
      "Content": "Muscular tissue is composed of muscle cells. Muscle cells are specialized cells which have the capability to contract and expand. Due to contraction and expansion, muscles facilitate various kinds of movements in the body. Muscular tissues are of three types: Striated Muscles, Smooth Muscles."
    },
    {
      "sub-topic": "Striated Muscles",
      "Content": "The cells of striated muscles are in the form of long, unbranched fibres. Cells are multinucleate. Light and dark bands (striations) are present on muscle fibres; which gives the name striated muscles. Striated muscles are found in those organs where voluntary movement is possible, e.g. hands, legs, back, neck, etc."
    },
    {
      "sub-topic": "Smooth Muscles",
      "Content": "The cells of smooth muscles are spindle-shaped and each has one nucleus. Smooth muscle is found in those organs where involuntary movement is possible, e.g. alimentary canal."
    }
  ]
}