{
  "topic": [
    {
      "sub-topic": "Decomposers and the Cycle of Life",
      "Content": "decomposed by decomposers, like bacteria. These decompose the body into basic elements out of which it was originally made. That is how the everlasting cycle of life goes on."
    },
    {
      "sub-topic": "Ozone Layer",
      "Content": "The ozone layer is a layer in earth’s atmosphere which contains relatively high concentrations of ozone. This layer absorbs 93 -99% of the sun’s high frequency ultraviolet light, which is potentia lly damaging to life on earth. Over 91% of the ozone in Earth's atmosphere is present here. It is mainly located in the lower portion of the stratosphere from approximately 10 km to 50 km above Earth's surface, though the thickness varies seasonally and ge ographically. Because of heavy use of CFCs (Chlorofuorocarbons) in refrigerators and pressurized cans by human the ozone layer has broken at some places. This has caused an alarming rise in ultraviolet radiation leading to increased cases of skin cancers."
    },
    {
      "sub-topic": "Oxygen Cycle",
      "Content": "OXYGEN CYCLE The oxygen in the atmosphere is freed by the process of photolysis. The energy in the sunlight breaks the oxygen bearing oxygen to produce free oxygen. Oxygen molecule is broken down by UV rays from the sun. Thi s cycle shields earth from harmful UV rays. In the biosphere, oxygen undergoes cycles of respiration and photosynthesis. Humans and animals breathe in oxygen. This oxygen is used in metabolic processes and carbon dioxide given out. Plants and phytoplankto ns undergo process of photosynthesis where carbon dioxide is used in the prescence of sunlight to form carbohydrates and oxygen. In the lithosphere, oxygen is fixed in minerals like silicates and oxides. Oxygen from these minerals is freed by chemical wea thering. When the mineral bearing oxygen is exposed to chemical reaction, the mineral wears down free oxygen is produced."
    },
    {
      "sub-topic": "Differences in Atmospheres",
      "Content": "The atmosphere of Earth contains a mixture of many gases like nitrogen (78.08%), oxygen (20.95%), carbon dioxide (0.03%) and water vapour (in varying proportion). On the other hand, the atmosphere on Venus and Mars mainly contains carbon dioxide, i.e., about 95 - 97%. It may be the reason that due to this, no life is known to exist in both Venus and Mars."
    }
  ]
}