{
  "topic": [
    {
      "sub-topic": "Female Reproductive System",
      "Content": "Ovary produces the eggs or the female gametes. All the eggs are produced by the ovary when the female child is still in the womb. One egg matures in each ovulation cycle and is released from the ovary. The egg is caught by the fimbriae and transferred to the fallopian tube."
    },
    {
      "sub-topic": "Vagina",
      "Content": "The cervix (mouth of the uterus) opens into the vagina. Vagina is a muscular tube-like organ which serves as the passage for the sperms and also as the canal during childbirth."
    },
    {
      "sub-topic": "Puberty",
      "Content": "Human beings are complex animals and hence there is a distinct phase in their life cycle which marks the onset and attainment of sexual maturity. This period is called puberty. It usually starts at around 10 – 11 years of age in girls and at around 12 – 13 years of age in boys. It usually ends at around 18th year of age in girls and at around 19th year of age in boys. Since the years during puberty end in ‘teens’; hence this phase is also called teenage."
    },
    {
      "sub-topic": "Changes in Boys during Puberty",
      "Content": "The boys suddenly grow in height dramatically. Voice becomes deep and the Adam’s apple becomes prominent. Shoulders become broad and body becomes muscular. Facial hairs begin to grow. Hairs also grow under the armpit and in the pubic region."
    },
    {
      "sub-topic": "Changes in Girls during Puberty",
      "Content": "The voice becomes thin. Shoulders and hips become rounded. Breasts get enlarged. Hairs grow under the armpit and in the pubic region."
    },
    {
      "sub-topic": "Sexual Dimorphism and Secondary Sexual Characters",
      "Content": "The physical dissimilarities in the male and female of a species which give them different appearances is called sexual dimorphism. Features which highlight sexual dimorphism are called secondary sexual characters."
    },
    {
      "sub-topic": "Menstruation",
      "Content": "Menstruation is a trait which is unique to humans and some primates. During each ovulation cycle, the uterus prepares itself in anticipation of a possible pregnancy. The uterine wall develops an additional lining. When the egg is not fertilized, it gets disintegrated and so does the additional lining in the uterine wall. The fragments of disintegrated tissues are shed; along with blood. This is observed in the form of bleeding through the vagina which can last from 3 to 7 days. The whole sequence of events during an ovulation cycle is called menstrual cycle. The bleeding which occurs for few days is called menstruation. The first menstrual flow is called menarche and the last menstrual flow (which happens in the late 40s) is called menopause."
    },
    {
      "sub-topic": "Reproductive Health",
      "Content": "Human beings are different than other animals because they have the power of thinking. They have to obey certain moral values and need to behave sensibly in most of the aspects of life. Beginning of puberty does not mean that a person is psychologically ready for the process of reproduction. For a human being, reproduction involves more than just producing an offspring. As any act of sex has the potential of fertilization, so taking care of contraception becomes important. Moreover, the act of sex also has the potential of creating many sexually transmitted diseases. Examples of STDs are; gonorrhea, Herpes, syphilis, AIDS, Hepatitis B. AIDS and Hepatitis B are incurable till date. Even the curable STDs are potentially dangerous; not only physically but also psychologically. Reproductive health involves preventing the chances of STDs and preventing unwanted children. Reproductive health means a couple should be able to enjoy the reproductive phase of its life without taking the burden of gigantic family."
    },
    {
      "sub-topic": "Pollination vs Fertilization",
      "Content": "The transfer of pollen grains from anther to the stigma of a flower is called pollination. The fusion of male and female gametes to form a zygote is called fertilisation. It involves only the male gamete (pollen grain). It involves both male and female gametes."
    },
    {
      "sub-topic": "Role of Seminal Vesicles and Prostate Gland",
      "Content": "Secretions from seminal vesicles and prostate gland provide nutrition to the sperms and make their transport easier by providing them a fluid medium."
    },
    {
      "sub-topic": "Changes in Girls during Puberty (Detailed)",
      "Content": "Changes seen in girls at the time of puberty are as follows: (i) Growth of hair in armpits and public region. (ii) Mammary glands (breast) develop and hips broaden. (iii) Uterus, vagina, Fallopian tube enlarge and pelvis widens. Menstruation and ovulation also starts."
    },
    {
      "sub-topic": "Embryonic Nourishment",
      "Content": "The embryo gets nutrition from the mother's blood with the help of special tissue called placenta. This is a disc-like tissue which develops between the uterine wall and embryo. It has villi on the embryo side of the tissue. On the mother's side are blood spaces which the villi. This gives a large surface area for oxygen and glucose to pass from the mother to the embryo."
    },
    {
      "sub-topic": "Contraceptive Methods and STDs",
      "Content": "If a woman is using a copper-T, it will not help in protecting her from sexually transmitted diseases."
    },
    {
      "sub-topic": "Heredity",
      "Content": "The progeny produced through the reproductive process is similar to its parents, in body design, function etc. The rules of heredity determine the process by which the traits and the characteristics are relatively inherited. The inheritance of characteristics through generations is called heredity. The inheritable characteristics may be morphological/anatomical/physiological/reproductive and are also known as traits."
    },
    {
      "sub-topic": "Variation and Inheritance",
      "Content": "By virtue of being the progeny of the parent, the progeny individual, need not just be the replica of what its parents are. Inheritance of characters from the parents to the progeny (i.e., Heredity) ensures the passing of the parental characters to the progeny. The difference or change in the characteristics between the individuals is called Variation. Human population shows a great deal of variation. Inheritance from the previous generation provides both a common basic body design, and subtle changes in it, for the next generation."
    },
    {
      "sub-topic": "Mendel’s Contributions",
      "Content": "Gregor Johann Mendel (1822 -1884) worked out the first ever scientific experimental study on heredity. Mendel, an Austrian Augustinian monk observed variations in the characteristics of the garden pea plant (Pisum sativum) which he had cultivated in his monastery garden. Mendel was curious to find out the results of crossing of pea plants with the variation in traits. The visible contrasting characters that Mendel observed in the garden pea plants were given below: Seed shape - Round/Wrinkled Seed colour - Yellow/Green Flower colour - Violet / White Pod shape - Full / Constricted Pod colour - Green / Yellow Flower position - Axillary / Terminal Stem height - Tall / Dwarf."
    },
    {
      "sub-topic": "Mendel’s Monohybrid Cross",
      "Content": "Mendel selected the garden pea plant, Pisum sativum for his experiments. He selected tall and dwarf plants and allowed them to grow naturally. As pea plants produce seeds only by self-pollination, he observed that tall plants produced always tall plants generation after generation under natural conditions. Similarly, dwarf plants produced always dwarf plants generation after generation. Hence, he termed the tall and dwarf plants as wild types or pure breeding varieties. Then he crossed a tall plant with a dwarf plant, produced progeny and calculated the percentage of tallness and dwarfness in subsequent generations. When a pure breeding tall plant was crossed with a pure breeding dwarf plant, all plants were tall in the first filial generation (F1) i.e., there was not any medium height plants or dwarf plants. This means that only one of the parental traits were seen and not the mixture of the two. When such an F1 tall plant was allowed to have self-pollination, both the tall and dwarf plants appeared in the second filial generation (F2) in the ratio of 3:1. This indicates that both tallness and dwarfness were inherited in the F1 plants but only tallness trait was expressed. The first experiment of Mendel considering the inheritance of a single trait (Height of the plant Tall/Dwarf) is called Monohybrid Cross."
    },
    {
      "sub-topic": "Genotype and Phenotype",
      "Content": "Expression of morphological characters as tall or dwarf plant, violet or white flowers is called Phenotype. The expression of gene (or Chromosomal makeup) of an individual for a particular trait is called Genotype."
    },
    {
      "sub-topic": "Points to Remember on Heredity",
      "Content": "The passing of traits from the parents to offspring is called heredity. The complete set of genes in an organism’s genome is called genotype. The observable characters in an organism make the phenotype. Phenotype is a result of genotype’s interaction with the environment. Due to this reason, many phenotypes are not inheritable. Acquired Traits: Traits; which are acquired due to interaction with the environment; are called acquired traits. Acquired traits are not inheritable. Inheritable Traits: Traits; which can be expressed in subsequent generations; are called inheritable traits. Such traits bring a change in the genotype of the organism and hence become inheritable."
    },
    {
      "sub-topic": "Mendel's First Law",
      "Content": "Every individual possesses a pair of alleles for a particular trait. During gamete formation, a gamete receives only one trait from the alleles. A particular trait can be dominant or recessive in a particular generation."
    },
    {
      "sub-topic": "Mendel’s Dihybrid Cross",
      "Content": "The cross in which two pairs of characters are studied is called dihybrid cross. In his second experiment, Mendel used dihybrid cross. Let us take the example between plants with round and green seeds and those with wrinkled and yellow seeds. The genotype of round and green seeds is shown by RRyy and that of wrinkled and yellow seeds is shown by rrYY. In the F1 generation, all plants produced..."
    }
  ]
}