{
  "topic": [
    {
      "sub-topic": "Life Processes",
      "Content": "The maintenance of living organisms must go on even at the conditions, when they are not physically active. Even when we sit idle and during sleeping, this maintenance job through cells functioning has to go on. The life process includes the activities performed by the different organs to maintain the body. Some of the life processes in the living beings are described below:"
    },
    {
      "sub-topic": "Nutrition",
      "Content": "The process of obtaining energy through consumption of food is called as nutrition."
    },
    {
      "sub-topic": "Respiration",
      "Content": "The process of acquiring oxygen through breathing and make it available to cells for the process of breaking down of organic substances into simpler compounds is called as respiration."
    },
    {
      "sub-topic": "Transportation",
      "Content": "Transportation is the process by which the food and oxygen is carried from one organ to other organs in the body."
    },
    {
      "sub-topic": "Excretion",
      "Content": "It is the process by which the metabolic waste by-products are removed from the different organs and released out from the body."
    },
    {
      "sub-topic": "Diffusion and Oxygen Requirements",
      "Content": "Multicellular organisms such as humans possess complex body designs. They have specialised cells and tissues for performing various necessary functions of the body such as intake of food and oxygen."
    },
    {
      "sub-topic": "Essential Life Processes",
      "Content": "Life processes such as nutrition, respiration, transportation, excretion, etc. are essential for maintaining life."
    },
    {
      "sub-topic": "Need of Nutrition",
      "Content": "Organisms need energy to perform various activities. The energy is supplied by the nutrients. Organisms need various raw materials for growth and repair. These raw materials are provided by nutrients."
    },
    {
      "sub-topic": "Nutrients",
      "Content": "Materials which provide nutrition to organisms are called nutrients. Carbohydrates, proteins and fats are the main nutrients and are called macronutrients. Minerals and vitamins are required in small amounts and hence are called micronutrients."
    },
    {
      "sub-topic": "Types of Nutrition",
      "Content": "The mode of nutrition in which an organism prepares its own food is called autotrophic nutrition. Green plants and blue-green algae follow the autotrophic mode of nutrition."
    },
    {
      "sub-topic": "Heterotrophic Nutrition",
      "Content": "Heterotrophic nutrition is typical of animals. These organisms eat organic matter in other organisms —either alive (as hunters) or dead (as scavengers). Saprotrophic organisms are the decay organisms. They digest dead materials using enzymes that they secrete externally."
    },
    {
      "sub-topic": "Photosynthesis",
      "Content": "The process by which green plants prepare food is called photosynthesis. During this process; the solar energy is converted into chemical energy and carbohydrates are formed. Green leaves are the main sites of photosynthesis."
    },
    {
      "sub-topic": "Steps of Photosynthesis",
      "Content": "Sunlight activates chlorophyll; which leads to splitting of water molecule. The hydrogen; released by splitting of water molecule is utilized for reduction of carbon dioxide to produce carbohydrates. Oxygen is the byproduct of photosynthesis. Carbohydrate is subsequently converted into starch and is stored in leaves and other storage parts."
    },
    {
      "sub-topic": "Significance of Photosynthesis",
      "Content": "Photosynthesis is the main way through which the solar energy is made available for different living beings. Green plants are the main producers of food in the ecosystem. All other organisms directly or indirectly depend on green plants for food. The process of photosynthesis also helps in maintaining the balance of carbon dioxide and oxygen in the air."
    },
    {
      "sub-topic": "Saprophytic Nutrition",
      "Content": "In saprophytic nutrition, the digestion of food takes place before ingestion of food. This type of nutrition is usually seen in fungi and some other microorganisms. The organism secretes digestive enzymes on the food and then ingests the simple substances."
    },
    {
      "sub-topic": "Holozoic Nutrition",
      "Content": "In holozoic nutrition, the digestion of food follows after the ingestion of food. Thus, digestion takes place inside the body of the organism. Holozoic nutrition happens in five steps, viz. ingestion, digestion, absorption, assimilation and egestion."
    },
    {
      "sub-topic": "Nutrition in Amoeba",
      "Content": "The cell membrane of amoeba keeps on protruding into pseudopodia. Amoeba surrounds a food particle with pseudopodia and makes a food vacuole. The food vacuole contains the food particle and water. Digestive enzymes are secreted in the food vacuole and digestion takes place. After that, digested food is absorbed from the food vacuole. Finally, the food vacuole moves near the cell membrane and undigested food is expelled out."
    },
    {
      "sub-topic": "Nutrition in Human Beings",
      "Content": "The human digestive system is composed of an alimentary canal and some accessory glands. The alimentary canal is divided into several parts, viz. oesophagus, stomach, small intestine, large intestine, rectum and anus. Salivary gland, liver and pancreas are the accessory glands which lie outside the alimentary canal."
    },
    {
      "sub-topic": "Structure of the Human Digestive System",
      "Content": "The mouth has teeth and tongue. Salivary glands are also present in the mouth. The tongue has gustatory receptors which perceive the sense of taste. Tongue helps in turning over the food, so that saliva can be properly mixed in it."
    },
    {
      "sub-topic": "Stomach",
      "Content": "Stomach is a bag-like organ. Highly muscular walls of the stomach help in churning the food. The walls of stomach secrete hydrochloric acid. Hydrochloric acid kills the germs which may be present in food."
    },
    {
      "sub-topic": "Small Intestine",
      "Content": "The small intestine is a highly coiled tube-like structure. The small intestine is longer than the large intestine but its lumen is smaller than that of the large intestine. The small intestine is divided into three parts, viz. duodenum, jejunum and ileum."
    },
    {
      "sub-topic": "Liver and Pancreas",
      "Content": "Liver is the largest organ in the human body. Liver manufactures bile; which gets stored in gall bladder. Pancreas is situated below the stomach. It secretes pancreatic juice which contains many digestive enzymes."
    },
    {
      "sub-topic": "Digestion and Absorption",
      "Content": "The major part of digestion takes place in the duodenum. No digestion takes place in jejunum. The inner wall in the ileum is projected into numerous finger-like structures; called villi. Villi increase the surface area inside the ileum so that optimum absorption can take place."
    },
    {
      "sub-topic": "Large Intestine",
      "Content": "Large intestine is smaller than small intestine. Undigested food goes into the large intestine. Some water and salt are absorbed by the walls of the large intestine. After that, the undigested food goes to the rectum; from where it is expelled out through the anus."
    }
  ]
}