{
  "topic": [
    {
      "sub-topic": "Human Excretory System",
      "Content": "The human excretory system is composed of a pair of kidneys. A tube; called ureter; comes out of each kidney and goes to the urinary bladder. Urine is collected in the urinary bladder, from where it is expelled out through urethra as and when required. Kidney: Kidney is a bean-shaped organ which lies near the vertebral column in the abdominal cavity. The kidney is composed of many filtering units; called nephrons. Nephron is called the functional unit of kidney. Nephron: It is composed of a tangled mess of tubes and a filtering part; called glomerulus. Glomerulus is a network of blood capillaries to which renal artery is attached. The artery which takes blood to the glomerulus is called afferent arteriole and the one receiving blood from the glomerulus is called efferent arteriole. Glomerulus is enclosed in a capsule like portion; called Bowman’s capsule. The Bowman’s capsule extends into a fine tube which is highly coiled. Tubes from various nephrons converge into collecting duct; which finally goes to the ureter. Filtration in Glomerulus: Filtration happens because of very high pressure inside the glomerulus. The lumen of efferent arteriole is smaller than that of afferent arteriole. Due to this, the blood entering the glomerulus experiences very high pressure and due to this, the waste products are filtered out through the thin membrane of capillaries in the glomerulus. The filtered blood is sent to the systemic circulation through efferent arteriole and the filtrate goes to the Bowman’s capsule. That is how urine is formed inside the kidneys. Reabsorption of water and some other filtrates takes place in the tubular part of the nephron. This increases the concentration of urine. The human urine is mainly composed of water and urea. \n\nAnswer : Nephrons are the basic filtering units of kidneys. Each kidney possesses large number of nephrons, approximately 1 -1.5 million. The main components of the nephron are glomerulus, Bowman’s capsule, and a long renal tubule. Functioning of a nephron: The blood enters the kidney through the renal artery, which branches into many capillaries associated with glomerulus. The water and solute are transferred to the nephron at Bowman’s capsule. In the proximal tubule, some substances such as amino acids, glucose, and salts are selectively reabsorbed and unwanted molecules are added in the urine. The filtrate then moves down into the loop of Henle, where more water is absorbed. From here, the filtrate moves upwards into the distal tubule and finally to the collecting duct. Collecting duct collects urine from many nephrons. The urine formed in each kidney enters a long tube called ureter. From ureter, it gets transported to the urinary bladder and then into the urethra."
    },
    {
      "sub-topic": "Excretion",
      "Content": "Removal of harmful waste from the body is called excretion. Many wastes are produced during various metabolic activities. These need to be removed in time because their accumulation in the body can be harmful and even lethal for an organism."
    },
    {
      "sub-topic": "Transport in Plants",
      "Content": "In highly organised plants, there are two different types of conducting tissues − xylem and phloem. Xylem conducts water and minerals obtained from the soil (via roots) to the rest of the plant. Phloem transports food materials from the leaves to different parts of the plant body. Plants have specialized vascular tissues for transportation of substances. There are two types of vascular tissues in plants, viz. xylem and phloem. \n\nXylem: Xylem is responsible for transportation of water and minerals. It is composed of trachieds, xylem vessels, xylem parenchyma and xylem fibre. Trachieds and xylem vessels are the conducting elements. The xylem makes a continuous tube in plants which runs from roots to stem and right up to the veins of leaves. \n\nPhloem: Phloem is responsible for transportation of food. Phloem is composed of sieve tubes, companion cells, phloem parenchyma and bast fibres. Sieve tubes are the conducting elements in phloem."
    },
    {
      "sub-topic": "Ascent of Sap",
      "Content": "The upward movement of water and minerals from roots to different plant parts is called ascent of sap. Many factors are at play in ascent of sap and it takes place in many steps. They are explained as follows: \nRoot Pressure: The walls of cells of root hairs are very thin. Water from soil enters the root hairs because of osmosis. Root pressure is responsible for movement of water up to the base of the stem. \nCapillary Action: A very fine tube is called capillary. Water or any liquid rises in the capillary because of physical forces and this phenomenon is called capillary action. Water in stem rises up to some height because of capillary action. \nAdhesion-cohesion of Water Molecules: Water molecules make a continuous column in the xylem because of forces of adhesion and cohesion among the molecules. \nTranspiration Pull: Loss of water vapour through stomata and lenticels; in plants; is called transpiration. Transpiration through stomata creates vacuum which creates a suction, called transpiration pull. The transpiration pull sucks the water column from the xylem tubes and thus water is able to rise to great heights in even the tallest plants."
    },
    {
      "sub-topic": "Excretion in Plants",
      "Content": "Plants have no special organs for removal of wastes. The waste products of respiration and photosynthesis are used as raw materials for each other. Oxygen gas produced as a by-product of photosynthesis is used up during respiration and carbon dioxide produced during respiration is used up during photosynthesis. Excretion is carried out in the plants in the following ways: The gaseous wastes, oxygen, carbon dioxide and water vapour are removed through stomata of leaves and lenticels of stems. Some waste products collect in the leaves and bark of trees. When the leaves and bark are shed, the wastes are eliminated. Some waste products are rendered harmless and then stored in the plant body as solid bodies. Raphides, tannins, resins, gum, rubber and essential oils are some such wastes."
    },
    {
      "sub-topic": "Circulation of Blood",
      "Content": "Double Circulation: In the human heart, blood passes through the heart twice in one cardiac cycle. This type of circulation is called double circulation. One complete heart beat in which all the chambers of the heart contract and relax once is called cardiac cycle. The heart beats about 72 times per minute in a normal adult. In one cardiac cycle, the heart pumps out 70 mL blood and thus about 4900 mL blood in a minute. Double circulation ensures complete segregation of oxygenated and deoxygenated blood which is necessary for optimum energy production in warm-blooded animals. \n\nCirculation of Blood through the heart: Systemic Vein → Sinus Venosus → Right Auricle → Right Ventricle → Pulmonary Artery → Lungs → Pulmonary Vein → Left Auricle → Left Ventricle → Trunchus Arteriosus → Systemic Circulation"
    },
    {
      "sub-topic": "Transport System in Humans",
      "Content": "The main components of the transport system in human beings are the heart, blood, and blood vessels. Heart pumps oxygenated blood throughout the body. It receives deoxygenated blood from the various body parts and sends this impure blood to the lungs for oxygenation. Being a fluid connective tissue, blood helps in the transport of oxygen, nutrients, CO2, and nitrogenous wastes. The blood vessels (arteries, veins, and capillaries) carry blood either away from the heart to various organs or from various organs back to the heart."
    }
  ]
}