{
  "topic": [
    {
      "sub-topic": "Crop Protection",
      "Content": "Preventive measures include proper soil and seed preparation, timely sowing of seeds, intercropping and mixed cropping, usage of resistant varieties of crops, etc."
    },
    {
      "sub-topic": "Biological Control Methods",
      "Content": "On the other hand, biological control methods include the usage of bio-pesticides that are less toxic for the environment. An example of bio-pesticides is Bacillus thuringenesis, which is an insect pathogen that kills a wide range of insect larvae. Therefore, both preventive measures and biological control methods are considered eco-friendly methods of crop protection."
    },
    {
      "sub-topic": "Factors Responsible for Losses in Grain Storage",
      "Content": "During the storage of grains, various biotic factors such as insects, rodents, mites, fungi, bacteria, etc. and various abiotic factors such as inappropriate moisture, temperature, lack of sunlight, flood, etc. are responsible for losses of grains. These factors act on stored grains and result in degradation, poor germinability, discolouration, etc."
    },
    {
      "sub-topic": "Animal Husbandry",
      "Content": "The branch of agriculture which deals with the feeding, shelter, health and breeding of domestic animals such as cattle, pigs, horses and fowls is called animal husbandry. The various elements of animal husbandry are: 1. Proper feeding of animals. 2. Provision for clean drinking water for animals. 3. Proper shelter for animals. 4. Prevention and cure of animal diseases. 5. Proper breeding of animals."
    },
    {
      "sub-topic": "Advantages of Animal Husbandry",
      "Content": "As animal husbandry is scientific management of farm animals, it serves many uses for human beings. It helps in enhancing milk production, increases egg production, increases meat production, increases fish production, and helps in proper management of agricultural wastes."
    },
    {
      "sub-topic": "Cattle Farming",
      "Content": "Cattle farming is the practice of rearing cattle by providing facilities for raising livestock. Livestock includes domestication of cows, buffaloes, sheep, goats, pigs etc. A cattle farming is carried out to raise cows and buffaloes as important livestock. The two major species of Indian cattle are Bosindicus, or cows, and Bosbubalis, or buffaloes."
    },
    {
      "sub-topic": "Classification of Cattle",
      "Content": "On basis of their utility, cattle are classified into two types namely milch animals and draught animals. Milch animals or dairy animals produce milk. Males of this type are not useful for working on farm. Draught animals are used for carrying out agricultural work like tilling, irrigation and carting. Cows belonging to this category are poor milk-yielding varieties."
    },
    {
      "sub-topic": "Management Practices for Cattle Farming",
      "Content": "Management practices for cattle include cleaning, sheltering and feeding. a) Cleaning involves periodic washing to get rid of dirt and loose hair. b) Shelter facilities include well ventilated roof sheds which protect cattle from rain, cold and sun. c) Feeding of cattle includes supply of uncontaminated and balanced diet. Animal feed are of two types namely roughage feed and concentrate feed."
    },
    {
      "sub-topic": "Disease Prevention in Cattle",
      "Content": "Cattle should be protected from diseases. Diseases in cattle are caused by both external and internal parasites. External parasites live on the skin and cause skin diseases. Internal parasites affect the stomach and intestinal parts. Certain preventive measures of diseases in animals are listed: Proper disposal of dead animals and animal wastes. Shelters should be clean, dry and well ventilated. Periodic visit of veterinary physician to check the animals. Hygienic management of animals and animal products."
    },
    {
      "sub-topic": "Infectious Diseases in Cattle",
      "Content": "Infectious diseases are caused by pathogens like bacteria, viruses and fungi. Sheds should be cleaned and disinfected regularly. Vaccination against various diseases should be provided to farm animals. Vaccination should be given against various diseases. Milk production centres should be maintained for the animals which give birth to young ones. Milk production depends on duration of lactation period."
    },
    {
      "sub-topic": "Cross-Breeding in Cattle",
      "Content": "Cross-breeding is done between foreign and local breeds of animals to facilitate the growth of animals with desired qualities. e.g. Foreign breed like Jersey cow, with long lactation period, is crossed with local breed like Red Sindhi cow, with high resistance to disease, to obtain offspring of desired qualities like long lactation period and high resistance to diseases."
    },
    {
      "sub-topic": "Advantages of Cross-Breeding",
      "Content": "Cross-breeding helps in the development of certain desired characteristics in animals. To increase milk production, to increase resistance against diseases, to enhance the varieties with longer lactation period, to rely on less amount of quality feed."
    },
    {
      "sub-topic": "Poultry Farming",
      "Content": "Poultry farming is the practice of raising fowl for egg production and chicken meat. Fowls are used for producing eggs and broilers are used for producing meat. Cross –breeding is common in poultry to develop new varieties with the desirable traits. e.g Indian breed Aseel is cross-bred with the foreign breed Leghorn."
    },
    {
      "sub-topic": "Management Practices for Poultry Farming",
      "Content": "Management practices for poultry farming include maintaining optimum temperature, providing hygienic housing conditions, providing a protein-rich diet with high levels of vitamin A and K, and preventing and controlling pests and diseases."
    },
    {
      "sub-topic": "Common Management Practices in Dairy and Poultry",
      "Content": "Common management practices in dairy and poultry farming are: (i) Proper shelter facilities and their regular cleaning. (ii) Some basic hygienic conditions such as clean water, nutritious food, etc. (iii) Animals are kept in spacious, airy, and ventilated place. (iv) Prevention and cure of diseases at the right time is ensured."
    },
    {
      "sub-topic": "Fish Farming",
      "Content": "Fish farming is also called as aquaculture. This is culturing of fish for commercial purposes. Fish is a cheap source of animal protein."
    },
    {
      "sub-topic": "Types of Fishery",
      "Content": "Fish production involves fin fishery and shell fishery. Two main species of finned true fish are Catla and Rohu, and that of shellfish such as prawns and molluscs."
    },
    {
      "sub-topic": "Capture vs Culture Fishery",
      "Content": "Fish are obtained by capture fishing as an economic source for their meat. Capture fishing involves capturing of fish from sea water or fresh water. Culture fishing involves culturing the fish in small enclosures."
    },
    {
      "sub-topic": "Marine Fishery",
      "Content": "Mariculture is the culture of fish in marine water. Marine fishery involves fishing in salt water regions. Some examples of marine fish are Pomphret, Tuna and Mackerel. Fish are captured by locating large schools of fish, in the open sea, with the help of satellites and echo-sounders."
    },
    {
      "sub-topic": "Apiculture",
      "Content": "Apiculture is the scientific method of rearing honeybees for honey and wax. Beehives are enclosed structures in which honey bees live and raise their young. The practice of maintaining honey bee colonies in beehives is called bee-keeping or apiculture."
    }
  ]
}