{
  "topic": [
    {
      "sub-topic": "Introduction",
      "Content": "Natural resources such as water, forests, coal and petroleum, etc. are important for the survival of human beings."
    },
    {
      "sub-topic": "Ways to Reduce Consumption of Natural Resources",
      "Content": "(i) We should stop the cutting of trees (deforestation). (ii) We should use recycled paper to reduce the cutting down of trees. (iii) We should not waste water. (iv) We should practice rainwater harvesting. (v) We should practice car pooling to avoid the excessive use of petroleum. (vi) We should use alternative sources of energy such as hydro-energy and solar energy."
    },
    {
      "sub-topic": "Contributions to Conservation of Natural Resources",
      "Content": "(i) Limited use of water (ii) Plantation in free areas (iii) Irrigation of plants (iv) Limited use of petrol/diesel (v) Smokeless fuel utilization"
    },
    {
      "sub-topic": "Actions Increasing Pressure on Natural Resources",
      "Content": "(i) Extra use of water (ii) Day and night lighting (iii) Unnecessary trafficking by car (iv) Burning of polythene and wastes (v) Destroy the plants"
    },
    {
      "sub-topic": "Lifestyle Changes for Sustainable Resource Use",
      "Content": "(i) Stop cutting trees and practice plantation of trees. (ii) Stop using plastic and polythene bags for carrying goods. (iii) Use recycled paper. (iv) Throw biodegradable and non-biodegradable waste into separate bins. (v) Waste minimum amount of water while using and repair leaking taps. (vi) Practice rainwater harvesting. (vi) Avoid using vehicles for short distances. Instead, one can walk or cycle to cover short distances. To cover long distances, one should take a bus instead of using personal vehicles. (vii) Switch off electrical appliances when not in use. (viii) Use fluorescent tubes in place of bulbs to save electricity. (ix) Take stairs and avoid using lifts. (x) During winters, wear an extra sweater to avoid using heaters."
    },
    {
      "sub-topic": "Conservation of Water Resources",
      "Content": "(i) Leaking taps should be repaired. (ii) Water from industries should not be directly dumped in the river water. (iii) Use of insecticides and pesticides should be minimised, which are washed away with rain and contaminate river water and underground water. (iv) Methods like rainwater harvesting, construction of canal should be promoted. Construction of dams may also prove beneficial."
    },
    {
      "sub-topic": "Coal and Petroleum Usage",
      "Content": "(i) Use of coal and petroleum as a source of energy should be minimised, (ii) Use of CNG or LPG as fuels in automobiles. (iii) Renewable sources of energy like solar power, hydropower, wind energy, tidal energy, etc., should be used. It is better to walk over a short distance rather than going by car or scooter."
    }
  ]
}