{
  "topic": [
    {
      "sub-topic": "Excretion in Humans",
      "Content": "The kidneys in human beings are a part of the system for (a) nutrition. (c) excretion. (b) respiration. (d) transportation."
    },
    {
      "sub-topic": "Function of Nephrons",
      "Content": "In human beings, excretory products in the form of soluble nitrogen compounds are removed by the nephrons in the kidneys. Normally, in a healthy adult, the initial filtrate in the kidneys is about 180 L daily. However, the volume actually excreted is only a litre or two a day, because the remaining filtrate is re- absorbed in the kidney tubules."
    },
    {
      "sub-topic": "Organ Donation",
      "Content": "Organ donation is a generous act of donating an organ to a person who suffers from non-function of organ(s). Donation of an organ may be done by the consent of the donor and his/her family. Anyone regardless of age or gender can become an organ and tissue donor. Organ transplants can save or transform the life of a person. Transplantation is required because recipient’s organ has been damaged or has failed by disease or injury."
    },
    {
      "sub-topic": "Excretion in Plants",
      "Content": "Plants excrete waste products differently than animals. Oxygen can be considered a waste product generated during photosynthesis. Plants deal with excess water through transpiration, and they can lose parts like leaves to dispose of waste. They store many waste products in cellular vacuoles or release them into the soil. Waste products can also be stored in dead tissues."
    },
    {
      "sub-topic": "Respiration",
      "Content": "During the process of respiration, organic compounds such as glucose are broken down to provide energy in the form of ATP. ATP is used to provide energy for other reactions in the cell. Respiration may be aerobic or anaerobic, with aerobic respiration producing more energy."
    },
    {
      "sub-topic": "Circulatory System",
      "Content": "The circulatory system consists of the heart, blood, and blood vessels, responsible for transporting materials such as oxygen, carbon dioxide, food, and excretory products."
    },
    {
      "sub-topic": "Transport in Plants",
      "Content": "In highly differentiated plants, the transport of water, minerals, food, and other materials is facilitated by vascular tissues, which include xylem and phloem."
    },
    {
      "sub-topic": "Plant Waste Management",
      "Content": "Plants use a variety of techniques to get rid of waste material. For example, waste material may be stored in the cell-vacuoles, removed in falling leaves, or excreted into the surrounding soil."
    },
    {
      "sub-topic": "Autotrophic Nutrition",
      "Content": "The autotrophic mode of nutrition requires (a) carbon dioxide and water. (c) sunlight. (b) chlorophyll. (d) all of the above."
    },
    {
      "sub-topic": "Heterotrophic Nutrition",
      "Content": "Heterotrophic nutrition involves the intake of complex material prepared by other organisms. In human beings, food consumed is broken down along the alimentary canal, and the digested food is absorbed in the small intestine to nourish cells."
    },
    {
      "sub-topic": "Comparison of Alveoli and Nephrons",
      "Content": "Compare the functioning of alveoli in the lungs and nephrons in the kidneys with respect to their structure and functioning."
    }
  ]
}