{
  "samples": [
    {
      "context": "When a living plant cell loses water through osmosis there is shrinkage or contraction of the contents of the cell away from the cell wall. This phenomenon is known as plasmolysis. We can observe this phenomenon by performing the following activity: Activity ______________ 5.6 •Mount the peel of a Rhoeo leaf in water on a slide and examine cells under the high power of a microscope. Note the small green granules, called chloroplasts.",
      "question": "What is plasmolysis in plant cells?"
    },
    {
      "context": "The flexibility of the cell membrane also enables the cell to engulf in food and other material from its external environment. Such processes are known as endocytosis. Amoeba acquires its food through such processes. Cell Wall and Plasmolysis.",
      "question": "What is endocytosis in cells?"
    },
    {
      "context": "We can also try a similar activity with dried raisins or apricots. Activity ______________ 5.4 •Put dried raisins or apricots in plain water and leave them for some time. Then place them into a concentrated solution of sugar or salt.",
      "question": "What happens to dried fruits in pure water?"
    },
    {
      "context": "The shell is mostly calcium carbonate. A thin outer skin now encloses the egg. Put the egg in pure water and observe after 5 minutes. What do we observe? The egg swells because water passes into it by osmosis.",
      "question": "Why does the egg swell in pure water?"
    },
    {
      "context": "Thus, diffusion is important in exchange of gases and water in the life of a cell. In additions to this, the cell also obtains nutrition from its environment. Different molecules move in and out of the cell through a type of transport requiring use of energy.",
      "question": "Why is diffusion important for cells?"
    },
    {
      "context": "The plant cell wall is mainly composed of cellulose. Cellulose is a complex substance and provides structural strength to plants. When a living plant cell loses water through osmosis there is shrinkage or contraction of the contents of the cell away from the cell wall.",
      "question": "What provides structural strength to plant cells?"
    }
  ]
}