{
  "samples": [
    {
      "context": "Cork is a specialized tissue found in the bark of trees that serves as a protective barrier against physical damage and pathogens. It is composed of cork cells that are dead at maturity, which help reduce water loss and insulate the plant against extreme temperatures.",
      "question": "What role does cork play in plant protection?"
    },
    {
      "context": "Cork tissue, made up of dead cells, acts as insulation and protective covering. It helps in preventing water loss and protects the tree from insects and diseases, ensuring the plant's survival.",
      "question": "Why is cork tissue important for trees?"
    },
    {
      "context": "The inner lining of our mouth is made up of epithelial tissue, specifically stratified squamous epithelium, which serves as a protective barrier against abrasion and pathogens. This tissue is critical for maintaining oral health.",
      "question": "What type of tissue lines the mouth?"
    },
    {
      "context": "Tendons connect muscles to bones and are made up of dense connective tissue. They play a crucial role in facilitating movement by transmitting forces generated by muscle contractions to the skeleton.",
      "question": "What tissue connects muscle to bone?"
    },
    {
      "context": "In plants, phloem is the tissue responsible for transporting food, specifically the products of photosynthesis, from the leaves to other parts of the plant. This function is essential for plant growth and development.",
      "question": "What tissue is responsible for food transport in plants?"
    },
    {
      "context": "Adipose tissue is the connective tissue that stores fat in the human body. It serves as an energy reserve, insulation, and cushioning for organs and is vital for maintaining body temperature.",
      "question": "Which tissue stores fat in the body?"
    },
    {
      "context": "Blood is a connective tissue characterized by a fluid matrix known as plasma. It contains various cells such as red blood cells, white blood cells, and platelets, and plays essential roles in transportation and immune response.",
      "question": "What type of connective tissue has a fluid matrix?"
    },
    {
      "context": "Neural tissue, present in the brain, is composed of neurons and glial cells. It is responsible for receiving, processing, and transmitting information throughout the body via electrical and chemical signals.",
      "question": "What type of tissue is found in the brain?"
    }
  ]
}